TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Nov 28 13:34:34 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/HighLevel/mac_cfg.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\sensor_cc1350lp
      13                            .global macCfg
      14 00000000                   .sect   ".data:macCfg", RW

    2205                    
    2206                    $C$DW$T$540     .dwtag  DW_TAG_typedef
    2207                            .dwattr $C$DW$T$540, DW_AT_name("tFlashStateCommandsType")
    2208                            .dwattr $C$DW$T$540, DW_AT_type(*$C$DW$T$539)
    2209                            .dwattr $C$DW$T$540, DW_AT_language(DW_LANG_C)
    2210                            .dwattr $C$DW$T$540, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    2211                            .dwattr $C$DW$T$540, DW_AT_decl_line(0xb0)
    2212                            .dwattr $C$DW$T$540, DW_AT_decl_column(0x03)
    2213                    
    2214                    
    2215                    $C$DW$T$541     .dwtag  DW_TAG_enumeration_type
    2216                            .dwattr $C$DW$T$541, DW_AT_byte_size(0x01)
    2217                    $C$DW$241       .dwtag  DW_TAG_enumerator
    2218                            .dwattr $C$DW$241, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    2219                            .dwattr $C$DW$241, DW_AT_const_value(0xe0)
    2220                            .dwattr $C$DW$241, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2221                            .dwattr $C$DW$241, DW_AT_decl_line(0x3de)
    2222                            .dwattr $C$DW$241, DW_AT_decl_column(0x04)
    2223                    
    2224                    $C$DW$242       .dwtag  DW_TAG_enumerator
    2225                            .dwattr $C$DW$242, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    2226                            .dwattr $C$DW$242, DW_AT_const_value(0xe1)
    2227                            .dwattr $C$DW$242, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2228                            .dwattr $C$DW$242, DW_AT_decl_line(0x3e0)
    2229                            .dwattr $C$DW$242, DW_AT_decl_column(0x04)
    2230                    
    2231                    $C$DW$243       .dwtag  DW_TAG_enumerator
    2232                            .dwattr $C$DW$243, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    2233                            .dwattr $C$DW$243, DW_AT_const_value(0xe2)
    2234                            .dwattr $C$DW$243, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2235                            .dwattr $C$DW$243, DW_AT_decl_line(0x3e2)
    2236                            .dwattr $C$DW$243, DW_AT_decl_column(0x04)
    2237                    
    2238                    $C$DW$244       .dwtag  DW_TAG_enumerator
    2239                            .dwattr $C$DW$244, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    2240                            .dwattr $C$DW$244, DW_AT_const_value(0xe3)
    2241                            .dwattr $C$DW$244, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2242                            .dwattr $C$DW$244, DW_AT_decl_line(0x3e4)
    2243                            .dwattr $C$DW$244, DW_AT_decl_column(0x04)
    2244                    
    2245                    $C$DW$245       .dwtag  DW_TAG_enumerator
    2246                            .dwattr $C$DW$245, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    2247                            .dwattr $C$DW$245, DW_AT_const_value(0xe4)
    2248                            .dwattr $C$DW$245, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2249                            .dwattr $C$DW$245, DW_AT_decl_line(0x3e6)
    2250                            .dwattr $C$DW$245, DW_AT_decl_column(0x04)
    2251                    
    2252                    $C$DW$246       .dwtag  DW_TAG_enumerator
    2253                            .dwattr $C$DW$246, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    2254                            .dwattr $C$DW$246, DW_AT_const_value(0xe5)
    2255                            .dwattr $C$DW$246, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   42

    2256                            .dwattr $C$DW$246, DW_AT_decl_line(0x3e8)
    2257                            .dwattr $C$DW$246, DW_AT_decl_column(0x04)
    2258                    
    2259                            .dwattr $C$DW$T$541, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2260                            .dwattr $C$DW$T$541, DW_AT_decl_line(0x3dc)
    2261                            .dwattr $C$DW$T$541, DW_AT_decl_column(0x01)
    2262                            .dwendtag $C$DW$T$541
    2263                    
    2264                    $C$DW$T$542     .dwtag  DW_TAG_typedef
    2265                            .dwattr $C$DW$T$542, DW_AT_name("ICall_RemotiCmdEvent_t")
    2266                            .dwattr $C$DW$T$542, DW_AT_type(*$C$DW$T$541)
    2267                            .dwattr $C$DW$T$542, DW_AT_language(DW_LANG_C)
    2268                            .dwattr $C$DW$T$542, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2269                            .dwattr $C$DW$T$542, DW_AT_decl_line(0x3e9)
    2270                            .dwattr $C$DW$T$542, DW_AT_decl_column(0x02)
    2271                    
    2272                    
    2273                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2274                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x10)
    2275                    $C$DW$247       .dwtag  DW_TAG_member
    2276                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$22)
    2277                            .dwattr $C$DW$247, DW_AT_name("txDataMax")
    2278                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("txDataMax")
    2279                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2280                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2281                            .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2282                            .dwattr $C$DW$247, DW_AT_decl_line(0x53c)
    2283                            .dwattr $C$DW$247, DW_AT_decl_column(0x11)
    2284                    
    2285                    $C$DW$248       .dwtag  DW_TAG_member
    2286                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$22)
    2287                            .dwattr $C$DW$248, DW_AT_name("txMax")
    2288                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("txMax")
    2289                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2290                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2291                            .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2292                            .dwattr $C$DW$248, DW_AT_decl_line(0x53d)
    2293                            .dwattr $C$DW$248, DW_AT_decl_column(0x11)
    2294                    
    2295                    $C$DW$249       .dwtag  DW_TAG_member
    2296                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$22)
    2297                            .dwattr $C$DW$249, DW_AT_name("rxMax")
    2298                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("rxMax")
    2299                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2300                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2301                            .dwattr $C$DW$249, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2302                            .dwattr $C$DW$249, DW_AT_decl_line(0x53e)
    2303                            .dwattr $C$DW$249, DW_AT_decl_column(0x11)
    2304                    
    2305                    $C$DW$250       .dwtag  DW_TAG_member
    2306                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$22)
    2307                            .dwattr $C$DW$250, DW_AT_name("dataIndOffset")
    2308                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("dataIndOffset")
    2309                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2310                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   43

    2311                            .dwattr $C$DW$250, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2312                            .dwattr $C$DW$250, DW_AT_decl_line(0x53f)
    2313                            .dwattr $C$DW$250, DW_AT_decl_column(0x11)
    2314                    
    2315                    $C$DW$251       .dwtag  DW_TAG_member
    2316                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$24)
    2317                            .dwattr $C$DW$251, DW_AT_name("maxDeviceTableEntries")
    2318                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("maxDeviceTableEntries")
    2319                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2320                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2321                            .dwattr $C$DW$251, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2322                            .dwattr $C$DW$251, DW_AT_decl_line(0x541)
    2323                            .dwattr $C$DW$251, DW_AT_decl_column(0x11)
    2324                    
    2325                    $C$DW$252       .dwtag  DW_TAG_member
    2326                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$24)
    2327                            .dwattr $C$DW$252, DW_AT_name("maxKeyDeviceTableEntries")
    2328                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("maxKeyDeviceTableEntries")
    2329                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2330                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2331                            .dwattr $C$DW$252, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2332                            .dwattr $C$DW$252, DW_AT_decl_line(0x542)
    2333                            .dwattr $C$DW$252, DW_AT_decl_column(0x11)
    2334                    
    2335                    $C$DW$253       .dwtag  DW_TAG_member
    2336                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$24)
    2337                            .dwattr $C$DW$253, DW_AT_name("maxKeyTableEntries")
    2338                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("maxKeyTableEntries")
    2339                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2340                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2341                            .dwattr $C$DW$253, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2342                            .dwattr $C$DW$253, DW_AT_decl_line(0x543)
    2343                            .dwattr $C$DW$253, DW_AT_decl_column(0x11)
    2344                    
    2345                    $C$DW$254       .dwtag  DW_TAG_member
    2346                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$22)
    2347                            .dwattr $C$DW$254, DW_AT_name("maxNodeKeyTableEntries")
    2348                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("maxNodeKeyTableEntries")
    2349                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2350                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2351                            .dwattr $C$DW$254, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2352                            .dwattr $C$DW$254, DW_AT_decl_line(0x544)
    2353                            .dwattr $C$DW$254, DW_AT_decl_column(0x11)
    2354                    
    2355                    $C$DW$255       .dwtag  DW_TAG_member
    2356                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$22)
    2357                            .dwattr $C$DW$255, DW_AT_name("maxKeyIdLookUpEntries")
    2358                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("maxKeyIdLookUpEntries")
    2359                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2360                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2361                            .dwattr $C$DW$255, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2362                            .dwattr $C$DW$255, DW_AT_decl_line(0x545)
    2363                            .dwattr $C$DW$255, DW_AT_decl_column(0x11)
    2364                    
    2365                    $C$DW$256       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   44

    2366                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$26)
    2367                            .dwattr $C$DW$256, DW_AT_name("appPendingQueue")
    2368                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("appPendingQueue")
    2369                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2370                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2371                            .dwattr $C$DW$256, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2372                            .dwattr $C$DW$256, DW_AT_decl_line(0x546)
    2373                            .dwattr $C$DW$256, DW_AT_decl_column(0x11)
    2374                    
    2375                    $C$DW$257       .dwtag  DW_TAG_member
    2376                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$23)
    2377                            .dwattr $C$DW$257, DW_AT_name("macMaxFrameSize")
    2378                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("macMaxFrameSize")
    2379                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2380                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2381                            .dwattr $C$DW$257, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2382                            .dwattr $C$DW$257, DW_AT_decl_line(0x548)
    2383                            .dwattr $C$DW$257, DW_AT_decl_column(0x11)
    2384                    
    2385                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2386                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x53b)
    2387                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
    2388                            .dwendtag $C$DW$T$27
    2389                    
    2390                    $C$DW$T$543     .dwtag  DW_TAG_typedef
    2391                            .dwattr $C$DW$T$543, DW_AT_name("macCfg_t")
    2392                            .dwattr $C$DW$T$543, DW_AT_type(*$C$DW$T$27)
    2393                            .dwattr $C$DW$T$543, DW_AT_language(DW_LANG_C)
    2394                            .dwattr $C$DW$T$543, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2395                            .dwattr $C$DW$T$543, DW_AT_decl_line(0x549)
    2396                            .dwattr $C$DW$T$543, DW_AT_decl_column(0x03)
    2397                    
    2398                    
    2399                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2400                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x10)
    2401                    $C$DW$258       .dwtag  DW_TAG_member
    2402                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$14)
    2403                            .dwattr $C$DW$258, DW_AT_name("__max_align1")
    2404                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("__max_align1")
    2405                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2406                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2407                            .dwattr $C$DW$258, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    2408                            .dwattr $C$DW$258, DW_AT_decl_line(0x70)
    2409                            .dwattr $C$DW$258, DW_AT_decl_column(0x0c)
    2410                    
    2411                    $C$DW$259       .dwtag  DW_TAG_member
    2412                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$18)
    2413                            .dwattr $C$DW$259, DW_AT_name("__max_align2")
    2414                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("__max_align2")
    2415                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2416                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2417                            .dwattr $C$DW$259, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    2418                            .dwattr $C$DW$259, DW_AT_decl_line(0x71)
    2419                            .dwattr $C$DW$259, DW_AT_decl_column(0x0e)
    2420                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   45

    2421                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    2422                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x6f)
    2423                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2424                            .dwendtag $C$DW$T$28
    2425                    
    2426                    $C$DW$T$544     .dwtag  DW_TAG_typedef
    2427                            .dwattr $C$DW$T$544, DW_AT_name("__max_align_t")
    2428                            .dwattr $C$DW$T$544, DW_AT_type(*$C$DW$T$28)
    2429                            .dwattr $C$DW$T$544, DW_AT_language(DW_LANG_C)
    2430                            .dwattr $C$DW$T$544, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    2431                            .dwattr $C$DW$T$544, DW_AT_decl_line(0x72)
    2432                            .dwattr $C$DW$T$544, DW_AT_decl_column(0x03)
    2433                    
    2434                    
    2435                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2436                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    2437                    $C$DW$260       .dwtag  DW_TAG_member
    2438                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$187)
    2439                            .dwattr $C$DW$260, DW_AT_name("addr")
    2440                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("addr")
    2441                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2442                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2443                            .dwattr $C$DW$260, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/S
    2444                            .dwattr $C$DW$260, DW_AT_decl_line(0x55)
    2445                            .dwattr $C$DW$260, DW_AT_decl_column(0x05)
    2446                    
    2447                    $C$DW$261       .dwtag  DW_TAG_member
    2448                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$30)
    2449                            .dwattr $C$DW$261, DW_AT_name("addrMode")
    2450                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("addrMode")
    2451                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2452                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2453                            .dwattr $C$DW$261, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/S
    2454                            .dwattr $C$DW$261, DW_AT_decl_line(0x56)
    2455                            .dwattr $C$DW$261, DW_AT_decl_column(0x13)
    2456                    
    2457                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/
    2458                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x50)
    2459                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
    2460                            .dwendtag $C$DW$T$31
    2461                    
    2462                    $C$DW$T$87      .dwtag  DW_TAG_typedef
    2463                            .dwattr $C$DW$T$87, DW_AT_name("sAddr_t")
    2464                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$31)
    2465                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2466                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/
    2467                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x57)
    2468                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
    2469                    
    2470                    
    2471                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2472                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x08)
    2473                    $C$DW$262       .dwtag  DW_TAG_member
    2474                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$32)
    2475                            .dwattr $C$DW$262, DW_AT_name("p")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   46

    2476                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("p")
    2477                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2478                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2479                            .dwattr $C$DW$262, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/S
    2480                            .dwattr $C$DW$262, DW_AT_decl_line(0x3d)
    2481                            .dwattr $C$DW$262, DW_AT_decl_column(0x0e)
    2482                    
    2483                    $C$DW$263       .dwtag  DW_TAG_member
    2484                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$23)
    2485                            .dwattr $C$DW$263, DW_AT_name("len")
    2486                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("len")
    2487                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2488                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2489                            .dwattr $C$DW$263, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/S
    2490                            .dwattr $C$DW$263, DW_AT_decl_line(0x3e)
    2491                            .dwattr $C$DW$263, DW_AT_decl_column(0x0e)
    2492                    
    2493                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/
    2494                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x3c)
    2495                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    2496                            .dwendtag $C$DW$T$33
    2497                    
    2498                    $C$DW$T$90      .dwtag  DW_TAG_typedef
    2499                            .dwattr $C$DW$T$90, DW_AT_name("sData_t")
    2500                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$33)
    2501                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    2502                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/
    2503                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x3f)
    2504                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x03)
    2505                    
    2506                    
    2507                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2508                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
    2509                    $C$DW$264       .dwtag  DW_TAG_member
    2510                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$189)
    2511                            .dwattr $C$DW$264, DW_AT_name("addr")
    2512                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("addr")
    2513                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2514                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2515                            .dwattr $C$DW$264, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/a
    2516                            .dwattr $C$DW$264, DW_AT_decl_line(0x4db)
    2517                            .dwattr $C$DW$264, DW_AT_decl_column(0x07)
    2518                    
    2519                    $C$DW$265       .dwtag  DW_TAG_member
    2520                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$35)
    2521                            .dwattr $C$DW$265, DW_AT_name("addrMode")
    2522                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("addrMode")
    2523                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2524                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2525                            .dwattr $C$DW$265, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/a
    2526                            .dwattr $C$DW$265, DW_AT_decl_line(0x4de)
    2527                            .dwattr $C$DW$265, DW_AT_decl_column(0x17)
    2528                    
    2529                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/
    2530                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x4d0)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   47

    2531                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    2532                            .dwendtag $C$DW$T$36
    2533                    
    2534                    $C$DW$T$338     .dwtag  DW_TAG_typedef
    2535                            .dwattr $C$DW$T$338, DW_AT_name("ApiMac_sAddr_t")
    2536                            .dwattr $C$DW$T$338, DW_AT_type(*$C$DW$T$36)
    2537                            .dwattr $C$DW$T$338, DW_AT_language(DW_LANG_C)
    2538                            .dwattr $C$DW$T$338, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application
    2539                            .dwattr $C$DW$T$338, DW_AT_decl_line(0x4df)
    2540                            .dwattr $C$DW$T$338, DW_AT_decl_column(0x03)
    2541                    
    2542                    
    2543                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2544                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
    2545                    $C$DW$266       .dwtag  DW_TAG_member
    2546                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$38)
    2547                            .dwattr $C$DW$266, DW_AT_name("frameCounter")
    2548                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("frameCounter")
    2549                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2550                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2551                            .dwattr $C$DW$266, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/a
    2552                            .dwattr $C$DW$266, DW_AT_decl_line(0x575)
    2553                            .dwattr $C$DW$266, DW_AT_decl_column(0x1a)
    2554                    
    2555                    $C$DW$267       .dwtag  DW_TAG_member
    2556                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$40)
    2557                            .dwattr $C$DW$267, DW_AT_name("keyIdx")
    2558                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("keyIdx")
    2559                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2560                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2561                            .dwattr $C$DW$267, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/a
    2562                            .dwattr $C$DW$267, DW_AT_decl_line(0x576)
    2563                            .dwattr $C$DW$267, DW_AT_decl_column(0x1a)
    2564                    
    2565                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/
    2566                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x574)
    2567                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    2568                            .dwendtag $C$DW$T$41
    2569                    
    2570                    $C$DW$T$400     .dwtag  DW_TAG_typedef
    2571                            .dwattr $C$DW$T$400, DW_AT_name("ApiMac_frameCntr_t")
    2572                            .dwattr $C$DW$T$400, DW_AT_type(*$C$DW$T$41)
    2573                            .dwattr $C$DW$T$400, DW_AT_language(DW_LANG_C)
    2574                            .dwattr $C$DW$T$400, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application
    2575                            .dwattr $C$DW$T$400, DW_AT_decl_line(0x577)
    2576                            .dwattr $C$DW$T$400, DW_AT_decl_column(0x03)
    2577                    
    2578                    $C$DW$T$401     .dwtag  DW_TAG_pointer_type
    2579                            .dwattr $C$DW$T$401, DW_AT_type(*$C$DW$T$400)
    2580                            .dwattr $C$DW$T$401, DW_AT_address_class(0x20)
    2581                    
    2582                    
    2583                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2584                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x40)
    2585                    $C$DW$268       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   48

    2586                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$43)
    2587                            .dwattr $C$DW$268, DW_AT_name("beaconType")
    2588                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("beaconType")
    2589                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2590                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2591                            .dwattr $C$DW$268, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/a
    2592                            .dwattr $C$DW$268, DW_AT_decl_line(0x886)
    2593                            .dwattr $C$DW$268, DW_AT_decl_column(0x19)
    2594                    
    2595                    $C$DW$269       .dwtag  DW_TAG_member
    2596                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$30)
    2597                            .dwattr $C$DW$269, DW_AT_name("bsn")
    2598                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("bsn")
    2599                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2600                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2601                            .dwattr $C$DW$269, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/a
    2602                            .dwattr $C$DW$269, DW_AT_decl_line(0x888)
    2603                            .dwattr $C$DW$269, DW_AT_decl_column(0x0d)
    2604                    
    2605                    $C$DW$270       .dwtag  DW_TAG_member
    2606                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$44)
    2607                            .dwattr $C$DW$270, DW_AT_name("panDesc")
    2608                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("panDesc")
    2609                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2610                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2611                            .dwattr $C$DW$270, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/a
    2612                            .dwattr $C$DW$270, DW_AT_decl_line(0x88a)
    2613                            .dwattr $C$DW$270, DW_AT_decl_column(0x16)
    2614                    
    2615                    $C$DW$271       .dwtag  DW_TAG_member
    2616                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$192)
    2617                            .dwattr $C$DW$271, DW_AT_name("beaconData")
    2618                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("beaconData")
    2619                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2620                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2621                            .dwattr $C$DW$271, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/a
    2622                            .dwattr $C$DW$271, DW_AT_decl_line(0x895)
    2623                            .dwattr $C$DW$271, DW_AT_decl_column(0x07)
    2624                    
    2625                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/
    2626                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x884)
    2627                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
    2628                            .dwendtag $C$DW$T$45
    2629                    
    2630                    $C$DW$T$252     .dwtag  DW_TAG_typedef
    2631                            .dwattr $C$DW$T$252, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    2632                            .dwattr $C$DW$T$252, DW_AT_type(*$C$DW$T$45)
    2633                            .dwattr $C$DW$T$252, DW_AT_language(DW_LANG_C)
    2634                            .dwattr $C$DW$T$252, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application
    2635                            .dwattr $C$DW$T$252, DW_AT_decl_line(0x896)
    2636                            .dwattr $C$DW$T$252, DW_AT_decl_column(0x03)
    2637                    
    2638                    $C$DW$T$253     .dwtag  DW_TAG_pointer_type
    2639                            .dwattr $C$DW$T$253, DW_AT_type(*$C$DW$T$252)
    2640                            .dwattr $C$DW$T$253, DW_AT_address_class(0x20)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   49

    2641                    
    2642                    
    2643                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2644                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x10)
    2645                    $C$DW$272       .dwtag  DW_TAG_member
    2646                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$46)
    2647                            .dwattr $C$DW$272, DW_AT_name("firstChCentrFreq")
    2648                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("firstChCentrFreq")
    2649                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2650                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2651                            .dwattr $C$DW$272, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2652                            .dwattr $C$DW$272, DW_AT_decl_line(0x29b)
    2653                            .dwattr $C$DW$272, DW_AT_decl_column(0x0a)
    2654                    
    2655                    $C$DW$273       .dwtag  DW_TAG_member
    2656                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$46)
    2657                            .dwattr $C$DW$273, DW_AT_name("channelSpacing")
    2658                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("channelSpacing")
    2659                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2660                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2661                            .dwattr $C$DW$273, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2662                            .dwattr $C$DW$273, DW_AT_decl_line(0x29c)
    2663                            .dwattr $C$DW$273, DW_AT_decl_column(0x0a)
    2664                    
    2665                    $C$DW$274       .dwtag  DW_TAG_member
    2666                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$23)
    2667                            .dwattr $C$DW$274, DW_AT_name("noOfChannels")
    2668                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("noOfChannels")
    2669                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2670                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2671                            .dwattr $C$DW$274, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2672                            .dwattr $C$DW$274, DW_AT_decl_line(0x29d)
    2673                            .dwattr $C$DW$274, DW_AT_decl_column(0x0a)
    2674                    
    2675                    $C$DW$275       .dwtag  DW_TAG_member
    2676                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$21)
    2677                            .dwattr $C$DW$275, DW_AT_name("fskModScheme")
    2678                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("fskModScheme")
    2679                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2680                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2681                            .dwattr $C$DW$275, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2682                            .dwattr $C$DW$275, DW_AT_decl_line(0x29f)
    2683                            .dwattr $C$DW$275, DW_AT_decl_column(0x09)
    2684                    
    2685                    $C$DW$276       .dwtag  DW_TAG_member
    2686                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$23)
    2687                            .dwattr $C$DW$276, DW_AT_name("symbolRate")
    2688                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("symbolRate")
    2689                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2690                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2691                            .dwattr $C$DW$276, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2692                            .dwattr $C$DW$276, DW_AT_decl_line(0x2a1)
    2693                            .dwattr $C$DW$276, DW_AT_decl_column(0x0a)
    2694                    
    2695                    $C$DW$277       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   50

    2696                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$21)
    2697                            .dwattr $C$DW$277, DW_AT_name("fskModIndex")
    2698                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("fskModIndex")
    2699                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2700                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2701                            .dwattr $C$DW$277, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2702                            .dwattr $C$DW$277, DW_AT_decl_line(0x2a2)
    2703                            .dwattr $C$DW$277, DW_AT_decl_column(0x09)
    2704                    
    2705                    $C$DW$278       .dwtag  DW_TAG_member
    2706                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$21)
    2707                            .dwattr $C$DW$278, DW_AT_name("ccaType")
    2708                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("ccaType")
    2709                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2710                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2711                            .dwattr $C$DW$278, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2712                            .dwattr $C$DW$278, DW_AT_decl_line(0x2aa)
    2713                            .dwattr $C$DW$278, DW_AT_decl_column(0x09)
    2714                    
    2715                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2716                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x29a)
    2717                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
    2718                            .dwendtag $C$DW$T$47
    2719                    
    2720                    $C$DW$T$545     .dwtag  DW_TAG_typedef
    2721                            .dwattr $C$DW$T$545, DW_AT_name("macMRFSKPHYDesc_t")
    2722                            .dwattr $C$DW$T$545, DW_AT_type(*$C$DW$T$47)
    2723                            .dwattr $C$DW$T$545, DW_AT_language(DW_LANG_C)
    2724                            .dwattr $C$DW$T$545, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2725                            .dwattr $C$DW$T$545, DW_AT_decl_line(0x2ab)
    2726                            .dwattr $C$DW$T$545, DW_AT_decl_column(0x03)
    2727                    
    2728                    $C$DW$T$546     .dwtag  DW_TAG_typedef
    2729                            .dwattr $C$DW$T$546, DW_AT_name("macPHYDesc_t")
    2730                            .dwattr $C$DW$T$546, DW_AT_type(*$C$DW$T$545)
    2731                            .dwattr $C$DW$T$546, DW_AT_language(DW_LANG_C)
    2732                            .dwattr $C$DW$T$546, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2733                            .dwattr $C$DW$T$546, DW_AT_decl_line(0x2b1)
    2734                            .dwattr $C$DW$T$546, DW_AT_decl_column(0x1b)
    2735                    
    2736                    
    2737                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2738                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    2739                    $C$DW$279       .dwtag  DW_TAG_member
    2740                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$21)
    2741                            .dwattr $C$DW$279, DW_AT_name("event")
    2742                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("event")
    2743                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2744                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2745                            .dwattr $C$DW$279, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2746                            .dwattr $C$DW$279, DW_AT_decl_line(0x2b6)
    2747                            .dwattr $C$DW$279, DW_AT_decl_column(0x0b)
    2748                    
    2749                    $C$DW$280       .dwtag  DW_TAG_member
    2750                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$21)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   51

    2751                            .dwattr $C$DW$280, DW_AT_name("status")
    2752                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("status")
    2753                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2754                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2755                            .dwattr $C$DW$280, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2756                            .dwattr $C$DW$280, DW_AT_decl_line(0x2b7)
    2757                            .dwattr $C$DW$280, DW_AT_decl_column(0x0b)
    2758                    
    2759                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2760                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x2b5)
    2761                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    2762                            .dwendtag $C$DW$T$48
    2763                    
    2764                    $C$DW$T$89      .dwtag  DW_TAG_typedef
    2765                            .dwattr $C$DW$T$89, DW_AT_name("macEventHdr_t")
    2766                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$48)
    2767                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    2768                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2769                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x2b8)
    2770                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x03)
    2771                    
    2772                    
    2773                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2774                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x0c)
    2775                    $C$DW$281       .dwtag  DW_TAG_member
    2776                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$49)
    2777                            .dwattr $C$DW$281, DW_AT_name("keySource")
    2778                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("keySource")
    2779                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2780                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2781                            .dwattr $C$DW$281, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2782                            .dwattr $C$DW$281, DW_AT_decl_line(0x2bd)
    2783                            .dwattr $C$DW$281, DW_AT_decl_column(0x0b)
    2784                    
    2785                    $C$DW$282       .dwtag  DW_TAG_member
    2786                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$21)
    2787                            .dwattr $C$DW$282, DW_AT_name("securityLevel")
    2788                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("securityLevel")
    2789                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2790                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2791                            .dwattr $C$DW$282, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2792                            .dwattr $C$DW$282, DW_AT_decl_line(0x2be)
    2793                            .dwattr $C$DW$282, DW_AT_decl_column(0x0b)
    2794                    
    2795                    $C$DW$283       .dwtag  DW_TAG_member
    2796                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$21)
    2797                            .dwattr $C$DW$283, DW_AT_name("keyIdMode")
    2798                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("keyIdMode")
    2799                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2800                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2801                            .dwattr $C$DW$283, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2802                            .dwattr $C$DW$283, DW_AT_decl_line(0x2bf)
    2803                            .dwattr $C$DW$283, DW_AT_decl_column(0x0b)
    2804                    
    2805                    $C$DW$284       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   52

    2806                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$23)
    2807                            .dwattr $C$DW$284, DW_AT_name("keyIndex")
    2808                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("keyIndex")
    2809                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2810                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2811                            .dwattr $C$DW$284, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2812                            .dwattr $C$DW$284, DW_AT_decl_line(0x2c0)
    2813                            .dwattr $C$DW$284, DW_AT_decl_column(0x0b)
    2814                    
    2815                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2816                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2bc)
    2817                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    2818                            .dwendtag $C$DW$T$50
    2819                    
    2820                    $C$DW$T$547     .dwtag  DW_TAG_typedef
    2821                            .dwattr $C$DW$T$547, DW_AT_name("macSec_t")
    2822                            .dwattr $C$DW$T$547, DW_AT_type(*$C$DW$T$50)
    2823                            .dwattr $C$DW$T$547, DW_AT_language(DW_LANG_C)
    2824                            .dwattr $C$DW$T$547, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2825                            .dwattr $C$DW$T$547, DW_AT_decl_line(0x2c1)
    2826                            .dwattr $C$DW$T$547, DW_AT_decl_column(0x03)
    2827                    
    2828                    
    2829                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    2830                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x0a)
    2831                    $C$DW$285       .dwtag  DW_TAG_member
    2832                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$51)
    2833                            .dwattr $C$DW$285, DW_AT_name("lookupData")
    2834                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("lookupData")
    2835                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2836                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2837                            .dwattr $C$DW$285, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2838                            .dwattr $C$DW$285, DW_AT_decl_line(0x2c6)
    2839                            .dwattr $C$DW$285, DW_AT_decl_column(0x16)
    2840                    
    2841                    $C$DW$286       .dwtag  DW_TAG_member
    2842                            .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$21)
    2843                            .dwattr $C$DW$286, DW_AT_name("lookupDataSize")
    2844                            .dwattr $C$DW$286, DW_AT_TI_symbol_name("lookupDataSize")
    2845                            .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2846                            .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2847                            .dwattr $C$DW$286, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2848                            .dwattr $C$DW$286, DW_AT_decl_line(0x2c7)
    2849                            .dwattr $C$DW$286, DW_AT_decl_column(0x16)
    2850                    
    2851                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2852                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x2c5)
    2853                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
    2854                            .dwendtag $C$DW$T$52
    2855                    
    2856                    $C$DW$T$55      .dwtag  DW_TAG_typedef
    2857                            .dwattr $C$DW$T$55, DW_AT_name("keyIdLookupDescriptor_t")
    2858                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$52)
    2859                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    2860                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   53

    2861                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x2c8)
    2862                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x03)
    2863                    
    2864                    $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    2865                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2866                            .dwattr $C$DW$T$56, DW_AT_address_class(0x20)
    2867                    
    2868                    
    2869                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    2870                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x04)
    2871                    $C$DW$287       .dwtag  DW_TAG_member
    2872                            .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$23)
    2873                            .dwattr $C$DW$287, DW_AT_name("deviceDescriptorHandle")
    2874                            .dwattr $C$DW$287, DW_AT_TI_symbol_name("deviceDescriptorHandle")
    2875                            .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2876                            .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2877                            .dwattr $C$DW$287, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2878                            .dwattr $C$DW$287, DW_AT_decl_line(0x2cd)
    2879                            .dwattr $C$DW$287, DW_AT_decl_column(0x16)
    2880                    
    2881                    $C$DW$288       .dwtag  DW_TAG_member
    2882                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$25)
    2883                            .dwattr $C$DW$288, DW_AT_name("uniqueDevice")
    2884                            .dwattr $C$DW$288, DW_AT_TI_symbol_name("uniqueDevice")
    2885                            .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2886                            .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2887                            .dwattr $C$DW$288, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2888                            .dwattr $C$DW$288, DW_AT_decl_line(0x2ce)
    2889                            .dwattr $C$DW$288, DW_AT_decl_column(0x16)
    2890                    
    2891                    $C$DW$289       .dwtag  DW_TAG_member
    2892                            .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$25)
    2893                            .dwattr $C$DW$289, DW_AT_name("blackListed")
    2894                            .dwattr $C$DW$289, DW_AT_TI_symbol_name("blackListed")
    2895                            .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2896                            .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2897                            .dwattr $C$DW$289, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2898                            .dwattr $C$DW$289, DW_AT_decl_line(0x2cf)
    2899                            .dwattr $C$DW$289, DW_AT_decl_column(0x16)
    2900                    
    2901                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2902                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x2cc)
    2903                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    2904                            .dwendtag $C$DW$T$53
    2905                    
    2906                    $C$DW$T$57      .dwtag  DW_TAG_typedef
    2907                            .dwattr $C$DW$T$57, DW_AT_name("keyDeviceDescriptor_t")
    2908                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$53)
    2909                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    2910                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2911                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x2d0)
    2912                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x03)
    2913                    
    2914                    $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    2915                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   54

    2916                            .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    2917                    
    2918                    
    2919                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    2920                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x02)
    2921                    $C$DW$290       .dwtag  DW_TAG_member
    2922                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$21)
    2923                            .dwattr $C$DW$290, DW_AT_name("frameType")
    2924                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("frameType")
    2925                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2926                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2927                            .dwattr $C$DW$290, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2928                            .dwattr $C$DW$290, DW_AT_decl_line(0x2d5)
    2929                            .dwattr $C$DW$290, DW_AT_decl_column(0x16)
    2930                    
    2931                    $C$DW$291       .dwtag  DW_TAG_member
    2932                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$21)
    2933                            .dwattr $C$DW$291, DW_AT_name("cmdFrameId")
    2934                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("cmdFrameId")
    2935                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2936                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2937                            .dwattr $C$DW$291, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2938                            .dwattr $C$DW$291, DW_AT_decl_line(0x2d6)
    2939                            .dwattr $C$DW$291, DW_AT_decl_column(0x16)
    2940                    
    2941                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2942                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x2d4)
    2943                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
    2944                            .dwendtag $C$DW$T$54
    2945                    
    2946                    $C$DW$T$59      .dwtag  DW_TAG_typedef
    2947                            .dwattr $C$DW$T$59, DW_AT_name("keyUsageDescriptor_t")
    2948                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$54)
    2949                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2950                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2951                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x2d7)
    2952                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x03)
    2953                    
    2954                    $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    2955                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2956                            .dwattr $C$DW$T$60, DW_AT_address_class(0x20)
    2957                    
    2958                    
    2959                    $C$DW$T$62      .dwtag  DW_TAG_structure_type
    2960                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x2c)
    2961                    $C$DW$292       .dwtag  DW_TAG_member
    2962                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$56)
    2963                            .dwattr $C$DW$292, DW_AT_name("keyIdLookupList")
    2964                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("keyIdLookupList")
    2965                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2966                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2967                            .dwattr $C$DW$292, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2968                            .dwattr $C$DW$292, DW_AT_decl_line(0x2dc)
    2969                            .dwattr $C$DW$292, DW_AT_decl_column(0x1d)
    2970                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   55

    2971                    $C$DW$293       .dwtag  DW_TAG_member
    2972                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$21)
    2973                            .dwattr $C$DW$293, DW_AT_name("keyIdLookupEntries")
    2974                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("keyIdLookupEntries")
    2975                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2976                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2977                            .dwattr $C$DW$293, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2978                            .dwattr $C$DW$293, DW_AT_decl_line(0x2dd)
    2979                            .dwattr $C$DW$293, DW_AT_decl_column(0x1c)
    2980                    
    2981                    $C$DW$294       .dwtag  DW_TAG_member
    2982                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$58)
    2983                            .dwattr $C$DW$294, DW_AT_name("keyDeviceList")
    2984                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("keyDeviceList")
    2985                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2986                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2987                            .dwattr $C$DW$294, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2988                            .dwattr $C$DW$294, DW_AT_decl_line(0x2df)
    2989                            .dwattr $C$DW$294, DW_AT_decl_column(0x1d)
    2990                    
    2991                    $C$DW$295       .dwtag  DW_TAG_member
    2992                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$23)
    2993                            .dwattr $C$DW$295, DW_AT_name("keyDeviceListEntries")
    2994                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("keyDeviceListEntries")
    2995                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2996                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2997                            .dwattr $C$DW$295, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2998                            .dwattr $C$DW$295, DW_AT_decl_line(0x2e2)
    2999                            .dwattr $C$DW$295, DW_AT_decl_column(0x1d)
    3000                    
    3001                    $C$DW$296       .dwtag  DW_TAG_member
    3002                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$60)
    3003                            .dwattr $C$DW$296, DW_AT_name("keyUsageList")
    3004                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("keyUsageList")
    3005                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3006                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3007                            .dwattr $C$DW$296, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3008                            .dwattr $C$DW$296, DW_AT_decl_line(0x2e4)
    3009                            .dwattr $C$DW$296, DW_AT_decl_column(0x1d)
    3010                    
    3011                    $C$DW$297       .dwtag  DW_TAG_member
    3012                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$21)
    3013                            .dwattr $C$DW$297, DW_AT_name("keyUsageListEntries")
    3014                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("keyUsageListEntries")
    3015                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3016                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3017                            .dwattr $C$DW$297, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3018                            .dwattr $C$DW$297, DW_AT_decl_line(0x2e6)
    3019                            .dwattr $C$DW$297, DW_AT_decl_column(0x1c)
    3020                    
    3021                    $C$DW$298       .dwtag  DW_TAG_member
    3022                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$61)
    3023                            .dwattr $C$DW$298, DW_AT_name("key")
    3024                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("key")
    3025                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   56

    3026                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3027                            .dwattr $C$DW$298, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3028                            .dwattr $C$DW$298, DW_AT_decl_line(0x2e8)
    3029                            .dwattr $C$DW$298, DW_AT_decl_column(0x1c)
    3030                    
    3031                    $C$DW$299       .dwtag  DW_TAG_member
    3032                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$46)
    3033                            .dwattr $C$DW$299, DW_AT_name("frameCounter")
    3034                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("frameCounter")
    3035                            .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3036                            .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3037                            .dwattr $C$DW$299, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3038                            .dwattr $C$DW$299, DW_AT_decl_line(0x2e9)
    3039                            .dwattr $C$DW$299, DW_AT_decl_column(0x1c)
    3040                    
    3041                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3042                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x2db)
    3043                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x01)
    3044                            .dwendtag $C$DW$T$62
    3045                    
    3046                    $C$DW$T$79      .dwtag  DW_TAG_typedef
    3047                            .dwattr $C$DW$T$79, DW_AT_name("keyDescriptor_t")
    3048                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$62)
    3049                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    3050                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3051                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x2ec)
    3052                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
    3053                    
    3054                    $C$DW$T$80      .dwtag  DW_TAG_pointer_type
    3055                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    3056                            .dwattr $C$DW$T$80, DW_AT_address_class(0x20)
    3057                    
    3058                    
    3059                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3060                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x08)
    3061                    $C$DW$300       .dwtag  DW_TAG_member
    3062                            .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$46)
    3063                            .dwattr $C$DW$300, DW_AT_name("frameCounter")
    3064                            .dwattr $C$DW$300, DW_AT_TI_symbol_name("frameCounter")
    3065                            .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3066                            .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3067                            .dwattr $C$DW$300, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3068                            .dwattr $C$DW$300, DW_AT_decl_line(0x2f1)
    3069                            .dwattr $C$DW$300, DW_AT_decl_column(0x18)
    3070                    
    3071                    $C$DW$301       .dwtag  DW_TAG_member
    3072                            .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$23)
    3073                            .dwattr $C$DW$301, DW_AT_name("frameCntrIdx")
    3074                            .dwattr $C$DW$301, DW_AT_TI_symbol_name("frameCntrIdx")
    3075                            .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3076                            .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3077                            .dwattr $C$DW$301, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3078                            .dwattr $C$DW$301, DW_AT_decl_line(0x2f2)
    3079                            .dwattr $C$DW$301, DW_AT_decl_column(0x18)
    3080                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   57

    3081                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3082                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x2f0)
    3083                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
    3084                            .dwendtag $C$DW$T$63
    3085                    
    3086                    $C$DW$T$66      .dwtag  DW_TAG_typedef
    3087                            .dwattr $C$DW$T$66, DW_AT_name("frameCntr_t")
    3088                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$63)
    3089                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3090                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3091                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x2f3)
    3092                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    3093                    
    3094                    $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    3095                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    3096                            .dwattr $C$DW$T$67, DW_AT_address_class(0x20)
    3097                    
    3098                    
    3099                    $C$DW$T$68      .dwtag  DW_TAG_structure_type
    3100                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x14)
    3101                    $C$DW$302       .dwtag  DW_TAG_member
    3102                            .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$23)
    3103                            .dwattr $C$DW$302, DW_AT_name("panID")
    3104                            .dwattr $C$DW$302, DW_AT_TI_symbol_name("panID")
    3105                            .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3106                            .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3107                            .dwattr $C$DW$302, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3108                            .dwattr $C$DW$302, DW_AT_decl_line(0x2f8)
    3109                            .dwattr $C$DW$302, DW_AT_decl_column(0x16)
    3110                    
    3111                    $C$DW$303       .dwtag  DW_TAG_member
    3112                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$23)
    3113                            .dwattr $C$DW$303, DW_AT_name("shortAddress")
    3114                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("shortAddress")
    3115                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3116                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3117                            .dwattr $C$DW$303, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3118                            .dwattr $C$DW$303, DW_AT_decl_line(0x2f9)
    3119                            .dwattr $C$DW$303, DW_AT_decl_column(0x16)
    3120                    
    3121                    $C$DW$304       .dwtag  DW_TAG_member
    3122                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$65)
    3123                            .dwattr $C$DW$304, DW_AT_name("extAddress")
    3124                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("extAddress")
    3125                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3126                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3127                            .dwattr $C$DW$304, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3128                            .dwattr $C$DW$304, DW_AT_decl_line(0x2fa)
    3129                            .dwattr $C$DW$304, DW_AT_decl_column(0x16)
    3130                    
    3131                    $C$DW$305       .dwtag  DW_TAG_member
    3132                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$67)
    3133                            .dwattr $C$DW$305, DW_AT_name("frameCtr")
    3134                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("frameCtr")
    3135                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   58

    3136                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3137                            .dwattr $C$DW$305, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3138                            .dwattr $C$DW$305, DW_AT_decl_line(0x2fd)
    3139                            .dwattr $C$DW$305, DW_AT_decl_column(0x19)
    3140                    
    3141                    $C$DW$306       .dwtag  DW_TAG_member
    3142                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$25)
    3143                            .dwattr $C$DW$306, DW_AT_name("exempt")
    3144                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("exempt")
    3145                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3146                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3147                            .dwattr $C$DW$306, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3148                            .dwattr $C$DW$306, DW_AT_decl_line(0x303)
    3149                            .dwattr $C$DW$306, DW_AT_decl_column(0x16)
    3150                    
    3151                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3152                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x2f7)
    3153                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x01)
    3154                            .dwendtag $C$DW$T$68
    3155                    
    3156                    $C$DW$T$74      .dwtag  DW_TAG_typedef
    3157                            .dwattr $C$DW$T$74, DW_AT_name("deviceDescriptor_t")
    3158                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$68)
    3159                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3160                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3161                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x305)
    3162                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    3163                    
    3164                    $C$DW$T$184     .dwtag  DW_TAG_pointer_type
    3165                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$74)
    3166                            .dwattr $C$DW$T$184, DW_AT_address_class(0x20)
    3167                    
    3168                    
    3169                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
    3170                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x04)
    3171                    $C$DW$307       .dwtag  DW_TAG_member
    3172                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$21)
    3173                            .dwattr $C$DW$307, DW_AT_name("frameType")
    3174                            .dwattr $C$DW$307, DW_AT_TI_symbol_name("frameType")
    3175                            .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3176                            .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3177                            .dwattr $C$DW$307, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3178                            .dwattr $C$DW$307, DW_AT_decl_line(0x30a)
    3179                            .dwattr $C$DW$307, DW_AT_decl_column(0x16)
    3180                    
    3181                    $C$DW$308       .dwtag  DW_TAG_member
    3182                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$21)
    3183                            .dwattr $C$DW$308, DW_AT_name("commandFrameIdentifier")
    3184                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("commandFrameIdentifier")
    3185                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3186                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3187                            .dwattr $C$DW$308, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3188                            .dwattr $C$DW$308, DW_AT_decl_line(0x30b)
    3189                            .dwattr $C$DW$308, DW_AT_decl_column(0x16)
    3190                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   59

    3191                    $C$DW$309       .dwtag  DW_TAG_member
    3192                            .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$21)
    3193                            .dwattr $C$DW$309, DW_AT_name("securityMinimum")
    3194                            .dwattr $C$DW$309, DW_AT_TI_symbol_name("securityMinimum")
    3195                            .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3196                            .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3197                            .dwattr $C$DW$309, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3198                            .dwattr $C$DW$309, DW_AT_decl_line(0x30c)
    3199                            .dwattr $C$DW$309, DW_AT_decl_column(0x16)
    3200                    
    3201                    $C$DW$310       .dwtag  DW_TAG_member
    3202                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$25)
    3203                            .dwattr $C$DW$310, DW_AT_name("securityOverrideSecurityMinimum")
    3204                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("securityOverrideSecurityMinimum")
    3205                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3206                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3207                            .dwattr $C$DW$310, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3208                            .dwattr $C$DW$310, DW_AT_decl_line(0x30e)
    3209                            .dwattr $C$DW$310, DW_AT_decl_column(0x16)
    3210                    
    3211                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3212                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x309)
    3213                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x01)
    3214                            .dwendtag $C$DW$T$69
    3215                    
    3216                    $C$DW$T$76      .dwtag  DW_TAG_typedef
    3217                            .dwattr $C$DW$T$76, DW_AT_name("securityLevelDescriptor_t")
    3218                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$69)
    3219                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    3220                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3221                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x317)
    3222                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    3223                    
    3224                    
    3225                    $C$DW$T$185     .dwtag  DW_TAG_array_type
    3226                            .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$76)
    3227                            .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    3228                            .dwattr $C$DW$T$185, DW_AT_byte_size(0x08)
    3229                    $C$DW$311       .dwtag  DW_TAG_subrange_type
    3230                            .dwattr $C$DW$311, DW_AT_upper_bound(0x01)
    3231                    
    3232                            .dwendtag $C$DW$T$185
    3233                    
    3234                    
    3235                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    3236                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x0e)
    3237                    $C$DW$312       .dwtag  DW_TAG_member
    3238                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$23)
    3239                            .dwattr $C$DW$312, DW_AT_name("key_index")
    3240                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("key_index")
    3241                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3242                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3243                            .dwattr $C$DW$312, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3244                            .dwattr $C$DW$312, DW_AT_decl_line(0x31c)
    3245                            .dwattr $C$DW$312, DW_AT_decl_column(0x1b)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   60

    3246                    
    3247                    $C$DW$313       .dwtag  DW_TAG_member
    3248                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$21)
    3249                            .dwattr $C$DW$313, DW_AT_name("key_id_lookup_index")
    3250                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("key_id_lookup_index")
    3251                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3252                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3253                            .dwattr $C$DW$313, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3254                            .dwattr $C$DW$313, DW_AT_decl_line(0x31d)
    3255                            .dwattr $C$DW$313, DW_AT_decl_column(0x1b)
    3256                    
    3257                    $C$DW$314       .dwtag  DW_TAG_member
    3258                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$55)
    3259                            .dwattr $C$DW$314, DW_AT_name("macKeyIdLookupEntry")
    3260                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("macKeyIdLookupEntry")
    3261                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3262                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3263                            .dwattr $C$DW$314, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3264                            .dwattr $C$DW$314, DW_AT_decl_line(0x31e)
    3265                            .dwattr $C$DW$314, DW_AT_decl_column(0x1b)
    3266                    
    3267                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3268                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x31b)
    3269                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x01)
    3270                            .dwendtag $C$DW$T$70
    3271                    
    3272                    $C$DW$T$548     .dwtag  DW_TAG_typedef
    3273                            .dwattr $C$DW$T$548, DW_AT_name("macSecurityPibKeyIdLookupEntry_t")
    3274                            .dwattr $C$DW$T$548, DW_AT_type(*$C$DW$T$70)
    3275                            .dwattr $C$DW$T$548, DW_AT_language(DW_LANG_C)
    3276                            .dwattr $C$DW$T$548, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3277                            .dwattr $C$DW$T$548, DW_AT_decl_line(0x31f)
    3278                            .dwattr $C$DW$T$548, DW_AT_decl_column(0x03)
    3279                    
    3280                    
    3281                    $C$DW$T$71      .dwtag  DW_TAG_structure_type
    3282                            .dwattr $C$DW$T$71, DW_AT_byte_size(0x08)
    3283                    $C$DW$315       .dwtag  DW_TAG_member
    3284                            .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$23)
    3285                            .dwattr $C$DW$315, DW_AT_name("key_index")
    3286                            .dwattr $C$DW$315, DW_AT_TI_symbol_name("key_index")
    3287                            .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3288                            .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3289                            .dwattr $C$DW$315, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3290                            .dwattr $C$DW$315, DW_AT_decl_line(0x323)
    3291                            .dwattr $C$DW$315, DW_AT_decl_column(0x1b)
    3292                    
    3293                    $C$DW$316       .dwtag  DW_TAG_member
    3294                            .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$23)
    3295                            .dwattr $C$DW$316, DW_AT_name("key_device_index")
    3296                            .dwattr $C$DW$316, DW_AT_TI_symbol_name("key_device_index")
    3297                            .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3298                            .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3299                            .dwattr $C$DW$316, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3300                            .dwattr $C$DW$316, DW_AT_decl_line(0x324)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   61

    3301                            .dwattr $C$DW$316, DW_AT_decl_column(0x1b)
    3302                    
    3303                    $C$DW$317       .dwtag  DW_TAG_member
    3304                            .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$57)
    3305                            .dwattr $C$DW$317, DW_AT_name("macKeyDeviceEntry")
    3306                            .dwattr $C$DW$317, DW_AT_TI_symbol_name("macKeyDeviceEntry")
    3307                            .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3308                            .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3309                            .dwattr $C$DW$317, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3310                            .dwattr $C$DW$317, DW_AT_decl_line(0x325)
    3311                            .dwattr $C$DW$317, DW_AT_decl_column(0x1b)
    3312                    
    3313                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3314                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x322)
    3315                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x01)
    3316                            .dwendtag $C$DW$T$71
    3317                    
    3318                    $C$DW$T$549     .dwtag  DW_TAG_typedef
    3319                            .dwattr $C$DW$T$549, DW_AT_name("macSecurityPibKeyDeviceEntry_t")
    3320                            .dwattr $C$DW$T$549, DW_AT_type(*$C$DW$T$71)
    3321                            .dwattr $C$DW$T$549, DW_AT_language(DW_LANG_C)
    3322                            .dwattr $C$DW$T$549, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3323                            .dwattr $C$DW$T$549, DW_AT_decl_line(0x326)
    3324                            .dwattr $C$DW$T$549, DW_AT_decl_column(0x03)
    3325                    
    3326                    
    3327                    $C$DW$T$72      .dwtag  DW_TAG_structure_type
    3328                            .dwattr $C$DW$T$72, DW_AT_byte_size(0x06)
    3329                    $C$DW$318       .dwtag  DW_TAG_member
    3330                            .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$23)
    3331                            .dwattr $C$DW$318, DW_AT_name("key_index")
    3332                            .dwattr $C$DW$318, DW_AT_TI_symbol_name("key_index")
    3333                            .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3334                            .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3335                            .dwattr $C$DW$318, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3336                            .dwattr $C$DW$318, DW_AT_decl_line(0x32a)
    3337                            .dwattr $C$DW$318, DW_AT_decl_column(0x1b)
    3338                    
    3339                    $C$DW$319       .dwtag  DW_TAG_member
    3340                            .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$21)
    3341                            .dwattr $C$DW$319, DW_AT_name("key_key_usage_index")
    3342                            .dwattr $C$DW$319, DW_AT_TI_symbol_name("key_key_usage_index")
    3343                            .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3344                            .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3345                            .dwattr $C$DW$319, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3346                            .dwattr $C$DW$319, DW_AT_decl_line(0x32b)
    3347                            .dwattr $C$DW$319, DW_AT_decl_column(0x1b)
    3348                    
    3349                    $C$DW$320       .dwtag  DW_TAG_member
    3350                            .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$59)
    3351                            .dwattr $C$DW$320, DW_AT_name("macKeyUsageEntry")
    3352                            .dwattr $C$DW$320, DW_AT_TI_symbol_name("macKeyUsageEntry")
    3353                            .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3354                            .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3355                            .dwattr $C$DW$320, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{A2A15CBE-0357-45AA-AC68-25C4F10AC7A8} PAGE   62

    3356                            .dwattr $C$DW$320, DW_AT_decl_line(0x32c)
    3357                            .dwattr $C$DW$320, DW_AT_decl_column(0x1b)
    3358                    
    3359                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3360                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x329)
    3361                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x01)
    3362                            .dwendtag $C$DW$T$72
    3363                    
    3364                    $C$DW$T$550     .dwtag  DW_TAG_typedef
    3365                            .dwattr $C$DW$T$550, DW_AT_name("macSecurityPibKeyUsageEntry_t")
    3366                            .dwattr $C$DW$T$550, DW_AT_type(*$C$DW$T$72)
    3367                            .dwattr $C$DW$T$550, DW_AT_language(DW_LANG_C)
    3368                            .dwattr $C$DW$T$550, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3369                            .dwattr $C$DW$T$550, DW_AT_decl_line(0x32d)
    3370                            .dwattr $C$DW$T$550, DW_AT_decl_column(0x03)
    3371                    
    3372                    
    3373                    $C$DW$T$73      .dwtag  DW_TAG_structure_type
    3374                            .dwattr $C$DW$T$73, DW_AT_byte_size(0x18)
    3375                    $C$DW$321       .dwtag  DW_TAG_member
    3376                            .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$23)
    3377                            .dwattr $C$DW$321, DW_AT_name("key_index")
    3378                            .dwattr $C$DW$321, DW_AT_TI_symbol_name("key_index")
    3379                            .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3380                            .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3381                            .dwattr $C$DW$321, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
