TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Nov 28 13:34:37 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/StartUp/macstack.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\sensor_cc1350lp
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    6377                            .dwattr $C$DW$645, DW_AT_decl_column(0x05)
    6378                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  117

    6379                    $C$DW$646       .dwtag  DW_TAG_enumerator
    6380                            .dwattr $C$DW$646, DW_AT_name("MAC_RADIO_CC1352P")
    6381                            .dwattr $C$DW$646, DW_AT_const_value(0x02)
    6382                            .dwattr $C$DW$646, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    6383                            .dwattr $C$DW$646, DW_AT_decl_line(0x11e)
    6384                            .dwattr $C$DW$646, DW_AT_decl_column(0x05)
    6385                    
    6386                    $C$DW$647       .dwtag  DW_TAG_enumerator
    6387                            .dwattr $C$DW$647, DW_AT_name("MAC_RADIO_CCXXX2")
    6388                            .dwattr $C$DW$647, DW_AT_const_value(0x00)
    6389                            .dwattr $C$DW$647, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    6390                            .dwattr $C$DW$647, DW_AT_decl_line(0x11f)
    6391                            .dwattr $C$DW$647, DW_AT_decl_column(0x05)
    6392                    
    6393                            .dwattr $C$DW$T$1238, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Applicatio
    6394                            .dwattr $C$DW$T$1238, DW_AT_decl_line(0x118)
    6395                            .dwattr $C$DW$T$1238, DW_AT_decl_column(0x01)
    6396                            .dwendtag $C$DW$T$1238
    6397                    
    6398                    $C$DW$T$1239    .dwtag  DW_TAG_typedef
    6399                            .dwattr $C$DW$T$1239, DW_AT_name("macChipType_t")
    6400                            .dwattr $C$DW$T$1239, DW_AT_type(*$C$DW$T$1238)
    6401                            .dwattr $C$DW$T$1239, DW_AT_language(DW_LANG_C)
    6402                            .dwattr $C$DW$T$1239, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Applicatio
    6403                            .dwattr $C$DW$T$1239, DW_AT_decl_line(0x120)
    6404                            .dwattr $C$DW$T$1239, DW_AT_decl_column(0x03)
    6405                    
    6406                    
    6407                    $C$DW$T$1240    .dwtag  DW_TAG_enumeration_type
    6408                            .dwattr $C$DW$T$1240, DW_AT_byte_size(0x01)
    6409                    $C$DW$648       .dwtag  DW_TAG_enumerator
    6410                            .dwattr $C$DW$648, DW_AT_name("MAC_HW_REV_21")
    6411                            .dwattr $C$DW$648, DW_AT_const_value(0x00)
    6412                            .dwattr $C$DW$648, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    6413                            .dwattr $C$DW$648, DW_AT_decl_line(0x125)
    6414                            .dwattr $C$DW$648, DW_AT_decl_column(0x05)
    6415                    
    6416                    $C$DW$649       .dwtag  DW_TAG_enumerator
    6417                            .dwattr $C$DW$649, DW_AT_name("MAC_HW_REV_20")
    6418                            .dwattr $C$DW$649, DW_AT_const_value(0x01)
    6419                            .dwattr $C$DW$649, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    6420                            .dwattr $C$DW$649, DW_AT_decl_line(0x126)
    6421                            .dwattr $C$DW$649, DW_AT_decl_column(0x05)
    6422                    
    6423                    $C$DW$650       .dwtag  DW_TAG_enumerator
    6424                            .dwattr $C$DW$650, DW_AT_name("MAC_HW_MAX_REVS")
    6425                            .dwattr $C$DW$650, DW_AT_const_value(0x02)
    6426                            .dwattr $C$DW$650, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    6427                            .dwattr $C$DW$650, DW_AT_decl_line(0x127)
    6428                            .dwattr $C$DW$650, DW_AT_decl_column(0x05)
    6429                    
    6430                            .dwattr $C$DW$T$1240, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Applicatio
    6431                            .dwattr $C$DW$T$1240, DW_AT_decl_line(0x124)
    6432                            .dwattr $C$DW$T$1240, DW_AT_decl_column(0x01)
    6433                            .dwendtag $C$DW$T$1240
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  118

    6434                    
    6435                    $C$DW$T$1241    .dwtag  DW_TAG_typedef
    6436                            .dwattr $C$DW$T$1241, DW_AT_name("macHwRevision_t")
    6437                            .dwattr $C$DW$T$1241, DW_AT_type(*$C$DW$T$1240)
    6438                            .dwattr $C$DW$T$1241, DW_AT_language(DW_LANG_C)
    6439                            .dwattr $C$DW$T$1241, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Applicatio
    6440                            .dwattr $C$DW$T$1241, DW_AT_decl_line(0x128)
    6441                            .dwattr $C$DW$T$1241, DW_AT_decl_column(0x03)
    6442                    
    6443                    
    6444                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    6445                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    6446                    $C$DW$651       .dwtag  DW_TAG_member
    6447                            .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$21)
    6448                            .dwattr $C$DW$651, DW_AT_name("event")
    6449                            .dwattr $C$DW$651, DW_AT_TI_symbol_name("event")
    6450                            .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6451                            .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6452                            .dwattr $C$DW$651, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6453                            .dwattr $C$DW$651, DW_AT_decl_line(0x2b6)
    6454                            .dwattr $C$DW$651, DW_AT_decl_column(0x0b)
    6455                    
    6456                    $C$DW$652       .dwtag  DW_TAG_member
    6457                            .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$21)
    6458                            .dwattr $C$DW$652, DW_AT_name("status")
    6459                            .dwattr $C$DW$652, DW_AT_TI_symbol_name("status")
    6460                            .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6461                            .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6462                            .dwattr $C$DW$652, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6463                            .dwattr $C$DW$652, DW_AT_decl_line(0x2b7)
    6464                            .dwattr $C$DW$652, DW_AT_decl_column(0x0b)
    6465                    
    6466                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6467                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x2b5)
    6468                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
    6469                            .dwendtag $C$DW$T$22
    6470                    
    6471                    $C$DW$T$38      .dwtag  DW_TAG_typedef
    6472                            .dwattr $C$DW$T$38, DW_AT_name("macEventHdr_t")
    6473                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$22)
    6474                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    6475                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6476                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x2b8)
    6477                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
    6478                    
    6479                    
    6480                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    6481                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x0a)
    6482                    $C$DW$653       .dwtag  DW_TAG_member
    6483                            .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$559)
    6484                            .dwattr $C$DW$653, DW_AT_name("addr")
    6485                            .dwattr $C$DW$653, DW_AT_TI_symbol_name("addr")
    6486                            .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6487                            .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6488                            .dwattr $C$DW$653, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/a
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  119

    6489                            .dwattr $C$DW$653, DW_AT_decl_line(0x4db)
    6490                            .dwattr $C$DW$653, DW_AT_decl_column(0x07)
    6491                    
    6492                    $C$DW$654       .dwtag  DW_TAG_member
    6493                            .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$24)
    6494                            .dwattr $C$DW$654, DW_AT_name("addrMode")
    6495                            .dwattr $C$DW$654, DW_AT_TI_symbol_name("addrMode")
    6496                            .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6497                            .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    6498                            .dwattr $C$DW$654, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/a
    6499                            .dwattr $C$DW$654, DW_AT_decl_line(0x4de)
    6500                            .dwattr $C$DW$654, DW_AT_decl_column(0x17)
    6501                    
    6502                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/
    6503                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x4d0)
    6504                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    6505                            .dwendtag $C$DW$T$25
    6506                    
    6507                    $C$DW$T$817     .dwtag  DW_TAG_typedef
    6508                            .dwattr $C$DW$T$817, DW_AT_name("ApiMac_sAddr_t")
    6509                            .dwattr $C$DW$T$817, DW_AT_type(*$C$DW$T$25)
    6510                            .dwattr $C$DW$T$817, DW_AT_language(DW_LANG_C)
    6511                            .dwattr $C$DW$T$817, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application
    6512                            .dwattr $C$DW$T$817, DW_AT_decl_line(0x4df)
    6513                            .dwattr $C$DW$T$817, DW_AT_decl_column(0x03)
    6514                    
    6515                    
    6516                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    6517                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x0a)
    6518                    $C$DW$655       .dwtag  DW_TAG_member
    6519                            .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$560)
    6520                            .dwattr $C$DW$655, DW_AT_name("addr")
    6521                            .dwattr $C$DW$655, DW_AT_TI_symbol_name("addr")
    6522                            .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6523                            .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6524                            .dwattr $C$DW$655, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/S
    6525                            .dwattr $C$DW$655, DW_AT_decl_line(0x55)
    6526                            .dwattr $C$DW$655, DW_AT_decl_column(0x05)
    6527                    
    6528                    $C$DW$656       .dwtag  DW_TAG_member
    6529                            .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$27)
    6530                            .dwattr $C$DW$656, DW_AT_name("addrMode")
    6531                            .dwattr $C$DW$656, DW_AT_TI_symbol_name("addrMode")
    6532                            .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6533                            .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6534                            .dwattr $C$DW$656, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/S
    6535                            .dwattr $C$DW$656, DW_AT_decl_line(0x56)
    6536                            .dwattr $C$DW$656, DW_AT_decl_column(0x13)
    6537                    
    6538                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/
    6539                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x50)
    6540                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
    6541                            .dwendtag $C$DW$T$28
    6542                    
    6543                    $C$DW$T$29      .dwtag  DW_TAG_typedef
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  120

    6544                            .dwattr $C$DW$T$29, DW_AT_name("sAddr_t")
    6545                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    6546                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    6547                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/
    6548                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x57)
    6549                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    6550                    
    6551                    $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    6552                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$29)
    6553                            .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
    6554                    
    6555                    
    6556                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6557                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x24)
    6558                    $C$DW$657       .dwtag  DW_TAG_member
    6559                            .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$29)
    6560                            .dwattr $C$DW$657, DW_AT_name("coordAddress")
    6561                            .dwattr $C$DW$657, DW_AT_TI_symbol_name("coordAddress")
    6562                            .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6563                            .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    6564                            .dwattr $C$DW$657, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6565                            .dwattr $C$DW$657, DW_AT_decl_line(0x3e1)
    6566                            .dwattr $C$DW$657, DW_AT_decl_column(0x11)
    6567                    
    6568                    $C$DW$658       .dwtag  DW_TAG_member
    6569                            .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$30)
    6570                            .dwattr $C$DW$658, DW_AT_name("coordPanId")
    6571                            .dwattr $C$DW$658, DW_AT_TI_symbol_name("coordPanId")
    6572                            .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6573                            .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    6574                            .dwattr $C$DW$658, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6575                            .dwattr $C$DW$658, DW_AT_decl_line(0x3e2)
    6576                            .dwattr $C$DW$658, DW_AT_decl_column(0x11)
    6577                    
    6578                    $C$DW$659       .dwtag  DW_TAG_member
    6579                            .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$30)
    6580                            .dwattr $C$DW$659, DW_AT_name("superframeSpec")
    6581                            .dwattr $C$DW$659, DW_AT_TI_symbol_name("superframeSpec")
    6582                            .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6583                            .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6584                            .dwattr $C$DW$659, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6585                            .dwattr $C$DW$659, DW_AT_decl_line(0x3e3)
    6586                            .dwattr $C$DW$659, DW_AT_decl_column(0x11)
    6587                    
    6588                    $C$DW$660       .dwtag  DW_TAG_member
    6589                            .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$21)
    6590                            .dwattr $C$DW$660, DW_AT_name("logicalChannel")
    6591                            .dwattr $C$DW$660, DW_AT_TI_symbol_name("logicalChannel")
    6592                            .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6593                            .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6594                            .dwattr $C$DW$660, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6595                            .dwattr $C$DW$660, DW_AT_decl_line(0x3e4)
    6596                            .dwattr $C$DW$660, DW_AT_decl_column(0x11)
    6597                    
    6598                    $C$DW$661       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  121

    6599                            .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$21)
    6600                            .dwattr $C$DW$661, DW_AT_name("channelPage")
    6601                            .dwattr $C$DW$661, DW_AT_TI_symbol_name("channelPage")
    6602                            .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6603                            .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6604                            .dwattr $C$DW$661, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6605                            .dwattr $C$DW$661, DW_AT_decl_line(0x3e5)
    6606                            .dwattr $C$DW$661, DW_AT_decl_column(0x11)
    6607                    
    6608                    $C$DW$662       .dwtag  DW_TAG_member
    6609                            .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$31)
    6610                            .dwattr $C$DW$662, DW_AT_name("gtsPermit")
    6611                            .dwattr $C$DW$662, DW_AT_TI_symbol_name("gtsPermit")
    6612                            .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6613                            .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    6614                            .dwattr $C$DW$662, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6615                            .dwattr $C$DW$662, DW_AT_decl_line(0x3e6)
    6616                            .dwattr $C$DW$662, DW_AT_decl_column(0x11)
    6617                    
    6618                    $C$DW$663       .dwtag  DW_TAG_member
    6619                            .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$21)
    6620                            .dwattr $C$DW$663, DW_AT_name("linkQuality")
    6621                            .dwattr $C$DW$663, DW_AT_TI_symbol_name("linkQuality")
    6622                            .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6623                            .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6624                            .dwattr $C$DW$663, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6625                            .dwattr $C$DW$663, DW_AT_decl_line(0x3e7)
    6626                            .dwattr $C$DW$663, DW_AT_decl_column(0x11)
    6627                    
    6628                    $C$DW$664       .dwtag  DW_TAG_member
    6629                            .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$32)
    6630                            .dwattr $C$DW$664, DW_AT_name("timestamp")
    6631                            .dwattr $C$DW$664, DW_AT_TI_symbol_name("timestamp")
    6632                            .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6633                            .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6634                            .dwattr $C$DW$664, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6635                            .dwattr $C$DW$664, DW_AT_decl_line(0x3e8)
    6636                            .dwattr $C$DW$664, DW_AT_decl_column(0x11)
    6637                    
    6638                    $C$DW$665       .dwtag  DW_TAG_member
    6639                            .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$31)
    6640                            .dwattr $C$DW$665, DW_AT_name("securityFailure")
    6641                            .dwattr $C$DW$665, DW_AT_TI_symbol_name("securityFailure")
    6642                            .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6643                            .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6644                            .dwattr $C$DW$665, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6645                            .dwattr $C$DW$665, DW_AT_decl_line(0x3e9)
    6646                            .dwattr $C$DW$665, DW_AT_decl_column(0x11)
    6647                    
    6648                    $C$DW$666       .dwtag  DW_TAG_member
    6649                            .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$33)
    6650                            .dwattr $C$DW$666, DW_AT_name("sec")
    6651                            .dwattr $C$DW$666, DW_AT_TI_symbol_name("sec")
    6652                            .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6653                            .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  122

    6654                            .dwattr $C$DW$666, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6655                            .dwattr $C$DW$666, DW_AT_decl_line(0x3ea)
    6656                            .dwattr $C$DW$666, DW_AT_decl_column(0x11)
    6657                    
    6658                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6659                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x3e0)
    6660                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
    6661                            .dwendtag $C$DW$T$34
    6662                    
    6663                    $C$DW$T$76      .dwtag  DW_TAG_typedef
    6664                            .dwattr $C$DW$T$76, DW_AT_name("macPanDesc_t")
    6665                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$34)
    6666                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    6667                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6668                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x3eb)
    6669                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    6670                    
    6671                    $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    6672                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    6673                            .dwattr $C$DW$T$77, DW_AT_address_class(0x20)
    6674                    
    6675                    
    6676                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6677                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x2c)
    6678                    $C$DW$667       .dwtag  DW_TAG_member
    6679                            .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$35)
    6680                            .dwattr $C$DW$667, DW_AT_name("scanChannels")
    6681                            .dwattr $C$DW$667, DW_AT_TI_symbol_name("scanChannels")
    6682                            .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6683                            .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6684                            .dwattr $C$DW$667, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6685                            .dwattr $C$DW$667, DW_AT_decl_line(0x421)
    6686                            .dwattr $C$DW$667, DW_AT_decl_column(0x14)
    6687                    
    6688                    $C$DW$668       .dwtag  DW_TAG_member
    6689                            .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$21)
    6690                            .dwattr $C$DW$668, DW_AT_name("scanType")
    6691                            .dwattr $C$DW$668, DW_AT_TI_symbol_name("scanType")
    6692                            .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6693                            .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6694                            .dwattr $C$DW$668, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6695                            .dwattr $C$DW$668, DW_AT_decl_line(0x422)
    6696                            .dwattr $C$DW$668, DW_AT_decl_column(0x14)
    6697                    
    6698                    $C$DW$669       .dwtag  DW_TAG_member
    6699                            .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$21)
    6700                            .dwattr $C$DW$669, DW_AT_name("scanDuration")
    6701                            .dwattr $C$DW$669, DW_AT_TI_symbol_name("scanDuration")
    6702                            .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6703                            .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6704                            .dwattr $C$DW$669, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6705                            .dwattr $C$DW$669, DW_AT_decl_line(0x423)
    6706                            .dwattr $C$DW$669, DW_AT_decl_column(0x14)
    6707                    
    6708                    $C$DW$670       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  123

    6709                            .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$21)
    6710                            .dwattr $C$DW$670, DW_AT_name("channelPage")
    6711                            .dwattr $C$DW$670, DW_AT_TI_symbol_name("channelPage")
    6712                            .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    6713                            .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6714                            .dwattr $C$DW$670, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6715                            .dwattr $C$DW$670, DW_AT_decl_line(0x424)
    6716                            .dwattr $C$DW$670, DW_AT_decl_column(0x14)
    6717                    
    6718                    $C$DW$671       .dwtag  DW_TAG_member
    6719                            .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$21)
    6720                            .dwattr $C$DW$671, DW_AT_name("phyID")
    6721                            .dwattr $C$DW$671, DW_AT_TI_symbol_name("phyID")
    6722                            .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6723                            .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6724                            .dwattr $C$DW$671, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6725                            .dwattr $C$DW$671, DW_AT_decl_line(0x425)
    6726                            .dwattr $C$DW$671, DW_AT_decl_column(0x14)
    6727                    
    6728                    $C$DW$672       .dwtag  DW_TAG_member
    6729                            .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$21)
    6730                            .dwattr $C$DW$672, DW_AT_name("maxResults")
    6731                            .dwattr $C$DW$672, DW_AT_TI_symbol_name("maxResults")
    6732                            .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6733                            .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6734                            .dwattr $C$DW$672, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6735                            .dwattr $C$DW$672, DW_AT_decl_line(0x426)
    6736                            .dwattr $C$DW$672, DW_AT_decl_column(0x14)
    6737                    
    6738                    $C$DW$673       .dwtag  DW_TAG_member
    6739                            .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$31)
    6740                            .dwattr $C$DW$673, DW_AT_name("permitJoining")
    6741                            .dwattr $C$DW$673, DW_AT_TI_symbol_name("permitJoining")
    6742                            .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6743                            .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6744                            .dwattr $C$DW$673, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6745                            .dwattr $C$DW$673, DW_AT_decl_line(0x427)
    6746                            .dwattr $C$DW$673, DW_AT_decl_column(0x14)
    6747                    
    6748                    $C$DW$674       .dwtag  DW_TAG_member
    6749                            .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$21)
    6750                            .dwattr $C$DW$674, DW_AT_name("linkQuality")
    6751                            .dwattr $C$DW$674, DW_AT_TI_symbol_name("linkQuality")
    6752                            .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6753                            .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    6754                            .dwattr $C$DW$674, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6755                            .dwattr $C$DW$674, DW_AT_decl_line(0x429)
    6756                            .dwattr $C$DW$674, DW_AT_decl_column(0x14)
    6757                    
    6758                    $C$DW$675       .dwtag  DW_TAG_member
    6759                            .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$21)
    6760                            .dwattr $C$DW$675, DW_AT_name("percentFilter")
    6761                            .dwattr $C$DW$675, DW_AT_TI_symbol_name("percentFilter")
    6762                            .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6763                            .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  124

    6764                            .dwattr $C$DW$675, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6765                            .dwattr $C$DW$675, DW_AT_decl_line(0x42b)
    6766                            .dwattr $C$DW$675, DW_AT_decl_column(0x14)
    6767                    
    6768                    $C$DW$676       .dwtag  DW_TAG_member
    6769                            .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$33)
    6770                            .dwattr $C$DW$676, DW_AT_name("sec")
    6771                            .dwattr $C$DW$676, DW_AT_TI_symbol_name("sec")
    6772                            .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6773                            .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6774                            .dwattr $C$DW$676, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6775                            .dwattr $C$DW$676, DW_AT_decl_line(0x42e)
    6776                            .dwattr $C$DW$676, DW_AT_decl_column(0x14)
    6777                    
    6778                    $C$DW$677       .dwtag  DW_TAG_member
    6779                            .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$31)
    6780                            .dwattr $C$DW$677, DW_AT_name("MPMScan")
    6781                            .dwattr $C$DW$677, DW_AT_TI_symbol_name("MPMScan")
    6782                            .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6783                            .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6784                            .dwattr $C$DW$677, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6785                            .dwattr $C$DW$677, DW_AT_decl_line(0x42f)
    6786                            .dwattr $C$DW$677, DW_AT_decl_column(0x14)
    6787                    
    6788                    $C$DW$678       .dwtag  DW_TAG_member
    6789                            .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$21)
    6790                            .dwattr $C$DW$678, DW_AT_name("MPMScanType")
    6791                            .dwattr $C$DW$678, DW_AT_TI_symbol_name("MPMScanType")
    6792                            .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    6793                            .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6794                            .dwattr $C$DW$678, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6795                            .dwattr $C$DW$678, DW_AT_decl_line(0x431)
    6796                            .dwattr $C$DW$678, DW_AT_decl_column(0x14)
    6797                    
    6798                    $C$DW$679       .dwtag  DW_TAG_member
    6799                            .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$30)
    6800                            .dwattr $C$DW$679, DW_AT_name("MPMScanDuration")
    6801                            .dwattr $C$DW$679, DW_AT_TI_symbol_name("MPMScanDuration")
    6802                            .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    6803                            .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6804                            .dwattr $C$DW$679, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6805                            .dwattr $C$DW$679, DW_AT_decl_line(0x432)
    6806                            .dwattr $C$DW$679, DW_AT_decl_column(0x14)
    6807                    
    6808                    $C$DW$680       .dwtag  DW_TAG_member
    6809                            .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$561)
    6810                            .dwattr $C$DW$680, DW_AT_name("result")
    6811                            .dwattr $C$DW$680, DW_AT_TI_symbol_name("result")
    6812                            .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6813                            .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6814                            .dwattr $C$DW$680, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6815                            .dwattr $C$DW$680, DW_AT_decl_line(0x440)
    6816                            .dwattr $C$DW$680, DW_AT_decl_column(0x05)
    6817                    
    6818                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  125

    6819                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x420)
    6820                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    6821                            .dwendtag $C$DW$T$36
    6822                    
    6823                    $C$DW$T$562     .dwtag  DW_TAG_typedef
    6824                            .dwattr $C$DW$T$562, DW_AT_name("macMlmeScanReq_t")
    6825                            .dwattr $C$DW$T$562, DW_AT_type(*$C$DW$T$36)
    6826                            .dwattr $C$DW$T$562, DW_AT_language(DW_LANG_C)
    6827                            .dwattr $C$DW$T$562, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    6828                            .dwattr $C$DW$T$562, DW_AT_decl_line(0x441)
    6829                            .dwattr $C$DW$T$562, DW_AT_decl_column(0x03)
    6830                    
    6831                    
    6832                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6833                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    6834                    $C$DW$681       .dwtag  DW_TAG_member
    6835                            .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$21)
    6836                            .dwattr $C$DW$681, DW_AT_name("msduHandle")
    6837                            .dwattr $C$DW$681, DW_AT_TI_symbol_name("msduHandle")
    6838                            .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6839                            .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6840                            .dwattr $C$DW$681, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6841                            .dwattr $C$DW$681, DW_AT_decl_line(0x160)
    6842                            .dwattr $C$DW$681, DW_AT_decl_column(0x1f)
    6843                    
    6844                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6845                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x15f)
    6846                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    6847                            .dwendtag $C$DW$T$37
    6848                    
    6849                    $C$DW$T$563     .dwtag  DW_TAG_typedef
    6850                            .dwattr $C$DW$T$563, DW_AT_name("macMcpsPurgeReq_t")
    6851                            .dwattr $C$DW$T$563, DW_AT_type(*$C$DW$T$37)
    6852                            .dwattr $C$DW$T$563, DW_AT_language(DW_LANG_C)
    6853                            .dwattr $C$DW$T$563, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    6854                            .dwattr $C$DW$T$563, DW_AT_decl_line(0x161)
    6855                            .dwattr $C$DW$T$563, DW_AT_decl_column(0x03)
    6856                    
    6857                    
    6858                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6859                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x38)
    6860                    $C$DW$682       .dwtag  DW_TAG_member
    6861                            .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$38)
    6862                            .dwattr $C$DW$682, DW_AT_name("hdr")
    6863                            .dwattr $C$DW$682, DW_AT_TI_symbol_name("hdr")
    6864                            .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6865                            .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6866                            .dwattr $C$DW$682, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6867                            .dwattr $C$DW$682, DW_AT_decl_line(0x167)
    6868                            .dwattr $C$DW$682, DW_AT_decl_column(0x1f)
    6869                    
    6870                    $C$DW$683       .dwtag  DW_TAG_member
    6871                            .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$564)
    6872                            .dwattr $C$DW$683, DW_AT_name("mac")
    6873                            .dwattr $C$DW$683, DW_AT_TI_symbol_name("mac")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  126

    6874                            .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6875                            .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6876                            .dwattr $C$DW$683, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6877                            .dwattr $C$DW$683, DW_AT_decl_line(0x170)
    6878                            .dwattr $C$DW$683, DW_AT_decl_column(0x05)
    6879                    
    6880                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6881                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x166)
    6882                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    6883                            .dwendtag $C$DW$T$39
    6884                    
    6885                    $C$DW$T$572     .dwtag  DW_TAG_typedef
    6886                            .dwattr $C$DW$T$572, DW_AT_name("macApiEvent_t")
    6887                            .dwattr $C$DW$T$572, DW_AT_type(*$C$DW$T$39)
    6888                            .dwattr $C$DW$T$572, DW_AT_language(DW_LANG_C)
    6889                            .dwattr $C$DW$T$572, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    6890                            .dwattr $C$DW$T$572, DW_AT_decl_line(0x171)
    6891                            .dwattr $C$DW$T$572, DW_AT_decl_column(0x03)
    6892                    
    6893                    
    6894                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6895                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
    6896                    $C$DW$684       .dwtag  DW_TAG_member
    6897                            .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$40)
    6898                            .dwattr $C$DW$684, DW_AT_name("p")
    6899                            .dwattr $C$DW$684, DW_AT_TI_symbol_name("p")
    6900                            .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6901                            .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6902                            .dwattr $C$DW$684, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/S
    6903                            .dwattr $C$DW$684, DW_AT_decl_line(0x3d)
    6904                            .dwattr $C$DW$684, DW_AT_decl_column(0x0e)
    6905                    
    6906                    $C$DW$685       .dwtag  DW_TAG_member
    6907                            .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$30)
    6908                            .dwattr $C$DW$685, DW_AT_name("len")
    6909                            .dwattr $C$DW$685, DW_AT_TI_symbol_name("len")
    6910                            .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6911                            .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6912                            .dwattr $C$DW$685, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/S
    6913                            .dwattr $C$DW$685, DW_AT_decl_line(0x3e)
    6914                            .dwattr $C$DW$685, DW_AT_decl_column(0x0e)
    6915                    
    6916                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/
    6917                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x3c)
    6918                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    6919                            .dwendtag $C$DW$T$41
    6920                    
    6921                    $C$DW$T$62      .dwtag  DW_TAG_typedef
    6922                            .dwattr $C$DW$T$62, DW_AT_name("sData_t")
    6923                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$41)
    6924                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    6925                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/
    6926                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x3f)
    6927                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    6928                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  127

    6929                    
    6930                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    6931                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x0a)
    6932                    $C$DW$686       .dwtag  DW_TAG_member
    6933                            .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$42)
    6934                            .dwattr $C$DW$686, DW_AT_name("lookupData")
    6935                            .dwattr $C$DW$686, DW_AT_TI_symbol_name("lookupData")
    6936                            .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6937                            .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6938                            .dwattr $C$DW$686, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6939                            .dwattr $C$DW$686, DW_AT_decl_line(0x2c6)
    6940                            .dwattr $C$DW$686, DW_AT_decl_column(0x16)
    6941                    
    6942                    $C$DW$687       .dwtag  DW_TAG_member
    6943                            .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$21)
    6944                            .dwattr $C$DW$687, DW_AT_name("lookupDataSize")
    6945                            .dwattr $C$DW$687, DW_AT_TI_symbol_name("lookupDataSize")
    6946                            .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6947                            .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6948                            .dwattr $C$DW$687, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6949                            .dwattr $C$DW$687, DW_AT_decl_line(0x2c7)
    6950                            .dwattr $C$DW$687, DW_AT_decl_column(0x16)
    6951                    
    6952                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6953                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x2c5)
    6954                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
    6955                            .dwendtag $C$DW$T$43
    6956                    
    6957                    $C$DW$T$46      .dwtag  DW_TAG_typedef
    6958                            .dwattr $C$DW$T$46, DW_AT_name("keyIdLookupDescriptor_t")
    6959                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$43)
    6960                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    6961                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6962                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x2c8)
    6963                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
    6964                    
    6965                    $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    6966                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    6967                            .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    6968                    
    6969                    
    6970                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    6971                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    6972                    $C$DW$688       .dwtag  DW_TAG_member
    6973                            .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$30)
    6974                            .dwattr $C$DW$688, DW_AT_name("deviceDescriptorHandle")
    6975                            .dwattr $C$DW$688, DW_AT_TI_symbol_name("deviceDescriptorHandle")
    6976                            .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6977                            .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6978                            .dwattr $C$DW$688, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6979                            .dwattr $C$DW$688, DW_AT_decl_line(0x2cd)
    6980                            .dwattr $C$DW$688, DW_AT_decl_column(0x16)
    6981                    
    6982                    $C$DW$689       .dwtag  DW_TAG_member
    6983                            .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$31)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  128

    6984                            .dwattr $C$DW$689, DW_AT_name("uniqueDevice")
    6985                            .dwattr $C$DW$689, DW_AT_TI_symbol_name("uniqueDevice")
    6986                            .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6987                            .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6988                            .dwattr $C$DW$689, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6989                            .dwattr $C$DW$689, DW_AT_decl_line(0x2ce)
    6990                            .dwattr $C$DW$689, DW_AT_decl_column(0x16)
    6991                    
    6992                    $C$DW$690       .dwtag  DW_TAG_member
    6993                            .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$31)
    6994                            .dwattr $C$DW$690, DW_AT_name("blackListed")
    6995                            .dwattr $C$DW$690, DW_AT_TI_symbol_name("blackListed")
    6996                            .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6997                            .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6998                            .dwattr $C$DW$690, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6999                            .dwattr $C$DW$690, DW_AT_decl_line(0x2cf)
    7000                            .dwattr $C$DW$690, DW_AT_decl_column(0x16)
    7001                    
    7002                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7003                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2cc)
    7004                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    7005                            .dwendtag $C$DW$T$44
    7006                    
    7007                    $C$DW$T$48      .dwtag  DW_TAG_typedef
    7008                            .dwattr $C$DW$T$48, DW_AT_name("keyDeviceDescriptor_t")
    7009                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$44)
    7010                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    7011                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7012                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x2d0)
    7013                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
    7014                    
    7015                    $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    7016                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    7017                            .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    7018                    
    7019                    
    7020                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    7021                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    7022                    $C$DW$691       .dwtag  DW_TAG_member
    7023                            .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$21)
    7024                            .dwattr $C$DW$691, DW_AT_name("frameType")
    7025                            .dwattr $C$DW$691, DW_AT_TI_symbol_name("frameType")
    7026                            .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7027                            .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    7028                            .dwattr $C$DW$691, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7029                            .dwattr $C$DW$691, DW_AT_decl_line(0x2d5)
    7030                            .dwattr $C$DW$691, DW_AT_decl_column(0x16)
    7031                    
    7032                    $C$DW$692       .dwtag  DW_TAG_member
    7033                            .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$21)
    7034                            .dwattr $C$DW$692, DW_AT_name("cmdFrameId")
    7035                            .dwattr $C$DW$692, DW_AT_TI_symbol_name("cmdFrameId")
    7036                            .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7037                            .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    7038                            .dwattr $C$DW$692, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  129

    7039                            .dwattr $C$DW$692, DW_AT_decl_line(0x2d6)
    7040                            .dwattr $C$DW$692, DW_AT_decl_column(0x16)
    7041                    
    7042                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7043                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x2d4)
    7044                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
    7045                            .dwendtag $C$DW$T$45
    7046                    
    7047                    $C$DW$T$50      .dwtag  DW_TAG_typedef
    7048                            .dwattr $C$DW$T$50, DW_AT_name("keyUsageDescriptor_t")
    7049                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$45)
    7050                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    7051                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7052                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2d7)
    7053                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x03)
    7054                    
    7055                    $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    7056                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    7057                            .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    7058                    
    7059                    
    7060                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    7061                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x2c)
    7062                    $C$DW$693       .dwtag  DW_TAG_member
    7063                            .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$47)
    7064                            .dwattr $C$DW$693, DW_AT_name("keyIdLookupList")
    7065                            .dwattr $C$DW$693, DW_AT_TI_symbol_name("keyIdLookupList")
    7066                            .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7067                            .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    7068                            .dwattr $C$DW$693, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7069                            .dwattr $C$DW$693, DW_AT_decl_line(0x2dc)
    7070                            .dwattr $C$DW$693, DW_AT_decl_column(0x1d)
    7071                    
    7072                    $C$DW$694       .dwtag  DW_TAG_member
    7073                            .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$21)
    7074                            .dwattr $C$DW$694, DW_AT_name("keyIdLookupEntries")
    7075                            .dwattr $C$DW$694, DW_AT_TI_symbol_name("keyIdLookupEntries")
    7076                            .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7077                            .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    7078                            .dwattr $C$DW$694, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7079                            .dwattr $C$DW$694, DW_AT_decl_line(0x2dd)
    7080                            .dwattr $C$DW$694, DW_AT_decl_column(0x1c)
    7081                    
    7082                    $C$DW$695       .dwtag  DW_TAG_member
    7083                            .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$49)
    7084                            .dwattr $C$DW$695, DW_AT_name("keyDeviceList")
    7085                            .dwattr $C$DW$695, DW_AT_TI_symbol_name("keyDeviceList")
    7086                            .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7087                            .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    7088                            .dwattr $C$DW$695, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7089                            .dwattr $C$DW$695, DW_AT_decl_line(0x2df)
    7090                            .dwattr $C$DW$695, DW_AT_decl_column(0x1d)
    7091                    
    7092                    $C$DW$696       .dwtag  DW_TAG_member
    7093                            .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$30)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  130

    7094                            .dwattr $C$DW$696, DW_AT_name("keyDeviceListEntries")
    7095                            .dwattr $C$DW$696, DW_AT_TI_symbol_name("keyDeviceListEntries")
    7096                            .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7097                            .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    7098                            .dwattr $C$DW$696, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7099                            .dwattr $C$DW$696, DW_AT_decl_line(0x2e2)
    7100                            .dwattr $C$DW$696, DW_AT_decl_column(0x1d)
    7101                    
    7102                    $C$DW$697       .dwtag  DW_TAG_member
    7103                            .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$51)
    7104                            .dwattr $C$DW$697, DW_AT_name("keyUsageList")
    7105                            .dwattr $C$DW$697, DW_AT_TI_symbol_name("keyUsageList")
    7106                            .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7107                            .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    7108                            .dwattr $C$DW$697, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7109                            .dwattr $C$DW$697, DW_AT_decl_line(0x2e4)
    7110                            .dwattr $C$DW$697, DW_AT_decl_column(0x1d)
    7111                    
    7112                    $C$DW$698       .dwtag  DW_TAG_member
    7113                            .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$21)
    7114                            .dwattr $C$DW$698, DW_AT_name("keyUsageListEntries")
    7115                            .dwattr $C$DW$698, DW_AT_TI_symbol_name("keyUsageListEntries")
    7116                            .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7117                            .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    7118                            .dwattr $C$DW$698, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7119                            .dwattr $C$DW$698, DW_AT_decl_line(0x2e6)
    7120                            .dwattr $C$DW$698, DW_AT_decl_column(0x1c)
    7121                    
    7122                    $C$DW$699       .dwtag  DW_TAG_member
    7123                            .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$52)
    7124                            .dwattr $C$DW$699, DW_AT_name("key")
    7125                            .dwattr $C$DW$699, DW_AT_TI_symbol_name("key")
    7126                            .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    7127                            .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    7128                            .dwattr $C$DW$699, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7129                            .dwattr $C$DW$699, DW_AT_decl_line(0x2e8)
    7130                            .dwattr $C$DW$699, DW_AT_decl_column(0x1c)
    7131                    
    7132                    $C$DW$700       .dwtag  DW_TAG_member
    7133                            .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$32)
    7134                            .dwattr $C$DW$700, DW_AT_name("frameCounter")
    7135                            .dwattr $C$DW$700, DW_AT_TI_symbol_name("frameCounter")
    7136                            .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7137                            .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    7138                            .dwattr $C$DW$700, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7139                            .dwattr $C$DW$700, DW_AT_decl_line(0x2e9)
    7140                            .dwattr $C$DW$700, DW_AT_decl_column(0x1c)
    7141                    
    7142                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7143                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x2db)
    7144                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    7145                            .dwendtag $C$DW$T$53
    7146                    
    7147                    $C$DW$T$55      .dwtag  DW_TAG_typedef
    7148                            .dwattr $C$DW$T$55, DW_AT_name("keyDescriptor_t")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  131

    7149                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$53)
    7150                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    7151                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7152                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x2ec)
    7153                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x03)
    7154                    
    7155                    $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    7156                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    7157                            .dwattr $C$DW$T$56, DW_AT_address_class(0x20)
    7158                    
    7159                    
    7160                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    7161                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x78)
    7162                    $C$DW$701       .dwtag  DW_TAG_member
    7163                            .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$32)
    7164                            .dwattr $C$DW$701, DW_AT_name("timestamp")
    7165                            .dwattr $C$DW$701, DW_AT_TI_symbol_name("timestamp")
    7166                            .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7167                            .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    7168                            .dwattr $C$DW$701, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7169                            .dwattr $C$DW$701, DW_AT_decl_line(0x356)
    7170                            .dwattr $C$DW$701, DW_AT_decl_column(0x19)
    7171                    
    7172                    $C$DW$702       .dwtag  DW_TAG_member
    7173                            .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$30)
    7174                            .dwattr $C$DW$702, DW_AT_name("timestamp2")
    7175                            .dwattr $C$DW$702, DW_AT_TI_symbol_name("timestamp2")
    7176                            .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7177                            .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    7178                            .dwattr $C$DW$702, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7179                            .dwattr $C$DW$702, DW_AT_decl_line(0x357)
    7180                            .dwattr $C$DW$702, DW_AT_decl_column(0x19)
    7181                    
    7182                    $C$DW$703       .dwtag  DW_TAG_member
    7183                            .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$30)
    7184                            .dwattr $C$DW$703, DW_AT_name("timeToLive")
    7185                            .dwattr $C$DW$703, DW_AT_TI_symbol_name("timeToLive")
    7186                            .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7187                            .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    7188                            .dwattr $C$DW$703, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7189                            .dwattr $C$DW$703, DW_AT_decl_line(0x358)
    7190                            .dwattr $C$DW$703, DW_AT_decl_column(0x19)
    7191                    
    7192                    $C$DW$704       .dwtag  DW_TAG_member
    7193                            .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$21)
    7194                            .dwattr $C$DW$704, DW_AT_name("frameType")
    7195                            .dwattr $C$DW$704, DW_AT_TI_symbol_name("frameType")
    7196                            .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7197                            .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    7198                            .dwattr $C$DW$704, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7199                            .dwattr $C$DW$704, DW_AT_decl_line(0x359)
    7200                            .dwattr $C$DW$704, DW_AT_decl_column(0x19)
    7201                    
    7202                    $C$DW$705       .dwtag  DW_TAG_member
    7203                            .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$30)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  132

    7204                            .dwattr $C$DW$705, DW_AT_name("txOptions")
    7205                            .dwattr $C$DW$705, DW_AT_TI_symbol_name("txOptions")
    7206                            .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7207                            .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    7208                            .dwattr $C$DW$705, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7209                            .dwattr $C$DW$705, DW_AT_decl_line(0x35a)
    7210                            .dwattr $C$DW$705, DW_AT_decl_column(0x19)
    7211                    
    7212                    $C$DW$706       .dwtag  DW_TAG_member
    7213                            .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$21)
    7214                            .dwattr $C$DW$706, DW_AT_name("txMode")
    7215                            .dwattr $C$DW$706, DW_AT_TI_symbol_name("txMode")
    7216                            .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7217                            .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    7218                            .dwattr $C$DW$706, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7219                            .dwattr $C$DW$706, DW_AT_decl_line(0x35b)
    7220                            .dwattr $C$DW$706, DW_AT_decl_column(0x19)
    7221                    
    7222                    $C$DW$707       .dwtag  DW_TAG_member
    7223                            .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$21)
    7224                            .dwattr $C$DW$707, DW_AT_name("txSched")
    7225                            .dwattr $C$DW$707, DW_AT_TI_symbol_name("txSched")
    7226                            .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7227                            .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    7228                            .dwattr $C$DW$707, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7229                            .dwattr $C$DW$707, DW_AT_decl_line(0x35c)
    7230                            .dwattr $C$DW$707, DW_AT_decl_column(0x19)
    7231                    
    7232                    $C$DW$708       .dwtag  DW_TAG_member
    7233                            .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$21)
    7234                            .dwattr $C$DW$708, DW_AT_name("retries")
    7235                            .dwattr $C$DW$708, DW_AT_TI_symbol_name("retries")
    7236                            .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7237                            .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    7238                            .dwattr $C$DW$708, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7239                            .dwattr $C$DW$708, DW_AT_decl_line(0x35d)
    7240                            .dwattr $C$DW$708, DW_AT_decl_column(0x19)
    7241                    
    7242                    $C$DW$709       .dwtag  DW_TAG_member
    7243                            .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$21)
    7244                            .dwattr $C$DW$709, DW_AT_name("channel")
    7245                            .dwattr $C$DW$709, DW_AT_TI_symbol_name("channel")
    7246                            .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    7247                            .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    7248                            .dwattr $C$DW$709, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7249                            .dwattr $C$DW$709, DW_AT_decl_line(0x35e)
    7250                            .dwattr $C$DW$709, DW_AT_decl_column(0x19)
    7251                    
    7252                    $C$DW$710       .dwtag  DW_TAG_member
    7253                            .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$21)
    7254                            .dwattr $C$DW$710, DW_AT_name("power")
    7255                            .dwattr $C$DW$710, DW_AT_TI_symbol_name("power")
    7256                            .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7257                            .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    7258                            .dwattr $C$DW$710, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  133

    7259                            .dwattr $C$DW$710, DW_AT_decl_line(0x35f)
    7260                            .dwattr $C$DW$710, DW_AT_decl_column(0x19)
    7261                    
    7262                    $C$DW$711       .dwtag  DW_TAG_member
    7263                            .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$21)
    7264                            .dwattr $C$DW$711, DW_AT_name("mpduLinkQuality")
    7265                            .dwattr $C$DW$711, DW_AT_TI_symbol_name("mpduLinkQuality")
    7266                            .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    7267                            .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    7268                            .dwattr $C$DW$711, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7269                            .dwattr $C$DW$711, DW_AT_decl_line(0x360)
    7270                            .dwattr $C$DW$711, DW_AT_decl_column(0x19)
    7271                    
    7272                    $C$DW$712       .dwtag  DW_TAG_member
    7273                            .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$21)
    7274                            .dwattr $C$DW$712, DW_AT_name("correlation")
    7275                            .dwattr $C$DW$712, DW_AT_TI_symbol_name("correlation")
    7276                            .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7277                            .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    7278                            .dwattr $C$DW$712, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7279                            .dwattr $C$DW$712, DW_AT_decl_line(0x361)
    7280                            .dwattr $C$DW$712, DW_AT_decl_column(0x19)
    7281                    
    7282                    $C$DW$713       .dwtag  DW_TAG_member
    7283                            .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$54)
    7284                            .dwattr $C$DW$713, DW_AT_name("rssi")
    7285                            .dwattr $C$DW$713, DW_AT_TI_symbol_name("rssi")
    7286                            .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    7287                            .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    7288                            .dwattr $C$DW$713, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7289                            .dwattr $C$DW$713, DW_AT_decl_line(0x362)
    7290                            .dwattr $C$DW$713, DW_AT_decl_column(0x19)
    7291                    
    7292                    $C$DW$714       .dwtag  DW_TAG_member
    7293                            .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$40)
    7294                            .dwattr $C$DW$714, DW_AT_name("ptrMData")
    7295                            .dwattr $C$DW$714, DW_AT_TI_symbol_name("ptrMData")
    7296                            .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7297                            .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    7298                            .dwattr $C$DW$714, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7299                            .dwattr $C$DW$714, DW_AT_decl_line(0x364)
    7300                            .dwattr $C$DW$714, DW_AT_decl_column(0x19)
    7301                    
    7302                    $C$DW$715       .dwtag  DW_TAG_member
    7303                            .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$56)
    7304                            .dwattr $C$DW$715, DW_AT_name("pKeyDesc")
    7305                            .dwattr $C$DW$715, DW_AT_TI_symbol_name("pKeyDesc")
    7306                            .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7307                            .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    7308                            .dwattr $C$DW$715, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7309                            .dwattr $C$DW$715, DW_AT_decl_line(0x365)
    7310                            .dwattr $C$DW$715, DW_AT_decl_column(0x19)
    7311                    
    7312                    $C$DW$716       .dwtag  DW_TAG_member
    7313                            .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$32)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  134

    7314                            .dwattr $C$DW$716, DW_AT_name("frameCntr")
    7315                            .dwattr $C$DW$716, DW_AT_TI_symbol_name("frameCntr")
    7316                            .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7317                            .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    7318                            .dwattr $C$DW$716, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7319                            .dwattr $C$DW$716, DW_AT_decl_line(0x366)
    7320                            .dwattr $C$DW$716, DW_AT_decl_column(0x19)
    7321                    
    7322                    $C$DW$717       .dwtag  DW_TAG_member
    7323                            .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$58)
    7324                            .dwattr $C$DW$717, DW_AT_name("payloadIeInfo")
    7325                            .dwattr $C$DW$717, DW_AT_TI_symbol_name("payloadIeInfo")
    7326                            .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7327                            .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    7328                            .dwattr $C$DW$717, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7329                            .dwattr $C$DW$717, DW_AT_decl_line(0x368)
    7330                            .dwattr $C$DW$717, DW_AT_decl_column(0x19)
    7331                    
    7332                    $C$DW$718       .dwtag  DW_TAG_member
    7333                            .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$60)
    7334                            .dwattr $C$DW$718, DW_AT_name("headerIeInfo")
    7335                            .dwattr $C$DW$718, DW_AT_TI_symbol_name("headerIeInfo")
    7336                            .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7337                            .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    7338                            .dwattr $C$DW$718, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7339                            .dwattr $C$DW$718, DW_AT_decl_line(0x369)
    7340                            .dwattr $C$DW$718, DW_AT_decl_column(0x19)
    7341                    
    7342                    $C$DW$719       .dwtag  DW_TAG_member
    7343                            .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$30)
    7344                            .dwattr $C$DW$719, DW_AT_name("totalLen")
    7345                            .dwattr $C$DW$719, DW_AT_TI_symbol_name("totalLen")
    7346                            .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7347                            .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    7348                            .dwattr $C$DW$719, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7349                            .dwattr $C$DW$719, DW_AT_decl_line(0x36a)
    7350                            .dwattr $C$DW$719, DW_AT_decl_column(0x19)
    7351                    
    7352                    $C$DW$720       .dwtag  DW_TAG_member
    7353                            .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$40)
    7354                            .dwattr $C$DW$720, DW_AT_name("ptrHeaderIE")
    7355                            .dwattr $C$DW$720, DW_AT_TI_symbol_name("ptrHeaderIE")
    7356                            .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7357                            .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    7358                            .dwattr $C$DW$720, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7359                            .dwattr $C$DW$720, DW_AT_decl_line(0x36b)
    7360                            .dwattr $C$DW$720, DW_AT_decl_column(0x19)
    7361                    
    7362                    $C$DW$721       .dwtag  DW_TAG_member
    7363                            .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$30)
    7364                            .dwattr $C$DW$721, DW_AT_name("headerIesLen")
    7365                            .dwattr $C$DW$721, DW_AT_TI_symbol_name("headerIesLen")
    7366                            .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7367                            .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    7368                            .dwattr $C$DW$721, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  135

    7369                            .dwattr $C$DW$721, DW_AT_decl_line(0x36c)
    7370                            .dwattr $C$DW$721, DW_AT_decl_column(0x19)
    7371                    
    7372                    $C$DW$722       .dwtag  DW_TAG_member
    7373                            .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$40)
    7374                            .dwattr $C$DW$722, DW_AT_name("ptrPayloadIE")
    7375                            .dwattr $C$DW$722, DW_AT_TI_symbol_name("ptrPayloadIE")
    7376                            .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    7377                            .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    7378                            .dwattr $C$DW$722, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7379                            .dwattr $C$DW$722, DW_AT_decl_line(0x36d)
    7380                            .dwattr $C$DW$722, DW_AT_decl_column(0x19)
    7381                    
    7382                    $C$DW$723       .dwtag  DW_TAG_member
    7383                            .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$40)
    7384                            .dwattr $C$DW$723, DW_AT_name("ptrUTIE")
    7385                            .dwattr $C$DW$723, DW_AT_TI_symbol_name("ptrUTIE")
    7386                            .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    7387                            .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    7388                            .dwattr $C$DW$723, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7389                            .dwattr $C$DW$723, DW_AT_decl_line(0x36e)
    7390                            .dwattr $C$DW$723, DW_AT_decl_column(0x19)
    7391                    
    7392                    $C$DW$724       .dwtag  DW_TAG_member
    7393                            .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$40)
    7394                            .dwattr $C$DW$724, DW_AT_name("ptrBTIE")
    7395                            .dwattr $C$DW$724, DW_AT_TI_symbol_name("ptrBTIE")
    7396                            .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    7397                            .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    7398                            .dwattr $C$DW$724, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7399                            .dwattr $C$DW$724, DW_AT_decl_line(0x36f)
    7400                            .dwattr $C$DW$724, DW_AT_decl_column(0x19)
    7401                    
    7402                    $C$DW$725       .dwtag  DW_TAG_member
    7403                            .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$40)
    7404                            .dwattr $C$DW$725, DW_AT_name("ptrFrameCnt")
    7405                            .dwattr $C$DW$725, DW_AT_TI_symbol_name("ptrFrameCnt")
    7406                            .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7407                            .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    7408                            .dwattr $C$DW$725, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7409                            .dwattr $C$DW$725, DW_AT_decl_line(0x370)
    7410                            .dwattr $C$DW$725, DW_AT_decl_column(0x19)
    7411                    
    7412                    $C$DW$726       .dwtag  DW_TAG_member
    7413                            .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$21)
    7414                            .dwattr $C$DW$726, DW_AT_name("rsl")
    7415                            .dwattr $C$DW$726, DW_AT_TI_symbol_name("rsl")
    7416                            .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7417                            .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    7418                            .dwattr $C$DW$726, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7419                            .dwattr $C$DW$726, DW_AT_decl_line(0x371)
    7420                            .dwattr $C$DW$726, DW_AT_decl_column(0x19)
    7421                    
    7422                    $C$DW$727       .dwtag  DW_TAG_member
    7423                            .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$21)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  136

    7424                            .dwattr $C$DW$727, DW_AT_name("nb")
    7425                            .dwattr $C$DW$727, DW_AT_TI_symbol_name("nb")
    7426                            .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    7427                            .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    7428                            .dwattr $C$DW$727, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7429                            .dwattr $C$DW$727, DW_AT_decl_line(0x372)
    7430                            .dwattr $C$DW$727, DW_AT_decl_column(0x19)
    7431                    
    7432                    $C$DW$728       .dwtag  DW_TAG_member
    7433                            .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$21)
    7434                            .dwattr $C$DW$728, DW_AT_name("be")
    7435                            .dwattr $C$DW$728, DW_AT_TI_symbol_name("be")
    7436                            .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7437                            .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    7438                            .dwattr $C$DW$728, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7439                            .dwattr $C$DW$728, DW_AT_decl_line(0x373)
    7440                            .dwattr $C$DW$728, DW_AT_decl_column(0x19)
    7441                    
    7442                    $C$DW$729       .dwtag  DW_TAG_member
    7443                            .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$21)
    7444                            .dwattr $C$DW$729, DW_AT_name("fhFrameType")
    7445                            .dwattr $C$DW$729, DW_AT_TI_symbol_name("fhFrameType")
    7446                            .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x5f]
    7447                            .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    7448                            .dwattr $C$DW$729, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7449                            .dwattr $C$DW$729, DW_AT_decl_line(0x374)
    7450                            .dwattr $C$DW$729, DW_AT_decl_column(0x19)
    7451                    
    7452                    $C$DW$730       .dwtag  DW_TAG_member
    7453                            .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$21)
    7454                            .dwattr $C$DW$730, DW_AT_name("gpDuration")
    7455                            .dwattr $C$DW$730, DW_AT_TI_symbol_name("gpDuration")
    7456                            .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7457                            .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    7458                            .dwattr $C$DW$730, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7459                            .dwattr $C$DW$730, DW_AT_decl_line(0x375)
    7460                            .dwattr $C$DW$730, DW_AT_decl_column(0x19)
    7461                    
    7462                    $C$DW$731       .dwtag  DW_TAG_member
    7463                            .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$21)
    7464                            .dwattr $C$DW$731, DW_AT_name("gpNumOfTx")
    7465                            .dwattr $C$DW$731, DW_AT_TI_symbol_name("gpNumOfTx")
    7466                            .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    7467                            .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    7468                            .dwattr $C$DW$731, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7469                            .dwattr $C$DW$731, DW_AT_decl_line(0x376)
    7470                            .dwattr $C$DW$731, DW_AT_decl_column(0x19)
    7471                    
    7472                    $C$DW$732       .dwtag  DW_TAG_member
    7473                            .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$21)
    7474                            .dwattr $C$DW$732, DW_AT_name("gpInterframeDelay")
    7475                            .dwattr $C$DW$732, DW_AT_TI_symbol_name("gpInterframeDelay")
    7476                            .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    7477                            .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7478                            .dwattr $C$DW$732, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  137

    7479                            .dwattr $C$DW$732, DW_AT_decl_line(0x377)
    7480                            .dwattr $C$DW$732, DW_AT_decl_column(0x19)
    7481                    
    7482                    $C$DW$733       .dwtag  DW_TAG_member
    7483                            .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$567)
    7484                            .dwattr $C$DW$733, DW_AT_name("dest")
    7485                            .dwattr $C$DW$733, DW_AT_TI_symbol_name("dest")
    7486                            .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    7487                            .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7488                            .dwattr $C$DW$733, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7489                            .dwattr $C$DW$733, DW_AT_decl_line(0x37d)
    7490                            .dwattr $C$DW$733, DW_AT_decl_column(0x05)
    7491                    
    7492                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7493                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x355)
    7494                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x01)
    7495                            .dwendtag $C$DW$T$61
    7496                    
    7497                    $C$DW$T$63      .dwtag  DW_TAG_typedef
    7498                            .dwattr $C$DW$T$63, DW_AT_name("macTxIntData_t")
    7499                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$61)
    7500                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    7501                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7502                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x37e)
    7503                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    7504                    
    7505                    
    7506                    $C$DW$T$64      .dwtag  DW_TAG_structure_type
    7507                            .dwattr $C$DW$T$64, DW_AT_byte_size(0xa4)
    7508                    $C$DW$734       .dwtag  DW_TAG_member
    7509                            .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$38)
    7510                            .dwattr $C$DW$734, DW_AT_name("hdr")
    7511                            .dwattr $C$DW$734, DW_AT_TI_symbol_name("hdr")
    7512                            .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7513                            .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    7514                            .dwattr $C$DW$734, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7515                            .dwattr $C$DW$734, DW_AT_decl_line(0x150)
    7516                            .dwattr $C$DW$734, DW_AT_decl_column(0x1f)
    7517                    
    7518                    $C$DW$735       .dwtag  DW_TAG_member
    7519                            .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$62)
    7520                            .dwattr $C$DW$735, DW_AT_name("mpdu")
    7521                            .dwattr $C$DW$735, DW_AT_TI_symbol_name("mpdu")
    7522                            .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7523                            .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    7524                            .dwattr $C$DW$735, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7525                            .dwattr $C$DW$735, DW_AT_decl_line(0x151)
    7526                            .dwattr $C$DW$735, DW_AT_decl_column(0x1f)
    7527                    
    7528                    $C$DW$736       .dwtag  DW_TAG_member
    7529                            .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$63)
    7530                            .dwattr $C$DW$736, DW_AT_name("internal")
    7531                            .dwattr $C$DW$736, DW_AT_TI_symbol_name("internal")
    7532                            .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7533                            .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6B5A2667-10EC-44CC-B0C3-1356C5C35132} PAGE  138

    7534                            .dwattr $C$DW$736, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7535                            .dwattr $C$DW$736, DW_AT_decl_line(0x152)
    7536                            .dwattr $C$DW$736, DW_AT_decl_column(0x1f)
    7537                    
    7538                    $C$DW$737       .dwtag  DW_TAG_member
    7539                            .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$568)
    7540                            .dwattr $C$DW$737, DW_AT_name("mac")
    7541                            .dwattr $C$DW$737, DW_AT_TI_symbol_name("mac")
    7542                            .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
