TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Nov 28 13:34:37 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/Services/nvoctp.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\sensor_cc1350lp
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    6488                    
    6489                    $C$DW$T$704     .dwtag  DW_TAG_typedef
    6490                            .dwattr $C$DW$T$704, DW_AT_name("tFlashStateCommandsType")
    6491                            .dwattr $C$DW$T$704, DW_AT_type(*$C$DW$T$703)
    6492                            .dwattr $C$DW$T$704, DW_AT_language(DW_LANG_C)
    6493                            .dwattr $C$DW$T$704, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    6494                            .dwattr $C$DW$T$704, DW_AT_decl_line(0xb0)
    6495                            .dwattr $C$DW$T$704, DW_AT_decl_column(0x03)
    6496                    
    6497                    
    6498                    $C$DW$T$705     .dwtag  DW_TAG_enumeration_type
    6499                            .dwattr $C$DW$T$705, DW_AT_byte_size(0x01)
    6500                    $C$DW$421       .dwtag  DW_TAG_enumerator
    6501                            .dwattr $C$DW$421, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    6502                            .dwattr $C$DW$421, DW_AT_const_value(0xe0)
    6503                            .dwattr $C$DW$421, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6504                            .dwattr $C$DW$421, DW_AT_decl_line(0x3de)
    6505                            .dwattr $C$DW$421, DW_AT_decl_column(0x04)
    6506                    
    6507                    $C$DW$422       .dwtag  DW_TAG_enumerator
    6508                            .dwattr $C$DW$422, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    6509                            .dwattr $C$DW$422, DW_AT_const_value(0xe1)
    6510                            .dwattr $C$DW$422, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6511                            .dwattr $C$DW$422, DW_AT_decl_line(0x3e0)
    6512                            .dwattr $C$DW$422, DW_AT_decl_column(0x04)
    6513                    
    6514                    $C$DW$423       .dwtag  DW_TAG_enumerator
    6515                            .dwattr $C$DW$423, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    6516                            .dwattr $C$DW$423, DW_AT_const_value(0xe2)
    6517                            .dwattr $C$DW$423, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6518                            .dwattr $C$DW$423, DW_AT_decl_line(0x3e2)
    6519                            .dwattr $C$DW$423, DW_AT_decl_column(0x04)
    6520                    
    6521                    $C$DW$424       .dwtag  DW_TAG_enumerator
    6522                            .dwattr $C$DW$424, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  120

    6523                            .dwattr $C$DW$424, DW_AT_const_value(0xe3)
    6524                            .dwattr $C$DW$424, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6525                            .dwattr $C$DW$424, DW_AT_decl_line(0x3e4)
    6526                            .dwattr $C$DW$424, DW_AT_decl_column(0x04)
    6527                    
    6528                    $C$DW$425       .dwtag  DW_TAG_enumerator
    6529                            .dwattr $C$DW$425, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    6530                            .dwattr $C$DW$425, DW_AT_const_value(0xe4)
    6531                            .dwattr $C$DW$425, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6532                            .dwattr $C$DW$425, DW_AT_decl_line(0x3e6)
    6533                            .dwattr $C$DW$425, DW_AT_decl_column(0x04)
    6534                    
    6535                    $C$DW$426       .dwtag  DW_TAG_enumerator
    6536                            .dwattr $C$DW$426, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    6537                            .dwattr $C$DW$426, DW_AT_const_value(0xe5)
    6538                            .dwattr $C$DW$426, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6539                            .dwattr $C$DW$426, DW_AT_decl_line(0x3e8)
    6540                            .dwattr $C$DW$426, DW_AT_decl_column(0x04)
    6541                    
    6542                            .dwattr $C$DW$T$705, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    6543                            .dwattr $C$DW$T$705, DW_AT_decl_line(0x3dc)
    6544                            .dwattr $C$DW$T$705, DW_AT_decl_column(0x01)
    6545                            .dwendtag $C$DW$T$705
    6546                    
    6547                    $C$DW$T$706     .dwtag  DW_TAG_typedef
    6548                            .dwattr $C$DW$T$706, DW_AT_name("ICall_RemotiCmdEvent_t")
    6549                            .dwattr $C$DW$T$706, DW_AT_type(*$C$DW$T$705)
    6550                            .dwattr $C$DW$T$706, DW_AT_language(DW_LANG_C)
    6551                            .dwattr $C$DW$T$706, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    6552                            .dwattr $C$DW$T$706, DW_AT_decl_line(0x3e9)
    6553                            .dwattr $C$DW$T$706, DW_AT_decl_column(0x02)
    6554                    
    6555                    
    6556                    $C$DW$T$132     .dwtag  DW_TAG_structure_type
    6557                            .dwattr $C$DW$T$132, DW_AT_byte_size(0x10)
    6558                    $C$DW$427       .dwtag  DW_TAG_member
    6559                            .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$127)
    6560                            .dwattr $C$DW$427, DW_AT_name("cmpid")
    6561                            .dwattr $C$DW$427, DW_AT_TI_symbol_name("cmpid")
    6562                            .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6563                            .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    6564                            .dwattr $C$DW$427, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6565                            .dwattr $C$DW$427, DW_AT_decl_line(0xea)
    6566                            .dwattr $C$DW$427, DW_AT_decl_column(0x0e)
    6567                    
    6568                    $C$DW$428       .dwtag  DW_TAG_member
    6569                            .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$129)
    6570                            .dwattr $C$DW$428, DW_AT_name("subid")
    6571                            .dwattr $C$DW$428, DW_AT_TI_symbol_name("subid")
    6572                            .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6573                            .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    6574                            .dwattr $C$DW$428, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6575                            .dwattr $C$DW$428, DW_AT_decl_line(0xeb)
    6576                            .dwattr $C$DW$428, DW_AT_decl_column(0x0e)
    6577                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  121

    6578                    $C$DW$429       .dwtag  DW_TAG_member
    6579                            .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$129)
    6580                            .dwattr $C$DW$429, DW_AT_name("itmid")
    6581                            .dwattr $C$DW$429, DW_AT_TI_symbol_name("itmid")
    6582                            .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6583                            .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    6584                            .dwattr $C$DW$429, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6585                            .dwattr $C$DW$429, DW_AT_decl_line(0xec)
    6586                            .dwattr $C$DW$429, DW_AT_decl_column(0x0e)
    6587                    
    6588                    $C$DW$430       .dwtag  DW_TAG_member
    6589                            .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$131)
    6590                            .dwattr $C$DW$430, DW_AT_name("sysid")
    6591                            .dwattr $C$DW$430, DW_AT_TI_symbol_name("sysid")
    6592                            .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6593                            .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    6594                            .dwattr $C$DW$430, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6595                            .dwattr $C$DW$430, DW_AT_decl_line(0xed)
    6596                            .dwattr $C$DW$430, DW_AT_decl_column(0x0e)
    6597                    
    6598                    $C$DW$431       .dwtag  DW_TAG_member
    6599                            .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$131)
    6600                            .dwattr $C$DW$431, DW_AT_name("stats")
    6601                            .dwattr $C$DW$431, DW_AT_TI_symbol_name("stats")
    6602                            .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6603                            .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    6604                            .dwattr $C$DW$431, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6605                            .dwattr $C$DW$431, DW_AT_decl_line(0xee)
    6606                            .dwattr $C$DW$431, DW_AT_decl_column(0x0e)
    6607                    
    6608                    $C$DW$432       .dwtag  DW_TAG_member
    6609                            .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$129)
    6610                            .dwattr $C$DW$432, DW_AT_name("hofs")
    6611                            .dwattr $C$DW$432, DW_AT_TI_symbol_name("hofs")
    6612                            .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6613                            .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    6614                            .dwattr $C$DW$432, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6615                            .dwattr $C$DW$432, DW_AT_decl_line(0xef)
    6616                            .dwattr $C$DW$432, DW_AT_decl_column(0x0e)
    6617                    
    6618                    $C$DW$433       .dwtag  DW_TAG_member
    6619                            .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$129)
    6620                            .dwattr $C$DW$433, DW_AT_name("len")
    6621                            .dwattr $C$DW$433, DW_AT_TI_symbol_name("len")
    6622                            .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6623                            .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    6624                            .dwattr $C$DW$433, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6625                            .dwattr $C$DW$433, DW_AT_decl_line(0xf0)
    6626                            .dwattr $C$DW$433, DW_AT_decl_column(0x0e)
    6627                    
    6628                            .dwattr $C$DW$T$132, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6629                            .dwattr $C$DW$T$132, DW_AT_decl_line(0xe9)
    6630                            .dwattr $C$DW$T$132, DW_AT_decl_column(0x01)
    6631                            .dwendtag $C$DW$T$132
    6632                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  122

    6633                    $C$DW$T$133     .dwtag  DW_TAG_typedef
    6634                            .dwattr $C$DW$T$133, DW_AT_name("NVOCTP_itemHdr_t")
    6635                            .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
    6636                            .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    6637                            .dwattr $C$DW$T$133, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6638                            .dwattr $C$DW$T$133, DW_AT_decl_line(0xf1)
    6639                            .dwattr $C$DW$T$133, DW_AT_decl_column(0x03)
    6640                    
    6641                    $C$DW$T$134     .dwtag  DW_TAG_pointer_type
    6642                            .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$133)
    6643                            .dwattr $C$DW$T$134, DW_AT_address_class(0x20)
    6644                    
    6645                    $C$DW$T$707     .dwtag  DW_TAG_const_type
    6646                            .dwattr $C$DW$T$707, DW_AT_type(*$C$DW$T$134)
    6647                    
    6648                    
    6649                    $C$DW$T$136     .dwtag  DW_TAG_structure_type
    6650                            .dwattr $C$DW$T$136, DW_AT_byte_size(0x10)
    6651                    $C$DW$434       .dwtag  DW_TAG_member
    6652                            .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$134)
    6653                            .dwattr $C$DW$434, DW_AT_name("iHdr")
    6654                            .dwattr $C$DW$434, DW_AT_TI_symbol_name("iHdr")
    6655                            .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6656                            .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    6657                            .dwattr $C$DW$434, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6658                            .dwattr $C$DW$434, DW_AT_decl_line(0x117)
    6659                            .dwattr $C$DW$434, DW_AT_decl_column(0x17)
    6660                    
    6661                    $C$DW$435       .dwtag  DW_TAG_member
    6662                            .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$129)
    6663                            .dwattr $C$DW$435, DW_AT_name("dOfs")
    6664                            .dwattr $C$DW$435, DW_AT_TI_symbol_name("dOfs")
    6665                            .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6666                            .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    6667                            .dwattr $C$DW$435, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6668                            .dwattr $C$DW$435, DW_AT_decl_line(0x118)
    6669                            .dwattr $C$DW$435, DW_AT_decl_column(0x17)
    6670                    
    6671                    $C$DW$436       .dwtag  DW_TAG_member
    6672                            .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$129)
    6673                            .dwattr $C$DW$436, DW_AT_name("bOfs")
    6674                            .dwattr $C$DW$436, DW_AT_TI_symbol_name("bOfs")
    6675                            .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6676                            .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    6677                            .dwattr $C$DW$436, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6678                            .dwattr $C$DW$436, DW_AT_decl_line(0x119)
    6679                            .dwattr $C$DW$436, DW_AT_decl_column(0x17)
    6680                    
    6681                    $C$DW$437       .dwtag  DW_TAG_member
    6682                            .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$129)
    6683                            .dwattr $C$DW$437, DW_AT_name("bLen")
    6684                            .dwattr $C$DW$437, DW_AT_TI_symbol_name("bLen")
    6685                            .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6686                            .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    6687                            .dwattr $C$DW$437, DW_AT_decl_file("../Application/Services/nvoctp.c")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  123

    6688                            .dwattr $C$DW$437, DW_AT_decl_line(0x11a)
    6689                            .dwattr $C$DW$437, DW_AT_decl_column(0x17)
    6690                    
    6691                    $C$DW$438       .dwtag  DW_TAG_member
    6692                            .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$135)
    6693                            .dwattr $C$DW$438, DW_AT_name("pBuf")
    6694                            .dwattr $C$DW$438, DW_AT_TI_symbol_name("pBuf")
    6695                            .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6696                            .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    6697                            .dwattr $C$DW$438, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6698                            .dwattr $C$DW$438, DW_AT_decl_line(0x11b)
    6699                            .dwattr $C$DW$438, DW_AT_decl_column(0x17)
    6700                    
    6701                            .dwattr $C$DW$T$136, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6702                            .dwattr $C$DW$T$136, DW_AT_decl_line(0x116)
    6703                            .dwattr $C$DW$T$136, DW_AT_decl_column(0x01)
    6704                            .dwendtag $C$DW$T$136
    6705                    
    6706                    $C$DW$T$711     .dwtag  DW_TAG_typedef
    6707                            .dwattr $C$DW$T$711, DW_AT_name("NVOCTP_itemWrp_t")
    6708                            .dwattr $C$DW$T$711, DW_AT_type(*$C$DW$T$136)
    6709                            .dwattr $C$DW$T$711, DW_AT_language(DW_LANG_C)
    6710                            .dwattr $C$DW$T$711, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6711                            .dwattr $C$DW$T$711, DW_AT_decl_line(0x11c)
    6712                            .dwattr $C$DW$T$711, DW_AT_decl_column(0x03)
    6713                    
    6714                    $C$DW$T$712     .dwtag  DW_TAG_pointer_type
    6715                            .dwattr $C$DW$T$712, DW_AT_type(*$C$DW$T$711)
    6716                            .dwattr $C$DW$T$712, DW_AT_address_class(0x20)
    6717                    
    6718                    $C$DW$T$713     .dwtag  DW_TAG_const_type
    6719                            .dwattr $C$DW$T$713, DW_AT_type(*$C$DW$T$712)
    6720                    
    6721                    
    6722                    $C$DW$T$137     .dwtag  DW_TAG_structure_type
    6723                            .dwattr $C$DW$T$137, DW_AT_byte_size(0x04)
    6724                    $C$DW$439       .dwtag  DW_TAG_member
    6725                            .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$131)
    6726                            .dwattr $C$DW$439, DW_AT_name("state")
    6727                            .dwattr $C$DW$439, DW_AT_TI_symbol_name("state")
    6728                            .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6729                            .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    6730                            .dwattr $C$DW$439, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6731                            .dwattr $C$DW$439, DW_AT_decl_line(0xc4)
    6732                            .dwattr $C$DW$439, DW_AT_decl_column(0x0d)
    6733                    
    6734                    $C$DW$440       .dwtag  DW_TAG_member
    6735                            .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$131)
    6736                            .dwattr $C$DW$440, DW_AT_name("cycle")
    6737                            .dwattr $C$DW$440, DW_AT_TI_symbol_name("cycle")
    6738                            .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6739                            .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    6740                            .dwattr $C$DW$440, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6741                            .dwattr $C$DW$440, DW_AT_decl_line(0xc5)
    6742                            .dwattr $C$DW$440, DW_AT_decl_column(0x0d)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  124

    6743                    
    6744                    $C$DW$441       .dwtag  DW_TAG_member
    6745                            .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$131)
    6746                            .dwattr $C$DW$441, DW_AT_name("version")
    6747                            .dwattr $C$DW$441, DW_AT_TI_symbol_name("version")
    6748                            .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6749                            .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    6750                            .dwattr $C$DW$441, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6751                            .dwattr $C$DW$441, DW_AT_decl_line(0xc6)
    6752                            .dwattr $C$DW$441, DW_AT_decl_column(0x0d)
    6753                    
    6754                    $C$DW$442       .dwtag  DW_TAG_member
    6755                            .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$131)
    6756                            .dwattr $C$DW$442, DW_AT_name("signature")
    6757                            .dwattr $C$DW$442, DW_AT_TI_symbol_name("signature")
    6758                            .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6759                            .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    6760                            .dwattr $C$DW$442, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6761                            .dwattr $C$DW$442, DW_AT_decl_line(0xc7)
    6762                            .dwattr $C$DW$442, DW_AT_decl_column(0x0d)
    6763                    
    6764                            .dwattr $C$DW$T$137, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6765                            .dwattr $C$DW$T$137, DW_AT_decl_line(0xc3)
    6766                            .dwattr $C$DW$T$137, DW_AT_decl_column(0x01)
    6767                            .dwendtag $C$DW$T$137
    6768                    
    6769                    $C$DW$T$716     .dwtag  DW_TAG_typedef
    6770                            .dwattr $C$DW$T$716, DW_AT_name("NVOCTP_pageHdr_t")
    6771                            .dwattr $C$DW$T$716, DW_AT_type(*$C$DW$T$137)
    6772                            .dwattr $C$DW$T$716, DW_AT_language(DW_LANG_C)
    6773                            .dwattr $C$DW$T$716, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6774                            .dwattr $C$DW$T$716, DW_AT_decl_line(0xc8)
    6775                            .dwattr $C$DW$T$716, DW_AT_decl_column(0x03)
    6776                    
    6777                    
    6778                    $C$DW$T$138     .dwtag  DW_TAG_structure_type
    6779                            .dwattr $C$DW$T$138, DW_AT_byte_size(0x0c)
    6780                    $C$DW$443       .dwtag  DW_TAG_member
    6781                            .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$127)
    6782                            .dwattr $C$DW$443, DW_AT_name("compacts")
    6783                            .dwattr $C$DW$443, DW_AT_TI_symbol_name("compacts")
    6784                            .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6785                            .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    6786                            .dwattr $C$DW$443, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6787                            .dwattr $C$DW$443, DW_AT_decl_line(0x46)
    6788                            .dwattr $C$DW$443, DW_AT_decl_column(0x0e)
    6789                    
    6790                    $C$DW$444       .dwtag  DW_TAG_member
    6791                            .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$129)
    6792                            .dwattr $C$DW$444, DW_AT_name("resets")
    6793                            .dwattr $C$DW$444, DW_AT_TI_symbol_name("resets")
    6794                            .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6795                            .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    6796                            .dwattr $C$DW$444, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6797                            .dwattr $C$DW$444, DW_AT_decl_line(0x47)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  125

    6798                            .dwattr $C$DW$444, DW_AT_decl_column(0x0e)
    6799                    
    6800                    $C$DW$445       .dwtag  DW_TAG_member
    6801                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$129)
    6802                            .dwattr $C$DW$445, DW_AT_name("available")
    6803                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("available")
    6804                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6805                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    6806                            .dwattr $C$DW$445, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6807                            .dwattr $C$DW$445, DW_AT_decl_line(0x48)
    6808                            .dwattr $C$DW$445, DW_AT_decl_column(0x0e)
    6809                    
    6810                    $C$DW$446       .dwtag  DW_TAG_member
    6811                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$129)
    6812                            .dwattr $C$DW$446, DW_AT_name("active")
    6813                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("active")
    6814                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6815                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    6816                            .dwattr $C$DW$446, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6817                            .dwattr $C$DW$446, DW_AT_decl_line(0x49)
    6818                            .dwattr $C$DW$446, DW_AT_decl_column(0x0e)
    6819                    
    6820                    $C$DW$447       .dwtag  DW_TAG_member
    6821                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$129)
    6822                            .dwattr $C$DW$447, DW_AT_name("reserved")
    6823                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("reserved")
    6824                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6825                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    6826                            .dwattr $C$DW$447, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6827                            .dwattr $C$DW$447, DW_AT_decl_line(0x4a)
    6828                            .dwattr $C$DW$447, DW_AT_decl_column(0x0e)
    6829                    
    6830                            .dwattr $C$DW$T$138, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6831                            .dwattr $C$DW$T$138, DW_AT_decl_line(0x45)
    6832                            .dwattr $C$DW$T$138, DW_AT_decl_column(0x01)
    6833                            .dwendtag $C$DW$T$138
    6834                    
    6835                    $C$DW$T$717     .dwtag  DW_TAG_typedef
    6836                            .dwattr $C$DW$T$717, DW_AT_name("NVOCTP_diag_t")
    6837                            .dwattr $C$DW$T$717, DW_AT_type(*$C$DW$T$138)
    6838                            .dwattr $C$DW$T$717, DW_AT_language(DW_LANG_C)
    6839                            .dwattr $C$DW$T$717, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6840                            .dwattr $C$DW$T$717, DW_AT_decl_line(0x4c)
    6841                            .dwattr $C$DW$T$717, DW_AT_decl_column(0x01)
    6842                    
    6843                    
    6844                    $C$DW$T$139     .dwtag  DW_TAG_structure_type
    6845                            .dwattr $C$DW$T$139, DW_AT_byte_size(0x10)
    6846                    $C$DW$448       .dwtag  DW_TAG_member
    6847                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$14)
    6848                            .dwattr $C$DW$448, DW_AT_name("__max_align1")
    6849                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("__max_align1")
    6850                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6851                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    6852                            .dwattr $C$DW$448, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  126

    6853                            .dwattr $C$DW$448, DW_AT_decl_line(0x70)
    6854                            .dwattr $C$DW$448, DW_AT_decl_column(0x0c)
    6855                    
    6856                    $C$DW$449       .dwtag  DW_TAG_member
    6857                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$18)
    6858                            .dwattr $C$DW$449, DW_AT_name("__max_align2")
    6859                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("__max_align2")
    6860                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6861                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    6862                            .dwattr $C$DW$449, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    6863                            .dwattr $C$DW$449, DW_AT_decl_line(0x71)
    6864                            .dwattr $C$DW$449, DW_AT_decl_column(0x0e)
    6865                    
    6866                            .dwattr $C$DW$T$139, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    6867                            .dwattr $C$DW$T$139, DW_AT_decl_line(0x6f)
    6868                            .dwattr $C$DW$T$139, DW_AT_decl_column(0x10)
    6869                            .dwendtag $C$DW$T$139
    6870                    
    6871                    $C$DW$T$718     .dwtag  DW_TAG_typedef
    6872                            .dwattr $C$DW$T$718, DW_AT_name("__max_align_t")
    6873                            .dwattr $C$DW$T$718, DW_AT_type(*$C$DW$T$139)
    6874                            .dwattr $C$DW$T$718, DW_AT_language(DW_LANG_C)
    6875                            .dwattr $C$DW$T$718, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    6876                            .dwattr $C$DW$T$718, DW_AT_decl_line(0x72)
    6877                            .dwattr $C$DW$T$718, DW_AT_decl_column(0x03)
    6878                    
    6879                    
    6880                    $C$DW$T$142     .dwtag  DW_TAG_structure_type
    6881                            .dwattr $C$DW$T$142, DW_AT_byte_size(0x08)
    6882                    $C$DW$450       .dwtag  DW_TAG_member
    6883                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$10)
    6884                            .dwattr $C$DW$450, DW_AT_name("length")
    6885                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("length")
    6886                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6887                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    6888                            .dwattr $C$DW$450, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    6889                            .dwattr $C$DW$450, DW_AT_decl_line(0x165)
    6890                            .dwattr $C$DW$450, DW_AT_decl_column(0x16)
    6891                    
    6892                    $C$DW$451       .dwtag  DW_TAG_member
    6893                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$141)
    6894                            .dwattr $C$DW$451, DW_AT_name("elem")
    6895                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("elem")
    6896                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6897                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    6898                            .dwattr $C$DW$451, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    6899                            .dwattr $C$DW$451, DW_AT_decl_line(0x165)
    6900                            .dwattr $C$DW$451, DW_AT_decl_column(0x3a)
    6901                    
    6902                            .dwattr $C$DW$T$142, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6903                            .dwattr $C$DW$T$142, DW_AT_decl_line(0x165)
    6904                            .dwattr $C$DW$T$142, DW_AT_decl_column(0x10)
    6905                            .dwendtag $C$DW$T$142
    6906                    
    6907                    $C$DW$T$719     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  127

    6908                            .dwattr $C$DW$T$719, DW_AT_name("ARRAY1_ti_sysbios_knl_Swi_hooks")
    6909                            .dwattr $C$DW$T$719, DW_AT_type(*$C$DW$T$142)
    6910                            .dwattr $C$DW$T$719, DW_AT_language(DW_LANG_C)
    6911                            .dwattr $C$DW$T$719, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6912                            .dwattr $C$DW$T$719, DW_AT_decl_line(0x165)
    6913                            .dwattr $C$DW$T$719, DW_AT_decl_column(0x42)
    6914                    
    6915                    
    6916                    $C$DW$T$145     .dwtag  DW_TAG_structure_type
    6917                            .dwattr $C$DW$T$145, DW_AT_byte_size(0x08)
    6918                    $C$DW$452       .dwtag  DW_TAG_member
    6919                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$10)
    6920                            .dwattr $C$DW$452, DW_AT_name("length")
    6921                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("length")
    6922                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6923                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    6924                            .dwattr $C$DW$452, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    6925                            .dwattr $C$DW$452, DW_AT_decl_line(0x166)
    6926                            .dwattr $C$DW$452, DW_AT_decl_column(0x16)
    6927                    
    6928                    $C$DW$453       .dwtag  DW_TAG_member
    6929                            .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$144)
    6930                            .dwattr $C$DW$453, DW_AT_name("elem")
    6931                            .dwattr $C$DW$453, DW_AT_TI_symbol_name("elem")
    6932                            .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6933                            .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    6934                            .dwattr $C$DW$453, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    6935                            .dwattr $C$DW$453, DW_AT_decl_line(0x166)
    6936                            .dwattr $C$DW$453, DW_AT_decl_column(0x40)
    6937                    
    6938                            .dwattr $C$DW$T$145, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6939                            .dwattr $C$DW$T$145, DW_AT_decl_line(0x166)
    6940                            .dwattr $C$DW$T$145, DW_AT_decl_column(0x10)
    6941                            .dwendtag $C$DW$T$145
    6942                    
    6943                    $C$DW$T$720     .dwtag  DW_TAG_typedef
    6944                            .dwattr $C$DW$T$720, DW_AT_name("CARRAY1_ti_sysbios_knl_Swi_hooks")
    6945                            .dwattr $C$DW$T$720, DW_AT_type(*$C$DW$T$145)
    6946                            .dwattr $C$DW$T$720, DW_AT_language(DW_LANG_C)
    6947                            .dwattr $C$DW$T$720, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6948                            .dwattr $C$DW$T$720, DW_AT_decl_line(0x166)
    6949                            .dwattr $C$DW$T$720, DW_AT_decl_column(0x48)
    6950                    
    6951                    $C$DW$T$721     .dwtag  DW_TAG_typedef
    6952                            .dwattr $C$DW$T$721, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
    6953                            .dwattr $C$DW$T$721, DW_AT_type(*$C$DW$T$720)
    6954                            .dwattr $C$DW$T$721, DW_AT_language(DW_LANG_C)
    6955                            .dwattr $C$DW$T$721, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6956                            .dwattr $C$DW$T$721, DW_AT_decl_line(0x168)
    6957                            .dwattr $C$DW$T$721, DW_AT_decl_column(0x2a)
    6958                    
    6959                    $C$DW$T$722     .dwtag  DW_TAG_typedef
    6960                            .dwattr $C$DW$T$722, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
    6961                            .dwattr $C$DW$T$722, DW_AT_type(*$C$DW$T$720)
    6962                            .dwattr $C$DW$T$722, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  128

    6963                            .dwattr $C$DW$T$722, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6964                            .dwattr $C$DW$T$722, DW_AT_decl_line(0x167)
    6965                            .dwattr $C$DW$T$722, DW_AT_decl_column(0x2a)
    6966                    
    6967                    
    6968                    $C$DW$T$148     .dwtag  DW_TAG_structure_type
    6969                            .dwattr $C$DW$T$148, DW_AT_byte_size(0x08)
    6970                    $C$DW$454       .dwtag  DW_TAG_member
    6971                            .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$10)
    6972                            .dwattr $C$DW$454, DW_AT_name("length")
    6973                            .dwattr $C$DW$454, DW_AT_TI_symbol_name("length")
    6974                            .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6975                            .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    6976                            .dwattr $C$DW$454, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    6977                            .dwattr $C$DW$454, DW_AT_decl_line(0x29b)
    6978                            .dwattr $C$DW$454, DW_AT_decl_column(0x16)
    6979                    
    6980                    $C$DW$455       .dwtag  DW_TAG_member
    6981                            .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$147)
    6982                            .dwattr $C$DW$455, DW_AT_name("elem")
    6983                            .dwattr $C$DW$455, DW_AT_TI_symbol_name("elem")
    6984                            .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6985                            .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    6986                            .dwattr $C$DW$455, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    6987                            .dwattr $C$DW$455, DW_AT_decl_line(0x29b)
    6988                            .dwattr $C$DW$455, DW_AT_decl_column(0x3b)
    6989                    
    6990                            .dwattr $C$DW$T$148, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6991                            .dwattr $C$DW$T$148, DW_AT_decl_line(0x29b)
    6992                            .dwattr $C$DW$T$148, DW_AT_decl_column(0x10)
    6993                            .dwendtag $C$DW$T$148
    6994                    
    6995                    $C$DW$T$723     .dwtag  DW_TAG_typedef
    6996                            .dwattr $C$DW$T$723, DW_AT_name("ARRAY1_ti_sysbios_knl_Task_hooks")
    6997                            .dwattr $C$DW$T$723, DW_AT_type(*$C$DW$T$148)
    6998                            .dwattr $C$DW$T$723, DW_AT_language(DW_LANG_C)
    6999                            .dwattr $C$DW$T$723, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    7000                            .dwattr $C$DW$T$723, DW_AT_decl_line(0x29b)
    7001                            .dwattr $C$DW$T$723, DW_AT_decl_column(0x43)
    7002                    
    7003                    
    7004                    $C$DW$T$151     .dwtag  DW_TAG_structure_type
    7005                            .dwattr $C$DW$T$151, DW_AT_byte_size(0x08)
    7006                    $C$DW$456       .dwtag  DW_TAG_member
    7007                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$10)
    7008                            .dwattr $C$DW$456, DW_AT_name("length")
    7009                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("length")
    7010                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7011                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    7012                            .dwattr $C$DW$456, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    7013                            .dwattr $C$DW$456, DW_AT_decl_line(0x29c)
    7014                            .dwattr $C$DW$456, DW_AT_decl_column(0x16)
    7015                    
    7016                    $C$DW$457       .dwtag  DW_TAG_member
    7017                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$150)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  129

    7018                            .dwattr $C$DW$457, DW_AT_name("elem")
    7019                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("elem")
    7020                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7021                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    7022                            .dwattr $C$DW$457, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    7023                            .dwattr $C$DW$457, DW_AT_decl_line(0x29c)
    7024                            .dwattr $C$DW$457, DW_AT_decl_column(0x41)
    7025                    
    7026                            .dwattr $C$DW$T$151, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    7027                            .dwattr $C$DW$T$151, DW_AT_decl_line(0x29c)
    7028                            .dwattr $C$DW$T$151, DW_AT_decl_column(0x10)
    7029                            .dwendtag $C$DW$T$151
    7030                    
    7031                    $C$DW$T$724     .dwtag  DW_TAG_typedef
    7032                            .dwattr $C$DW$T$724, DW_AT_name("CARRAY1_ti_sysbios_knl_Task_hooks")
    7033                            .dwattr $C$DW$T$724, DW_AT_type(*$C$DW$T$151)
    7034                            .dwattr $C$DW$T$724, DW_AT_language(DW_LANG_C)
    7035                            .dwattr $C$DW$T$724, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    7036                            .dwattr $C$DW$T$724, DW_AT_decl_line(0x29c)
    7037                            .dwattr $C$DW$T$724, DW_AT_decl_column(0x49)
    7038                    
    7039                    $C$DW$T$725     .dwtag  DW_TAG_typedef
    7040                            .dwattr $C$DW$T$725, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
    7041                            .dwattr $C$DW$T$725, DW_AT_type(*$C$DW$T$724)
    7042                            .dwattr $C$DW$T$725, DW_AT_language(DW_LANG_C)
    7043                            .dwattr $C$DW$T$725, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    7044                            .dwattr $C$DW$T$725, DW_AT_decl_line(0x29e)
    7045                            .dwattr $C$DW$T$725, DW_AT_decl_column(0x2b)
    7046                    
    7047                    $C$DW$T$726     .dwtag  DW_TAG_typedef
    7048                            .dwattr $C$DW$T$726, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
    7049                            .dwattr $C$DW$T$726, DW_AT_type(*$C$DW$T$724)
    7050                            .dwattr $C$DW$T$726, DW_AT_language(DW_LANG_C)
    7051                            .dwattr $C$DW$T$726, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    7052                            .dwattr $C$DW$T$726, DW_AT_decl_line(0x29d)
    7053                            .dwattr $C$DW$T$726, DW_AT_decl_column(0x2b)
    7054                    
    7055                    
    7056                    $C$DW$T$189     .dwtag  DW_TAG_structure_type
    7057                            .dwattr $C$DW$T$189, DW_AT_byte_size(0x4c)
    7058                    $C$DW$458       .dwtag  DW_TAG_member
    7059                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$154)
    7060                            .dwattr $C$DW$458, DW_AT_name("Crc32")
    7061                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("Crc32")
    7062                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7063                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    7064                            .dwattr $C$DW$458, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7065                            .dwattr $C$DW$458, DW_AT_decl_line(0x76)
    7066                            .dwattr $C$DW$458, DW_AT_decl_column(0x25)
    7067                    
    7068                    $C$DW$459       .dwtag  DW_TAG_member
    7069                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$157)
    7070                            .dwattr $C$DW$459, DW_AT_name("FlashGetSize")
    7071                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("FlashGetSize")
    7072                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  130

    7073                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    7074                            .dwattr $C$DW$459, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7075                            .dwattr $C$DW$459, DW_AT_decl_line(0x77)
    7076                            .dwattr $C$DW$459, DW_AT_decl_column(0x25)
    7077                    
    7078                    $C$DW$460       .dwtag  DW_TAG_member
    7079                            .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$158)
    7080                            .dwattr $C$DW$460, DW_AT_name("GetChipId")
    7081                            .dwattr $C$DW$460, DW_AT_TI_symbol_name("GetChipId")
    7082                            .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7083                            .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    7084                            .dwattr $C$DW$460, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7085                            .dwattr $C$DW$460, DW_AT_decl_line(0x78)
    7086                            .dwattr $C$DW$460, DW_AT_decl_column(0x25)
    7087                    
    7088                    $C$DW$461       .dwtag  DW_TAG_member
    7089                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$161)
    7090                            .dwattr $C$DW$461, DW_AT_name("ReservedLocation1")
    7091                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("ReservedLocation1")
    7092                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7093                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    7094                            .dwattr $C$DW$461, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7095                            .dwattr $C$DW$461, DW_AT_decl_line(0x79)
    7096                            .dwattr $C$DW$461, DW_AT_decl_column(0x25)
    7097                    
    7098                    $C$DW$462       .dwtag  DW_TAG_member
    7099                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$162)
    7100                            .dwattr $C$DW$462, DW_AT_name("ReservedLocation2")
    7101                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("ReservedLocation2")
    7102                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7103                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    7104                            .dwattr $C$DW$462, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7105                            .dwattr $C$DW$462, DW_AT_decl_line(0x7a)
    7106                            .dwattr $C$DW$462, DW_AT_decl_column(0x25)
    7107                    
    7108                    $C$DW$463       .dwtag  DW_TAG_member
    7109                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$163)
    7110                            .dwattr $C$DW$463, DW_AT_name("ReservedLocation3")
    7111                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("ReservedLocation3")
    7112                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7113                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    7114                            .dwattr $C$DW$463, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7115                            .dwattr $C$DW$463, DW_AT_decl_line(0x7b)
    7116                            .dwattr $C$DW$463, DW_AT_decl_column(0x25)
    7117                    
    7118                    $C$DW$464       .dwtag  DW_TAG_member
    7119                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$166)
    7120                            .dwattr $C$DW$464, DW_AT_name("ResetDevice")
    7121                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("ResetDevice")
    7122                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7123                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    7124                            .dwattr $C$DW$464, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7125                            .dwattr $C$DW$464, DW_AT_decl_line(0x7c)
    7126                            .dwattr $C$DW$464, DW_AT_decl_column(0x25)
    7127                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  131

    7128                    $C$DW$465       .dwtag  DW_TAG_member
    7129                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$170)
    7130                            .dwattr $C$DW$465, DW_AT_name("Fletcher32")
    7131                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("Fletcher32")
    7132                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7133                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    7134                            .dwattr $C$DW$465, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7135                            .dwattr $C$DW$465, DW_AT_decl_line(0x7d)
    7136                            .dwattr $C$DW$465, DW_AT_decl_column(0x25)
    7137                    
    7138                    $C$DW$466       .dwtag  DW_TAG_member
    7139                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$174)
    7140                            .dwattr $C$DW$466, DW_AT_name("MinValue")
    7141                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("MinValue")
    7142                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7143                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    7144                            .dwattr $C$DW$466, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7145                            .dwattr $C$DW$466, DW_AT_decl_line(0x7e)
    7146                            .dwattr $C$DW$466, DW_AT_decl_column(0x25)
    7147                    
    7148                    $C$DW$467       .dwtag  DW_TAG_member
    7149                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$175)
    7150                            .dwattr $C$DW$467, DW_AT_name("MaxValue")
    7151                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("MaxValue")
    7152                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7153                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    7154                            .dwattr $C$DW$467, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7155                            .dwattr $C$DW$467, DW_AT_decl_line(0x7f)
    7156                            .dwattr $C$DW$467, DW_AT_decl_column(0x25)
    7157                    
    7158                    $C$DW$468       .dwtag  DW_TAG_member
    7159                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$176)
    7160                            .dwattr $C$DW$468, DW_AT_name("MeanValue")
    7161                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("MeanValue")
    7162                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7163                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    7164                            .dwattr $C$DW$468, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7165                            .dwattr $C$DW$468, DW_AT_decl_line(0x80)
    7166                            .dwattr $C$DW$468, DW_AT_decl_column(0x25)
    7167                    
    7168                    $C$DW$469       .dwtag  DW_TAG_member
    7169                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$177)
    7170                            .dwattr $C$DW$469, DW_AT_name("StandDeviationValue")
    7171                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("StandDeviationValue")
    7172                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7173                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    7174                            .dwattr $C$DW$469, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7175                            .dwattr $C$DW$469, DW_AT_decl_line(0x81)
    7176                            .dwattr $C$DW$469, DW_AT_decl_column(0x25)
    7177                    
    7178                    $C$DW$470       .dwtag  DW_TAG_member
    7179                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$180)
    7180                            .dwattr $C$DW$470, DW_AT_name("ReservedLocation4")
    7181                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("ReservedLocation4")
    7182                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  132

    7183                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    7184                            .dwattr $C$DW$470, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7185                            .dwattr $C$DW$470, DW_AT_decl_line(0x82)
    7186                            .dwattr $C$DW$470, DW_AT_decl_column(0x25)
    7187                    
    7188                    $C$DW$471       .dwtag  DW_TAG_member
    7189                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$181)
    7190                            .dwattr $C$DW$471, DW_AT_name("ReservedLocation5")
    7191                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("ReservedLocation5")
    7192                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7193                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    7194                            .dwattr $C$DW$471, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7195                            .dwattr $C$DW$471, DW_AT_decl_line(0x83)
    7196                            .dwattr $C$DW$471, DW_AT_decl_column(0x25)
    7197                    
    7198                    $C$DW$472       .dwtag  DW_TAG_member
    7199                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$182)
    7200                            .dwattr $C$DW$472, DW_AT_name("HFSourceSafeSwitch")
    7201                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    7202                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7203                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    7204                            .dwattr $C$DW$472, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7205                            .dwattr $C$DW$472, DW_AT_decl_line(0x84)
    7206                            .dwattr $C$DW$472, DW_AT_decl_column(0x25)
    7207                    
    7208                    $C$DW$473       .dwtag  DW_TAG_member
    7209                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$185)
    7210                            .dwattr $C$DW$473, DW_AT_name("SelectCompAInput")
    7211                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("SelectCompAInput")
    7212                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    7213                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    7214                            .dwattr $C$DW$473, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7215                            .dwattr $C$DW$473, DW_AT_decl_line(0x85)
    7216                            .dwattr $C$DW$473, DW_AT_decl_column(0x25)
    7217                    
    7218                    $C$DW$474       .dwtag  DW_TAG_member
    7219                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$186)
    7220                            .dwattr $C$DW$474, DW_AT_name("SelectCompARef")
    7221                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("SelectCompARef")
    7222                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7223                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    7224                            .dwattr $C$DW$474, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7225                            .dwattr $C$DW$474, DW_AT_decl_line(0x86)
    7226                            .dwattr $C$DW$474, DW_AT_decl_column(0x25)
    7227                    
    7228                    $C$DW$475       .dwtag  DW_TAG_member
    7229                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$187)
    7230                            .dwattr $C$DW$475, DW_AT_name("SelectADCCompBInput")
    7231                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("SelectADCCompBInput")
    7232                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7233                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    7234                            .dwattr $C$DW$475, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7235                            .dwattr $C$DW$475, DW_AT_decl_line(0x87)
    7236                            .dwattr $C$DW$475, DW_AT_decl_column(0x25)
    7237                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  133

    7238                    $C$DW$476       .dwtag  DW_TAG_member
    7239                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$188)
    7240                            .dwattr $C$DW$476, DW_AT_name("SelectCompBRef")
    7241                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("SelectCompBRef")
    7242                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7243                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    7244                            .dwattr $C$DW$476, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7245                            .dwattr $C$DW$476, DW_AT_decl_line(0x88)
    7246                            .dwattr $C$DW$476, DW_AT_decl_column(0x25)
    7247                    
    7248                            .dwattr $C$DW$T$189, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    7249                            .dwattr $C$DW$T$189, DW_AT_decl_line(0x75)
    7250                            .dwattr $C$DW$T$189, DW_AT_decl_column(0x01)
    7251                            .dwendtag $C$DW$T$189
    7252                    
    7253                    $C$DW$T$727     .dwtag  DW_TAG_typedef
    7254                            .dwattr $C$DW$T$727, DW_AT_name("HARD_API_T")
    7255                            .dwattr $C$DW$T$727, DW_AT_type(*$C$DW$T$189)
    7256                            .dwattr $C$DW$T$727, DW_AT_language(DW_LANG_C)
    7257                            .dwattr $C$DW$T$727, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    7258                            .dwattr $C$DW$T$727, DW_AT_decl_line(0x89)
    7259                            .dwattr $C$DW$T$727, DW_AT_decl_column(0x03)
    7260                    
    7261                    
    7262                    $C$DW$T$190     .dwtag  DW_TAG_structure_type
    7263                            .dwattr $C$DW$T$190, DW_AT_byte_size(0x08)
    7264                    $C$DW$477       .dwtag  DW_TAG_member
    7265                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$10)
    7266                            .dwattr $C$DW$477, DW_AT_name("quot")
    7267                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("quot")
    7268                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7269                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    7270                            .dwattr $C$DW$477, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    7271                            .dwattr $C$DW$477, DW_AT_decl_line(0x49)
    7272                            .dwattr $C$DW$477, DW_AT_decl_column(0x16)
    7273                    
    7274                    $C$DW$478       .dwtag  DW_TAG_member
    7275                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$10)
    7276                            .dwattr $C$DW$478, DW_AT_name("rem")
    7277                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("rem")
    7278                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7279                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    7280                            .dwattr $C$DW$478, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    7281                            .dwattr $C$DW$478, DW_AT_decl_line(0x49)
    7282                            .dwattr $C$DW$478, DW_AT_decl_column(0x1c)
    7283                    
    7284                            .dwattr $C$DW$T$190, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    7285                            .dwattr $C$DW$T$190, DW_AT_decl_line(0x49)
    7286                            .dwattr $C$DW$T$190, DW_AT_decl_column(0x10)
    7287                            .dwendtag $C$DW$T$190
    7288                    
    7289                    $C$DW$T$728     .dwtag  DW_TAG_typedef
    7290                            .dwattr $C$DW$T$728, DW_AT_name("div_t")
    7291                            .dwattr $C$DW$T$728, DW_AT_type(*$C$DW$T$190)
    7292                            .dwattr $C$DW$T$728, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  134

    7293                            .dwattr $C$DW$T$728, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    7294                            .dwattr $C$DW$T$728, DW_AT_decl_line(0x49)
    7295                            .dwattr $C$DW$T$728, DW_AT_decl_column(0x23)
    7296                    
    7297                    
    7298                    $C$DW$T$191     .dwtag  DW_TAG_structure_type
    7299                            .dwattr $C$DW$T$191, DW_AT_byte_size(0x08)
    7300                    $C$DW$479       .dwtag  DW_TAG_member
    7301                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$10)
    7302                            .dwattr $C$DW$479, DW_AT_name("quot")
    7303                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("quot")
    7304                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7305                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    7306                            .dwattr $C$DW$479, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    7307                            .dwattr $C$DW$479, DW_AT_decl_line(0x4e)
    7308                            .dwattr $C$DW$479, DW_AT_decl_column(0x16)
    7309                    
    7310                    $C$DW$480       .dwtag  DW_TAG_member
    7311                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$10)
    7312                            .dwattr $C$DW$480, DW_AT_name("rem")
    7313                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("rem")
    7314                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7315                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    7316                            .dwattr $C$DW$480, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    7317                            .dwattr $C$DW$480, DW_AT_decl_line(0x4e)
    7318                            .dwattr $C$DW$480, DW_AT_decl_column(0x1c)
    7319                    
    7320                            .dwattr $C$DW$T$191, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    7321                            .dwattr $C$DW$T$191, DW_AT_decl_line(0x4e)
    7322                            .dwattr $C$DW$T$191, DW_AT_decl_column(0x10)
    7323                            .dwendtag $C$DW$T$191
    7324                    
    7325                    $C$DW$T$729     .dwtag  DW_TAG_typedef
    7326                            .dwattr $C$DW$T$729, DW_AT_name("ldiv_t")
    7327                            .dwattr $C$DW$T$729, DW_AT_type(*$C$DW$T$191)
    7328                            .dwattr $C$DW$T$729, DW_AT_language(DW_LANG_C)
    7329                            .dwattr $C$DW$T$729, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    7330                            .dwattr $C$DW$T$729, DW_AT_decl_line(0x4e)
    7331                            .dwattr $C$DW$T$729, DW_AT_decl_column(0x23)
    7332                    
    7333                    
    7334                    $C$DW$T$192     .dwtag  DW_TAG_structure_type
    7335                            .dwattr $C$DW$T$192, DW_AT_byte_size(0x10)
    7336                    $C$DW$481       .dwtag  DW_TAG_member
    7337                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$14)
    7338                            .dwattr $C$DW$481, DW_AT_name("quot")
    7339                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("quot")
    7340                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7341                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    7342                            .dwattr $C$DW$481, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    7343                            .dwattr $C$DW$481, DW_AT_decl_line(0x56)
    7344                            .dwattr $C$DW$481, DW_AT_decl_column(0x1c)
    7345                    
    7346                    $C$DW$482       .dwtag  DW_TAG_member
    7347                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$14)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  135

    7348                            .dwattr $C$DW$482, DW_AT_name("rem")
    7349                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("rem")
    7350                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7351                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    7352                            .dwattr $C$DW$482, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    7353                            .dwattr $C$DW$482, DW_AT_decl_line(0x56)
    7354                            .dwattr $C$DW$482, DW_AT_decl_column(0x22)
    7355                    
    7356                            .dwattr $C$DW$T$192, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    7357                            .dwattr $C$DW$T$192, DW_AT_decl_line(0x56)
    7358                            .dwattr $C$DW$T$192, DW_AT_decl_column(0x10)
    7359                            .dwendtag $C$DW$T$192
    7360                    
    7361                    $C$DW$T$730     .dwtag  DW_TAG_typedef
    7362                            .dwattr $C$DW$T$730, DW_AT_name("lldiv_t")
    7363                            .dwattr $C$DW$T$730, DW_AT_type(*$C$DW$T$192)
    7364                            .dwattr $C$DW$T$730, DW_AT_language(DW_LANG_C)
    7365                            .dwattr $C$DW$T$730, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    7366                            .dwattr $C$DW$T$730, DW_AT_decl_line(0x56)
    7367                            .dwattr $C$DW$T$730, DW_AT_decl_column(0x29)
    7368                    
    7369                    
    7370                    $C$DW$T$197     .dwtag  DW_TAG_structure_type
    7371                            .dwattr $C$DW$T$197, DW_AT_byte_size(0x08)
    7372                    $C$DW$483       .dwtag  DW_TAG_member
    7373                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$195)
    7374                            .dwattr $C$DW$483, DW_AT_name("pointerStack")
    7375                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("pointerStack")
    7376                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7377                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    7378                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7379                            .dwattr $C$DW$483, DW_AT_decl_line(0x3f5)
    7380                            .dwattr $C$DW$483, DW_AT_decl_column(0x16)
    7381                    
    7382                    $C$DW$484       .dwtag  DW_TAG_member
    7383                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$196)
    7384                            .dwattr $C$DW$484, DW_AT_name("directAPI")
    7385                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("directAPI")
    7386                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7387                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    7388                            .dwattr $C$DW$484, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7389                            .dwattr $C$DW$484, DW_AT_decl_line(0x3f6)
    7390                            .dwattr $C$DW$484, DW_AT_decl_column(0x15)
    7391                    
    7392                            .dwattr $C$DW$T$197, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7393                            .dwattr $C$DW$T$197, DW_AT_decl_line(0x3f4)
    7394                            .dwattr $C$DW$T$197, DW_AT_decl_column(0x01)
    7395                            .dwendtag $C$DW$T$197
    7396                    
    7397                    $C$DW$T$199     .dwtag  DW_TAG_typedef
    7398                            .dwattr $C$DW$T$199, DW_AT_name("icall_directAPIMsg_t")
    7399                            .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$197)
    7400                            .dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
    7401                            .dwattr $C$DW$T$199, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7402                            .dwattr $C$DW$T$199, DW_AT_decl_line(0x3f7)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  136

    7403                            .dwattr $C$DW$T$199, DW_AT_decl_column(0x03)
    7404                    
    7405                    
    7406                    $C$DW$T$200     .dwtag  DW_TAG_structure_type
    7407                            .dwattr $C$DW$T$200, DW_AT_byte_size(0x14)
    7408                    $C$DW$485       .dwtag  DW_TAG_member
    7409                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$198)
    7410                            .dwattr $C$DW$485, DW_AT_name("hdr")
    7411                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("hdr")
    7412                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7413                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    7414                            .dwattr $C$DW$485, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7415                            .dwattr $C$DW$485, DW_AT_decl_line(0x3fb)
    7416                            .dwattr $C$DW$485, DW_AT_decl_column(0x10)
    7417                    
    7418                    $C$DW$486       .dwtag  DW_TAG_member
    7419                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$199)
    7420                            .dwattr $C$DW$486, DW_AT_name("msg")
    7421                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("msg")
    7422                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7423                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    7424                            .dwattr $C$DW$486, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7425                            .dwattr $C$DW$486, DW_AT_decl_line(0x3fc)
    7426                            .dwattr $C$DW$486, DW_AT_decl_column(0x1a)
    7427                    
    7428                            .dwattr $C$DW$T$200, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7429                            .dwattr $C$DW$T$200, DW_AT_decl_line(0x3fa)
    7430                            .dwattr $C$DW$T$200, DW_AT_decl_column(0x01)
    7431                            .dwendtag $C$DW$T$200
    7432                    
    7433                    $C$DW$T$731     .dwtag  DW_TAG_typedef
    7434                            .dwattr $C$DW$T$731, DW_AT_name("icallLiteMsg_t")
    7435                            .dwattr $C$DW$T$731, DW_AT_type(*$C$DW$T$200)
    7436                            .dwattr $C$DW$T$731, DW_AT_language(DW_LANG_C)
    7437                            .dwattr $C$DW$T$731, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7438                            .dwattr $C$DW$T$731, DW_AT_decl_line(0x3fd)
    7439                            .dwattr $C$DW$T$731, DW_AT_decl_column(0x03)
    7440                    
    7441                    
    7442                    $C$DW$T$206     .dwtag  DW_TAG_union_type
    7443                            .dwattr $C$DW$T$206, DW_AT_byte_size(0x04)
    7444                    $C$DW$487       .dwtag  DW_TAG_member
    7445                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$201)
    7446                            .dwattr $C$DW$487, DW_AT_name("f")
    7447                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("f")
    7448                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7449                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    7450                            .dwattr $C$DW$487, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    7451                            .dwattr $C$DW$487, DW_AT_decl_line(0xb7)
    7452                            .dwattr $C$DW$487, DW_AT_decl_column(0x0f)
    7453                    
    7454                    $C$DW$488       .dwtag  DW_TAG_member
    7455                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$205)
    7456                            .dwattr $C$DW$488, DW_AT_name("a")
    7457                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("a")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  137

    7458                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7459                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    7460                            .dwattr $C$DW$488, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    7461                            .dwattr $C$DW$488, DW_AT_decl_line(0xb8)
    7462                            .dwattr $C$DW$488, DW_AT_decl_column(0x0f)
    7463                    
    7464                            .dwattr $C$DW$T$206, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    7465                            .dwattr $C$DW$T$206, DW_AT_decl_line(0xb6)
    7466                            .dwattr $C$DW$T$206, DW_AT_decl_column(0x0f)
    7467                            .dwendtag $C$DW$T$206
    7468                    
    7469                    $C$DW$T$732     .dwtag  DW_TAG_typedef
    7470                            .dwattr $C$DW$T$732, DW_AT_name("xdc_FloatData")
    7471                            .dwattr $C$DW$T$732, DW_AT_type(*$C$DW$T$206)
    7472                            .dwattr $C$DW$T$732, DW_AT_language(DW_LANG_C)
    7473                            .dwattr $C$DW$T$732, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    7474                            .dwattr $C$DW$T$732, DW_AT_decl_line(0xb9)
    7475                            .dwattr $C$DW$T$732, DW_AT_decl_column(0x03)
    7476                    
    7477                    
    7478                    $C$DW$T$213     .dwtag  DW_TAG_union_type
    7479                            .dwattr $C$DW$T$213, DW_AT_byte_size(0x02)
    7480                    $C$DW$489       .dwtag  DW_TAG_member
    7481                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$209)
    7482                            .dwattr $C$DW$489, DW_AT_name("entityId")
    7483                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("entityId")
    7484                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7485                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    7486                            .dwattr $C$DW$489, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7487                            .dwattr $C$DW$489, DW_AT_decl_line(0x1fe)
    7488                            .dwattr $C$DW$489, DW_AT_decl_column(0x14)
    7489                    
    7490                    $C$DW$490       .dwtag  DW_TAG_member
    7491                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$212)
    7492                            .dwattr $C$DW$490, DW_AT_name("servId")
    7493                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("servId")
    7494                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7495                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    7496                            .dwattr $C$DW$490, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7497                            .dwattr $C$DW$490, DW_AT_decl_line(0x200)
    7498                            .dwattr $C$DW$490, DW_AT_decl_column(0x17)
    7499                    
    7500                            .dwattr $C$DW$T$213, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7501                            .dwattr $C$DW$T$213, DW_AT_decl_line(0x1fc)
    7502                            .dwattr $C$DW$T$213, DW_AT_decl_column(0x03)
    7503                            .dwendtag $C$DW$T$213
    7504                    
    7505                    
    7506                    $C$DW$T$214     .dwtag  DW_TAG_union_type
    7507                            .dwattr $C$DW$T$214, DW_AT_byte_size(0x02)
    7508                    $C$DW$491       .dwtag  DW_TAG_member
    7509                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$212)
    7510                            .dwattr $C$DW$491, DW_AT_name("servId")
    7511                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("servId")
    7512                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  138

    7513                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    7514                            .dwattr $C$DW$491, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7515                            .dwattr $C$DW$491, DW_AT_decl_line(0x211)
    7516                            .dwattr $C$DW$491, DW_AT_decl_column(0x17)
    7517                    
    7518                    $C$DW$492       .dwtag  DW_TAG_member
    7519                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$209)
    7520                            .dwattr $C$DW$492, DW_AT_name("entityId")
    7521                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("entityId")
    7522                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7523                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    7524                            .dwattr $C$DW$492, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7525                            .dwattr $C$DW$492, DW_AT_decl_line(0x213)
    7526                            .dwattr $C$DW$492, DW_AT_decl_column(0x14)
    7527                    
    7528                            .dwattr $C$DW$T$214, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7529                            .dwattr $C$DW$T$214, DW_AT_decl_line(0x20f)
    7530                            .dwattr $C$DW$T$214, DW_AT_decl_column(0x03)
    7531                            .dwendtag $C$DW$T$214
    7532                    
    7533                    
    7534                    $C$DW$T$217     .dwtag  DW_TAG_structure_type
    7535                            .dwattr $C$DW$T$217, DW_AT_name(".ggroup1")
    7536                            .dwattr $C$DW$T$217, DW_AT_byte_size(0x0c)
    7537                    $C$DW$493       .dwtag  DW_TAG_member
    7538                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$215)
    7539                            .dwattr $C$DW$493, DW_AT_name("nvBegPage")
    7540                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("nvBegPage")
    7541                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7542                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    7543                    
    7544                    $C$DW$494       .dwtag  DW_TAG_member
    7545                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$215)
    7546                            .dwattr $C$DW$494, DW_AT_name("nvEndPage")
    7547                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("nvEndPage")
    7548                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7549                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    7550                    
    7551                    $C$DW$495       .dwtag  DW_TAG_member
    7552                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$6)
    7553                            .dwattr $C$DW$495, DW_AT_name("activePg")
    7554                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("activePg")
    7555                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7556                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    7557                    
    7558                    $C$DW$496       .dwtag  DW_TAG_member
    7559                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$6)
    7560                            .dwattr $C$DW$496, DW_AT_name("pgCycle")
    7561                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("pgCycle")
    7562                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7563                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    7564                    
    7565                    $C$DW$497       .dwtag  DW_TAG_member
    7566                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$6)
    7567                            .dwattr $C$DW$497, DW_AT_name("failF")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  139

    7568                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("failF")
    7569                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7570                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    7571                    
    7572                    $C$DW$498       .dwtag  DW_TAG_member
    7573                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$6)
    7574                            .dwattr $C$DW$498, DW_AT_name("failW")
    7575                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("failW")
    7576                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7577                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    7578                    
    7579                    $C$DW$499       .dwtag  DW_TAG_member
    7580                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$9)
    7581                            .dwattr $C$DW$499, DW_AT_name("pgOff")
    7582                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("pgOff")
    7583                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7584                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    7585                    
    7586                    $C$DW$500       .dwtag  DW_TAG_member
    7587                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$216)
    7588                            .dwattr $C$DW$500, DW_AT_name("nvMutex")
    7589                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("nvMutex")
    7590                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7591                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    7592                    
    7593                            .dwendtag $C$DW$T$217
    7594                    
    7595                    
    7596                    $C$DW$T$218     .dwtag  DW_TAG_structure_type
    7597                            .dwattr $C$DW$T$218, DW_AT_name("S10_20")
    7598                            .dwattr $C$DW$T$218, DW_AT_declaration
    7599                            .dwendtag $C$DW$T$218
    7600                    
    7601                    
    7602                    $C$DW$T$219     .dwtag  DW_TAG_structure_type
    7603                            .dwattr $C$DW$T$219, DW_AT_name("S11_22")
    7604                            .dwattr $C$DW$T$219, DW_AT_declaration
    7605                            .dwendtag $C$DW$T$219
    7606                    
    7607                    
    7608                    $C$DW$T$220     .dwtag  DW_TAG_structure_type
    7609                            .dwattr $C$DW$T$220, DW_AT_name("S12_24")
    7610                            .dwattr $C$DW$T$220, DW_AT_declaration
    7611                            .dwendtag $C$DW$T$220
    7612                    
    7613                    
    7614                    $C$DW$T$221     .dwtag  DW_TAG_structure_type
    7615                            .dwattr $C$DW$T$221, DW_AT_name("S13_26")
    7616                            .dwattr $C$DW$T$221, DW_AT_declaration
    7617                            .dwendtag $C$DW$T$221
    7618                    
    7619                    
    7620                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7621                            .dwattr $C$DW$T$19, DW_AT_name("S14_28")
    7622                            .dwattr $C$DW$T$19, DW_AT_declaration
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  140

    7623                            .dwendtag $C$DW$T$19
    7624                    
    7625                    
    7626                    $C$DW$T$222     .dwtag  DW_TAG_structure_type
    7627                            .dwattr $C$DW$T$222, DW_AT_name("S3_1")
    7628                            .dwattr $C$DW$T$222, DW_AT_declaration
    7629                            .dwendtag $C$DW$T$222
    7630                    
    7631                    
    7632                    $C$DW$T$223     .dwtag  DW_TAG_structure_type
    7633                            .dwattr $C$DW$T$223, DW_AT_name("S3_1")
    7634                            .dwattr $C$DW$T$223, DW_AT_declaration
    7635                            .dwendtag $C$DW$T$223
    7636                    
    7637                    
    7638                    $C$DW$T$224     .dwtag  DW_TAG_structure_type
    7639                            .dwattr $C$DW$T$224, DW_AT_name("S3_5")
    7640                            .dwattr $C$DW$T$224, DW_AT_declaration
    7641                            .dwendtag $C$DW$T$224
    7642                    
    7643                    
    7644                    $C$DW$T$225     .dwtag  DW_TAG_structure_type
    7645                            .dwattr $C$DW$T$225, DW_AT_name("S4_3")
    7646                            .dwattr $C$DW$T$225, DW_AT_declaration
    7647                            .dwendtag $C$DW$T$225
    7648                    
    7649                    
    7650                    $C$DW$T$226     .dwtag  DW_TAG_structure_type
    7651                            .dwattr $C$DW$T$226, DW_AT_name("S4_3")
    7652                            .dwattr $C$DW$T$226, DW_AT_declaration
    7653                            .dwendtag $C$DW$T$226
    7654                    
    7655                    
    7656                    $C$DW$T$227     .dwtag  DW_TAG_structure_type
    7657                            .dwattr $C$DW$T$227, DW_AT_name("S4_7")
    7658                            .dwattr $C$DW$T$227, DW_AT_declaration
    7659                            .dwendtag $C$DW$T$227
    7660                    
    7661                    
    7662                    $C$DW$T$228     .dwtag  DW_TAG_structure_type
    7663                            .dwattr $C$DW$T$228, DW_AT_name("S5_6")
    7664                            .dwattr $C$DW$T$228, DW_AT_declaration
    7665                            .dwendtag $C$DW$T$228
    7666                    
    7667                    
    7668                    $C$DW$T$229     .dwtag  DW_TAG_structure_type
    7669                            .dwattr $C$DW$T$229, DW_AT_name("S5_8")
    7670                            .dwattr $C$DW$T$229, DW_AT_declaration
    7671                            .dwendtag $C$DW$T$229
    7672                    
    7673                    
    7674                    $C$DW$T$230     .dwtag  DW_TAG_structure_type
    7675                            .dwattr $C$DW$T$230, DW_AT_name("S5_9")
    7676                            .dwattr $C$DW$T$230, DW_AT_declaration
    7677                            .dwendtag $C$DW$T$230
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:38 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{907B7668-F052-412B-9FE7-D0AE8FCE3C70} PAGE  141

    7678                    
    7679                    
    7680                    $C$DW$T$231     .dwtag  DW_TAG_structure_type
    7681                            .dwattr $C$DW$T$231, DW_AT_name("S6_10")
    7682                            .dwattr $C$DW$T$231, DW_AT_declaration
    7683                            .dwendtag $C$DW$T$231
    7684                    
    7685                    
    7686                    $C$DW$T$232     .dwtag  DW_TAG_structure_type
    7687                            .dwattr $C$DW$T$232, DW_AT_name("S6_11")
    7688                            .dwattr $C$DW$T$232, DW_AT_declaration
    7689                            .dwendtag $C$DW$T$232
    7690                    
    7691                    
    7692                    $C$DW$T$233     .dwtag  DW_TAG_structure_type
    7693                            .dwattr $C$DW$T$233, DW_AT_name("S7_13")
    7694                            .dwattr $C$DW$T$233, DW_AT_declaration
    7695                            .dwendtag $C$DW$T$233
    7696                    
    7697                    
    7698                    $C$DW$T$234     .dwtag  DW_TAG_structure_type
    7699                            .dwattr $C$DW$T$234, DW_AT_name("S8_15")
    7700                            .dwattr $C$DW$T$234, DW_AT_declaration
    7701                            .dwendtag $C$DW$T$234
    7702                    
    7703                    
    7704                    $C$DW$T$235     .dwtag  DW_TAG_structure_type
    7705                            .dwattr $C$DW$T$235, DW_AT_name("S9_18")
    7706                            .dwattr $C$DW$T$235, DW_AT_declaration
    7707                            .dwendtag $C$DW$T$235
    7708                    
    7709                    
