TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Nov 28 13:22:10 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/api_mac.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Adrian\workspace_v8\collector_cc1350lp\collector_cc
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

   11183                            .dwattr $C$DW$840, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11184                            .dwattr $C$DW$840, DW_AT_decl_line(0x5e)
   11185                            .dwattr $C$DW$840, DW_AT_decl_column(0x03)
   11186                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  205

   11187                    $C$DW$841       .dwtag  DW_TAG_enumerator
   11188                            .dwattr $C$DW$841, DW_AT_name("MAC_FH_GET_REQ")
   11189                            .dwattr $C$DW$841, DW_AT_const_value(0xf5)
   11190                            .dwattr $C$DW$841, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11191                            .dwattr $C$DW$841, DW_AT_decl_line(0x5f)
   11192                            .dwattr $C$DW$841, DW_AT_decl_column(0x03)
   11193                    
   11194                    $C$DW$842       .dwtag  DW_TAG_enumerator
   11195                            .dwattr $C$DW$842, DW_AT_name("MAC_MLME_WS_ASYNC_REQ")
   11196                            .dwattr $C$DW$842, DW_AT_const_value(0xf6)
   11197                            .dwattr $C$DW$842, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11198                            .dwattr $C$DW$842, DW_AT_decl_line(0x60)
   11199                            .dwattr $C$DW$842, DW_AT_decl_column(0x03)
   11200                    
   11201                    $C$DW$843       .dwtag  DW_TAG_enumerator
   11202                            .dwattr $C$DW$843, DW_AT_name("MAC_SEC_ADD_DEVICE")
   11203                            .dwattr $C$DW$843, DW_AT_const_value(0xf7)
   11204                            .dwattr $C$DW$843, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11205                            .dwattr $C$DW$843, DW_AT_decl_line(0x61)
   11206                            .dwattr $C$DW$843, DW_AT_decl_column(0x03)
   11207                    
   11208                    $C$DW$844       .dwtag  DW_TAG_enumerator
   11209                            .dwattr $C$DW$844, DW_AT_name("MAC_SEC_DEL_DEVICE")
   11210                            .dwattr $C$DW$844, DW_AT_const_value(0xf8)
   11211                            .dwattr $C$DW$844, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11212                            .dwattr $C$DW$844, DW_AT_decl_line(0x62)
   11213                            .dwattr $C$DW$844, DW_AT_decl_column(0x03)
   11214                    
   11215                    $C$DW$845       .dwtag  DW_TAG_enumerator
   11216                            .dwattr $C$DW$845, DW_AT_name("MAC_SEC_DEL_KEY_AND_DEVICES")
   11217                            .dwattr $C$DW$845, DW_AT_const_value(0xf9)
   11218                            .dwattr $C$DW$845, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11219                            .dwattr $C$DW$845, DW_AT_decl_line(0x63)
   11220                            .dwattr $C$DW$845, DW_AT_decl_column(0x03)
   11221                    
   11222                    $C$DW$846       .dwtag  DW_TAG_enumerator
   11223                            .dwattr $C$DW$846, DW_AT_name("MAC_SEC_DEL_ALL_DEVICES")
   11224                            .dwattr $C$DW$846, DW_AT_const_value(0xfa)
   11225                            .dwattr $C$DW$846, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11226                            .dwattr $C$DW$846, DW_AT_decl_line(0x64)
   11227                            .dwattr $C$DW$846, DW_AT_decl_column(0x03)
   11228                    
   11229                    $C$DW$847       .dwtag  DW_TAG_enumerator
   11230                            .dwattr $C$DW$847, DW_AT_name("MAC_SEC_GET_DEFAULT_SOURCE_KEY")
   11231                            .dwattr $C$DW$847, DW_AT_const_value(0xfb)
   11232                            .dwattr $C$DW$847, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11233                            .dwattr $C$DW$847, DW_AT_decl_line(0x65)
   11234                            .dwattr $C$DW$847, DW_AT_decl_column(0x03)
   11235                    
   11236                    $C$DW$848       .dwtag  DW_TAG_enumerator
   11237                            .dwattr $C$DW$848, DW_AT_name("MAC_SEC_ADD_KEY_INIT_FC")
   11238                            .dwattr $C$DW$848, DW_AT_const_value(0xfc)
   11239                            .dwattr $C$DW$848, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11240                            .dwattr $C$DW$848, DW_AT_decl_line(0x66)
   11241                            .dwattr $C$DW$848, DW_AT_decl_column(0x03)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  206

   11242                    
   11243                            .dwattr $C$DW$T$795, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   11244                            .dwattr $C$DW$T$795, DW_AT_decl_line(0x39)
   11245                            .dwattr $C$DW$T$795, DW_AT_decl_column(0x01)
   11246                            .dwendtag $C$DW$T$795
   11247                    
   11248                    
   11249                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
   11250                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
   11251                    $C$DW$849       .dwtag  DW_TAG_member
   11252                            .dwattr $C$DW$849, DW_AT_type(*$C$DW$T$193)
   11253                            .dwattr $C$DW$849, DW_AT_name("addr")
   11254                            .dwattr $C$DW$849, DW_AT_TI_symbol_name("addr")
   11255                            .dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11256                            .dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
   11257                            .dwattr $C$DW$849, DW_AT_decl_file("..\Application\api_mac.h")
   11258                            .dwattr $C$DW$849, DW_AT_decl_line(0x4db)
   11259                            .dwattr $C$DW$849, DW_AT_decl_column(0x07)
   11260                    
   11261                    $C$DW$850       .dwtag  DW_TAG_member
   11262                            .dwattr $C$DW$850, DW_AT_type(*$C$DW$T$22)
   11263                            .dwattr $C$DW$850, DW_AT_name("addrMode")
   11264                            .dwattr $C$DW$850, DW_AT_TI_symbol_name("addrMode")
   11265                            .dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11266                            .dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
   11267                            .dwattr $C$DW$850, DW_AT_decl_file("..\Application\api_mac.h")
   11268                            .dwattr $C$DW$850, DW_AT_decl_line(0x4de)
   11269                            .dwattr $C$DW$850, DW_AT_decl_column(0x17)
   11270                    
   11271                            .dwattr $C$DW$T$23, DW_AT_decl_file("..\Application\api_mac.h")
   11272                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x4d0)
   11273                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
   11274                            .dwendtag $C$DW$T$23
   11275                    
   11276                    $C$DW$T$450     .dwtag  DW_TAG_typedef
   11277                            .dwattr $C$DW$T$450, DW_AT_name("ApiMac_sAddr_t")
   11278                            .dwattr $C$DW$T$450, DW_AT_type(*$C$DW$T$23)
   11279                            .dwattr $C$DW$T$450, DW_AT_language(DW_LANG_C)
   11280                            .dwattr $C$DW$T$450, DW_AT_decl_file("..\Application\api_mac.h")
   11281                            .dwattr $C$DW$T$450, DW_AT_decl_line(0x4df)
   11282                            .dwattr $C$DW$T$450, DW_AT_decl_column(0x03)
   11283                    
   11284                    $C$DW$T$796     .dwtag  DW_TAG_pointer_type
   11285                            .dwattr $C$DW$T$796, DW_AT_type(*$C$DW$T$450)
   11286                            .dwattr $C$DW$T$796, DW_AT_address_class(0x20)
   11287                    
   11288                    $C$DW$T$797     .dwtag  DW_TAG_const_type
   11289                            .dwattr $C$DW$T$797, DW_AT_type(*$C$DW$T$796)
   11290                    
   11291                    
   11292                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
   11293                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x40)
   11294                    $C$DW$851       .dwtag  DW_TAG_member
   11295                            .dwattr $C$DW$851, DW_AT_type(*$C$DW$T$25)
   11296                            .dwattr $C$DW$851, DW_AT_name("beaconType")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  207

   11297                            .dwattr $C$DW$851, DW_AT_TI_symbol_name("beaconType")
   11298                            .dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11299                            .dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
   11300                            .dwattr $C$DW$851, DW_AT_decl_file("..\Application\api_mac.h")
   11301                            .dwattr $C$DW$851, DW_AT_decl_line(0x886)
   11302                            .dwattr $C$DW$851, DW_AT_decl_column(0x19)
   11303                    
   11304                    $C$DW$852       .dwtag  DW_TAG_member
   11305                            .dwattr $C$DW$852, DW_AT_type(*$C$DW$T$27)
   11306                            .dwattr $C$DW$852, DW_AT_name("bsn")
   11307                            .dwattr $C$DW$852, DW_AT_TI_symbol_name("bsn")
   11308                            .dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11309                            .dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
   11310                            .dwattr $C$DW$852, DW_AT_decl_file("..\Application\api_mac.h")
   11311                            .dwattr $C$DW$852, DW_AT_decl_line(0x888)
   11312                            .dwattr $C$DW$852, DW_AT_decl_column(0x0d)
   11313                    
   11314                    $C$DW$853       .dwtag  DW_TAG_member
   11315                            .dwattr $C$DW$853, DW_AT_type(*$C$DW$T$28)
   11316                            .dwattr $C$DW$853, DW_AT_name("panDesc")
   11317                            .dwattr $C$DW$853, DW_AT_TI_symbol_name("panDesc")
   11318                            .dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11319                            .dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
   11320                            .dwattr $C$DW$853, DW_AT_decl_file("..\Application\api_mac.h")
   11321                            .dwattr $C$DW$853, DW_AT_decl_line(0x88a)
   11322                            .dwattr $C$DW$853, DW_AT_decl_column(0x16)
   11323                    
   11324                    $C$DW$854       .dwtag  DW_TAG_member
   11325                            .dwattr $C$DW$854, DW_AT_type(*$C$DW$T$196)
   11326                            .dwattr $C$DW$854, DW_AT_name("beaconData")
   11327                            .dwattr $C$DW$854, DW_AT_TI_symbol_name("beaconData")
   11328                            .dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   11329                            .dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
   11330                            .dwattr $C$DW$854, DW_AT_decl_file("..\Application\api_mac.h")
   11331                            .dwattr $C$DW$854, DW_AT_decl_line(0x895)
   11332                            .dwattr $C$DW$854, DW_AT_decl_column(0x07)
   11333                    
   11334                            .dwattr $C$DW$T$29, DW_AT_decl_file("..\Application\api_mac.h")
   11335                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x884)
   11336                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
   11337                            .dwendtag $C$DW$T$29
   11338                    
   11339                    $C$DW$T$364     .dwtag  DW_TAG_typedef
   11340                            .dwattr $C$DW$T$364, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
   11341                            .dwattr $C$DW$T$364, DW_AT_type(*$C$DW$T$29)
   11342                            .dwattr $C$DW$T$364, DW_AT_language(DW_LANG_C)
   11343                            .dwattr $C$DW$T$364, DW_AT_decl_file("..\Application\api_mac.h")
   11344                            .dwattr $C$DW$T$364, DW_AT_decl_line(0x896)
   11345                            .dwattr $C$DW$T$364, DW_AT_decl_column(0x03)
   11346                    
   11347                    $C$DW$T$365     .dwtag  DW_TAG_pointer_type
   11348                            .dwattr $C$DW$T$365, DW_AT_type(*$C$DW$T$364)
   11349                            .dwattr $C$DW$T$365, DW_AT_address_class(0x20)
   11350                    
   11351                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  208

   11352                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
   11353                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
   11354                    $C$DW$855       .dwtag  DW_TAG_member
   11355                            .dwattr $C$DW$855, DW_AT_type(*$C$DW$T$30)
   11356                            .dwattr $C$DW$855, DW_AT_name("event")
   11357                            .dwattr $C$DW$855, DW_AT_TI_symbol_name("event")
   11358                            .dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11359                            .dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
   11360                            .dwattr $C$DW$855, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11361                            .dwattr $C$DW$855, DW_AT_decl_line(0x2b6)
   11362                            .dwattr $C$DW$855, DW_AT_decl_column(0x0b)
   11363                    
   11364                    $C$DW$856       .dwtag  DW_TAG_member
   11365                            .dwattr $C$DW$856, DW_AT_type(*$C$DW$T$30)
   11366                            .dwattr $C$DW$856, DW_AT_name("status")
   11367                            .dwattr $C$DW$856, DW_AT_TI_symbol_name("status")
   11368                            .dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11369                            .dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
   11370                            .dwattr $C$DW$856, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11371                            .dwattr $C$DW$856, DW_AT_decl_line(0x2b7)
   11372                            .dwattr $C$DW$856, DW_AT_decl_column(0x0b)
   11373                    
   11374                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11375                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x2b5)
   11376                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
   11377                            .dwendtag $C$DW$T$31
   11378                    
   11379                    $C$DW$T$32      .dwtag  DW_TAG_typedef
   11380                            .dwattr $C$DW$T$32, DW_AT_name("macEventHdr_t")
   11381                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
   11382                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
   11383                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11384                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x2b8)
   11385                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
   11386                    
   11387                    $C$DW$T$802     .dwtag  DW_TAG_pointer_type
   11388                            .dwattr $C$DW$T$802, DW_AT_type(*$C$DW$T$32)
   11389                            .dwattr $C$DW$T$802, DW_AT_address_class(0x20)
   11390                    
   11391                    
   11392                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
   11393                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x16)
   11394                    $C$DW$857       .dwtag  DW_TAG_member
   11395                            .dwattr $C$DW$857, DW_AT_type(*$C$DW$T$32)
   11396                            .dwattr $C$DW$857, DW_AT_name("hdr")
   11397                            .dwattr $C$DW$857, DW_AT_TI_symbol_name("hdr")
   11398                            .dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11399                            .dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
   11400                            .dwattr $C$DW$857, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11401                            .dwattr $C$DW$857, DW_AT_decl_line(0x480)
   11402                            .dwattr $C$DW$857, DW_AT_decl_column(0x17)
   11403                    
   11404                    $C$DW$858       .dwtag  DW_TAG_member
   11405                            .dwattr $C$DW$858, DW_AT_type(*$C$DW$T$34)
   11406                            .dwattr $C$DW$858, DW_AT_name("deviceAddress")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  209

   11407                            .dwattr $C$DW$858, DW_AT_TI_symbol_name("deviceAddress")
   11408                            .dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11409                            .dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
   11410                            .dwattr $C$DW$858, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11411                            .dwattr $C$DW$858, DW_AT_decl_line(0x481)
   11412                            .dwattr $C$DW$858, DW_AT_decl_column(0x17)
   11413                    
   11414                    $C$DW$859       .dwtag  DW_TAG_member
   11415                            .dwattr $C$DW$859, DW_AT_type(*$C$DW$T$30)
   11416                            .dwattr $C$DW$859, DW_AT_name("capabilityInformation")
   11417                            .dwattr $C$DW$859, DW_AT_TI_symbol_name("capabilityInformation")
   11418                            .dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11419                            .dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
   11420                            .dwattr $C$DW$859, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11421                            .dwattr $C$DW$859, DW_AT_decl_line(0x482)
   11422                            .dwattr $C$DW$859, DW_AT_decl_column(0x17)
   11423                    
   11424                    $C$DW$860       .dwtag  DW_TAG_member
   11425                            .dwattr $C$DW$860, DW_AT_type(*$C$DW$T$35)
   11426                            .dwattr $C$DW$860, DW_AT_name("sec")
   11427                            .dwattr $C$DW$860, DW_AT_TI_symbol_name("sec")
   11428                            .dwattr $C$DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   11429                            .dwattr $C$DW$860, DW_AT_accessibility(DW_ACCESS_public)
   11430                            .dwattr $C$DW$860, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11431                            .dwattr $C$DW$860, DW_AT_decl_line(0x483)
   11432                            .dwattr $C$DW$860, DW_AT_decl_column(0x17)
   11433                    
   11434                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11435                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x47f)
   11436                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
   11437                            .dwendtag $C$DW$T$36
   11438                    
   11439                    $C$DW$T$208     .dwtag  DW_TAG_typedef
   11440                            .dwattr $C$DW$T$208, DW_AT_name("macMlmeAssociateInd_t")
   11441                            .dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$36)
   11442                            .dwattr $C$DW$T$208, DW_AT_language(DW_LANG_C)
   11443                            .dwattr $C$DW$T$208, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   11444                            .dwattr $C$DW$T$208, DW_AT_decl_line(0x484)
   11445                            .dwattr $C$DW$T$208, DW_AT_decl_column(0x03)
   11446                    
   11447                    
   11448                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
   11449                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x10)
   11450                    $C$DW$861       .dwtag  DW_TAG_member
   11451                            .dwattr $C$DW$861, DW_AT_type(*$C$DW$T$32)
   11452                            .dwattr $C$DW$861, DW_AT_name("hdr")
   11453                            .dwattr $C$DW$861, DW_AT_TI_symbol_name("hdr")
   11454                            .dwattr $C$DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11455                            .dwattr $C$DW$861, DW_AT_accessibility(DW_ACCESS_public)
   11456                            .dwattr $C$DW$861, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11457                            .dwattr $C$DW$861, DW_AT_decl_line(0x489)
   11458                            .dwattr $C$DW$861, DW_AT_decl_column(0x17)
   11459                    
   11460                    $C$DW$862       .dwtag  DW_TAG_member
   11461                            .dwattr $C$DW$862, DW_AT_type(*$C$DW$T$37)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  210

   11462                            .dwattr $C$DW$862, DW_AT_name("assocShortAddress")
   11463                            .dwattr $C$DW$862, DW_AT_TI_symbol_name("assocShortAddress")
   11464                            .dwattr $C$DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11465                            .dwattr $C$DW$862, DW_AT_accessibility(DW_ACCESS_public)
   11466                            .dwattr $C$DW$862, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11467                            .dwattr $C$DW$862, DW_AT_decl_line(0x48a)
   11468                            .dwattr $C$DW$862, DW_AT_decl_column(0x17)
   11469                    
   11470                    $C$DW$863       .dwtag  DW_TAG_member
   11471                            .dwattr $C$DW$863, DW_AT_type(*$C$DW$T$35)
   11472                            .dwattr $C$DW$863, DW_AT_name("sec")
   11473                            .dwattr $C$DW$863, DW_AT_TI_symbol_name("sec")
   11474                            .dwattr $C$DW$863, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11475                            .dwattr $C$DW$863, DW_AT_accessibility(DW_ACCESS_public)
   11476                            .dwattr $C$DW$863, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11477                            .dwattr $C$DW$863, DW_AT_decl_line(0x48b)
   11478                            .dwattr $C$DW$863, DW_AT_decl_column(0x17)
   11479                    
   11480                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11481                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x488)
   11482                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
   11483                            .dwendtag $C$DW$T$38
   11484                    
   11485                    $C$DW$T$209     .dwtag  DW_TAG_typedef
   11486                            .dwattr $C$DW$T$209, DW_AT_name("macMlmeAssociateCnf_t")
   11487                            .dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$38)
   11488                            .dwattr $C$DW$T$209, DW_AT_language(DW_LANG_C)
   11489                            .dwattr $C$DW$T$209, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   11490                            .dwattr $C$DW$T$209, DW_AT_decl_line(0x48c)
   11491                            .dwattr $C$DW$T$209, DW_AT_decl_column(0x03)
   11492                    
   11493                    
   11494                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
   11495                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x16)
   11496                    $C$DW$864       .dwtag  DW_TAG_member
   11497                            .dwattr $C$DW$864, DW_AT_type(*$C$DW$T$32)
   11498                            .dwattr $C$DW$864, DW_AT_name("hdr")
   11499                            .dwattr $C$DW$864, DW_AT_TI_symbol_name("hdr")
   11500                            .dwattr $C$DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11501                            .dwattr $C$DW$864, DW_AT_accessibility(DW_ACCESS_public)
   11502                            .dwattr $C$DW$864, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11503                            .dwattr $C$DW$864, DW_AT_decl_line(0x491)
   11504                            .dwattr $C$DW$864, DW_AT_decl_column(0x17)
   11505                    
   11506                    $C$DW$865       .dwtag  DW_TAG_member
   11507                            .dwattr $C$DW$865, DW_AT_type(*$C$DW$T$34)
   11508                            .dwattr $C$DW$865, DW_AT_name("deviceAddress")
   11509                            .dwattr $C$DW$865, DW_AT_TI_symbol_name("deviceAddress")
   11510                            .dwattr $C$DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11511                            .dwattr $C$DW$865, DW_AT_accessibility(DW_ACCESS_public)
   11512                            .dwattr $C$DW$865, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11513                            .dwattr $C$DW$865, DW_AT_decl_line(0x492)
   11514                            .dwattr $C$DW$865, DW_AT_decl_column(0x17)
   11515                    
   11516                    $C$DW$866       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  211

   11517                            .dwattr $C$DW$866, DW_AT_type(*$C$DW$T$30)
   11518                            .dwattr $C$DW$866, DW_AT_name("disassociateReason")
   11519                            .dwattr $C$DW$866, DW_AT_TI_symbol_name("disassociateReason")
   11520                            .dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11521                            .dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
   11522                            .dwattr $C$DW$866, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11523                            .dwattr $C$DW$866, DW_AT_decl_line(0x493)
   11524                            .dwattr $C$DW$866, DW_AT_decl_column(0x17)
   11525                    
   11526                    $C$DW$867       .dwtag  DW_TAG_member
   11527                            .dwattr $C$DW$867, DW_AT_type(*$C$DW$T$35)
   11528                            .dwattr $C$DW$867, DW_AT_name("sec")
   11529                            .dwattr $C$DW$867, DW_AT_TI_symbol_name("sec")
   11530                            .dwattr $C$DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   11531                            .dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
   11532                            .dwattr $C$DW$867, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11533                            .dwattr $C$DW$867, DW_AT_decl_line(0x494)
   11534                            .dwattr $C$DW$867, DW_AT_decl_column(0x17)
   11535                    
   11536                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11537                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x490)
   11538                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
   11539                            .dwendtag $C$DW$T$39
   11540                    
   11541                    $C$DW$T$210     .dwtag  DW_TAG_typedef
   11542                            .dwattr $C$DW$T$210, DW_AT_name("macMlmeDisassociateInd_t")
   11543                            .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$39)
   11544                            .dwattr $C$DW$T$210, DW_AT_language(DW_LANG_C)
   11545                            .dwattr $C$DW$T$210, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   11546                            .dwattr $C$DW$T$210, DW_AT_decl_line(0x495)
   11547                            .dwattr $C$DW$T$210, DW_AT_decl_column(0x03)
   11548                    
   11549                    
   11550                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
   11551                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
   11552                    $C$DW$868       .dwtag  DW_TAG_member
   11553                            .dwattr $C$DW$868, DW_AT_type(*$C$DW$T$200)
   11554                            .dwattr $C$DW$868, DW_AT_name("addr")
   11555                            .dwattr $C$DW$868, DW_AT_TI_symbol_name("addr")
   11556                            .dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11557                            .dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
   11558                            .dwattr $C$DW$868, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
   11559                            .dwattr $C$DW$868, DW_AT_decl_line(0x55)
   11560                            .dwattr $C$DW$868, DW_AT_decl_column(0x05)
   11561                    
   11562                    $C$DW$869       .dwtag  DW_TAG_member
   11563                            .dwattr $C$DW$869, DW_AT_type(*$C$DW$T$27)
   11564                            .dwattr $C$DW$869, DW_AT_name("addrMode")
   11565                            .dwattr $C$DW$869, DW_AT_TI_symbol_name("addrMode")
   11566                            .dwattr $C$DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11567                            .dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
   11568                            .dwattr $C$DW$869, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
   11569                            .dwattr $C$DW$869, DW_AT_decl_line(0x56)
   11570                            .dwattr $C$DW$869, DW_AT_decl_column(0x13)
   11571                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  212

   11572                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicati
   11573                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x50)
   11574                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
   11575                            .dwendtag $C$DW$T$40
   11576                    
   11577                    $C$DW$T$41      .dwtag  DW_TAG_typedef
   11578                            .dwattr $C$DW$T$41, DW_AT_name("sAddr_t")
   11579                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
   11580                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
   11581                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicati
   11582                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x57)
   11583                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
   11584                    
   11585                    $C$DW$T$150     .dwtag  DW_TAG_pointer_type
   11586                            .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$41)
   11587                            .dwattr $C$DW$T$150, DW_AT_address_class(0x20)
   11588                    
   11589                    $C$DW$T$805     .dwtag  DW_TAG_const_type
   11590                            .dwattr $C$DW$T$805, DW_AT_type(*$C$DW$T$150)
   11591                    
   11592                    
   11593                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
   11594                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x0e)
   11595                    $C$DW$870       .dwtag  DW_TAG_member
   11596                            .dwattr $C$DW$870, DW_AT_type(*$C$DW$T$32)
   11597                            .dwattr $C$DW$870, DW_AT_name("hdr")
   11598                            .dwattr $C$DW$870, DW_AT_TI_symbol_name("hdr")
   11599                            .dwattr $C$DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11600                            .dwattr $C$DW$870, DW_AT_accessibility(DW_ACCESS_public)
   11601                            .dwattr $C$DW$870, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11602                            .dwattr $C$DW$870, DW_AT_decl_line(0x49a)
   11603                            .dwattr $C$DW$870, DW_AT_decl_column(0x13)
   11604                    
   11605                    $C$DW$871       .dwtag  DW_TAG_member
   11606                            .dwattr $C$DW$871, DW_AT_type(*$C$DW$T$41)
   11607                            .dwattr $C$DW$871, DW_AT_name("deviceAddress")
   11608                            .dwattr $C$DW$871, DW_AT_TI_symbol_name("deviceAddress")
   11609                            .dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11610                            .dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
   11611                            .dwattr $C$DW$871, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11612                            .dwattr $C$DW$871, DW_AT_decl_line(0x49b)
   11613                            .dwattr $C$DW$871, DW_AT_decl_column(0x13)
   11614                    
   11615                    $C$DW$872       .dwtag  DW_TAG_member
   11616                            .dwattr $C$DW$872, DW_AT_type(*$C$DW$T$37)
   11617                            .dwattr $C$DW$872, DW_AT_name("panId")
   11618                            .dwattr $C$DW$872, DW_AT_TI_symbol_name("panId")
   11619                            .dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11620                            .dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
   11621                            .dwattr $C$DW$872, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11622                            .dwattr $C$DW$872, DW_AT_decl_line(0x49d)
   11623                            .dwattr $C$DW$872, DW_AT_decl_column(0x13)
   11624                    
   11625                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11626                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x499)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  213

   11627                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
   11628                            .dwendtag $C$DW$T$42
   11629                    
   11630                    $C$DW$T$211     .dwtag  DW_TAG_typedef
   11631                            .dwattr $C$DW$T$211, DW_AT_name("macMlmeDisassociateCnf_t")
   11632                            .dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$42)
   11633                            .dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
   11634                            .dwattr $C$DW$T$211, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   11635                            .dwattr $C$DW$T$211, DW_AT_decl_line(0x49f)
   11636                            .dwattr $C$DW$T$211, DW_AT_decl_column(0x03)
   11637                    
   11638                    
   11639                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
   11640                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x24)
   11641                    $C$DW$873       .dwtag  DW_TAG_member
   11642                            .dwattr $C$DW$873, DW_AT_type(*$C$DW$T$41)
   11643                            .dwattr $C$DW$873, DW_AT_name("coordAddress")
   11644                            .dwattr $C$DW$873, DW_AT_TI_symbol_name("coordAddress")
   11645                            .dwattr $C$DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11646                            .dwattr $C$DW$873, DW_AT_accessibility(DW_ACCESS_public)
   11647                            .dwattr $C$DW$873, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11648                            .dwattr $C$DW$873, DW_AT_decl_line(0x3e1)
   11649                            .dwattr $C$DW$873, DW_AT_decl_column(0x11)
   11650                    
   11651                    $C$DW$874       .dwtag  DW_TAG_member
   11652                            .dwattr $C$DW$874, DW_AT_type(*$C$DW$T$37)
   11653                            .dwattr $C$DW$874, DW_AT_name("coordPanId")
   11654                            .dwattr $C$DW$874, DW_AT_TI_symbol_name("coordPanId")
   11655                            .dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11656                            .dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
   11657                            .dwattr $C$DW$874, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11658                            .dwattr $C$DW$874, DW_AT_decl_line(0x3e2)
   11659                            .dwattr $C$DW$874, DW_AT_decl_column(0x11)
   11660                    
   11661                    $C$DW$875       .dwtag  DW_TAG_member
   11662                            .dwattr $C$DW$875, DW_AT_type(*$C$DW$T$37)
   11663                            .dwattr $C$DW$875, DW_AT_name("superframeSpec")
   11664                            .dwattr $C$DW$875, DW_AT_TI_symbol_name("superframeSpec")
   11665                            .dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11666                            .dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
   11667                            .dwattr $C$DW$875, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11668                            .dwattr $C$DW$875, DW_AT_decl_line(0x3e3)
   11669                            .dwattr $C$DW$875, DW_AT_decl_column(0x11)
   11670                    
   11671                    $C$DW$876       .dwtag  DW_TAG_member
   11672                            .dwattr $C$DW$876, DW_AT_type(*$C$DW$T$30)
   11673                            .dwattr $C$DW$876, DW_AT_name("logicalChannel")
   11674                            .dwattr $C$DW$876, DW_AT_TI_symbol_name("logicalChannel")
   11675                            .dwattr $C$DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11676                            .dwattr $C$DW$876, DW_AT_accessibility(DW_ACCESS_public)
   11677                            .dwattr $C$DW$876, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11678                            .dwattr $C$DW$876, DW_AT_decl_line(0x3e4)
   11679                            .dwattr $C$DW$876, DW_AT_decl_column(0x11)
   11680                    
   11681                    $C$DW$877       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  214

   11682                            .dwattr $C$DW$877, DW_AT_type(*$C$DW$T$30)
   11683                            .dwattr $C$DW$877, DW_AT_name("channelPage")
   11684                            .dwattr $C$DW$877, DW_AT_TI_symbol_name("channelPage")
   11685                            .dwattr $C$DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
   11686                            .dwattr $C$DW$877, DW_AT_accessibility(DW_ACCESS_public)
   11687                            .dwattr $C$DW$877, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11688                            .dwattr $C$DW$877, DW_AT_decl_line(0x3e5)
   11689                            .dwattr $C$DW$877, DW_AT_decl_column(0x11)
   11690                    
   11691                    $C$DW$878       .dwtag  DW_TAG_member
   11692                            .dwattr $C$DW$878, DW_AT_type(*$C$DW$T$43)
   11693                            .dwattr $C$DW$878, DW_AT_name("gtsPermit")
   11694                            .dwattr $C$DW$878, DW_AT_TI_symbol_name("gtsPermit")
   11695                            .dwattr $C$DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11696                            .dwattr $C$DW$878, DW_AT_accessibility(DW_ACCESS_public)
   11697                            .dwattr $C$DW$878, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11698                            .dwattr $C$DW$878, DW_AT_decl_line(0x3e6)
   11699                            .dwattr $C$DW$878, DW_AT_decl_column(0x11)
   11700                    
   11701                    $C$DW$879       .dwtag  DW_TAG_member
   11702                            .dwattr $C$DW$879, DW_AT_type(*$C$DW$T$30)
   11703                            .dwattr $C$DW$879, DW_AT_name("linkQuality")
   11704                            .dwattr $C$DW$879, DW_AT_TI_symbol_name("linkQuality")
   11705                            .dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
   11706                            .dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
   11707                            .dwattr $C$DW$879, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11708                            .dwattr $C$DW$879, DW_AT_decl_line(0x3e7)
   11709                            .dwattr $C$DW$879, DW_AT_decl_column(0x11)
   11710                    
   11711                    $C$DW$880       .dwtag  DW_TAG_member
   11712                            .dwattr $C$DW$880, DW_AT_type(*$C$DW$T$44)
   11713                            .dwattr $C$DW$880, DW_AT_name("timestamp")
   11714                            .dwattr $C$DW$880, DW_AT_TI_symbol_name("timestamp")
   11715                            .dwattr $C$DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   11716                            .dwattr $C$DW$880, DW_AT_accessibility(DW_ACCESS_public)
   11717                            .dwattr $C$DW$880, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11718                            .dwattr $C$DW$880, DW_AT_decl_line(0x3e8)
   11719                            .dwattr $C$DW$880, DW_AT_decl_column(0x11)
   11720                    
   11721                    $C$DW$881       .dwtag  DW_TAG_member
   11722                            .dwattr $C$DW$881, DW_AT_type(*$C$DW$T$43)
   11723                            .dwattr $C$DW$881, DW_AT_name("securityFailure")
   11724                            .dwattr $C$DW$881, DW_AT_TI_symbol_name("securityFailure")
   11725                            .dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   11726                            .dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
   11727                            .dwattr $C$DW$881, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11728                            .dwattr $C$DW$881, DW_AT_decl_line(0x3e9)
   11729                            .dwattr $C$DW$881, DW_AT_decl_column(0x11)
   11730                    
   11731                    $C$DW$882       .dwtag  DW_TAG_member
   11732                            .dwattr $C$DW$882, DW_AT_type(*$C$DW$T$35)
   11733                            .dwattr $C$DW$882, DW_AT_name("sec")
   11734                            .dwattr $C$DW$882, DW_AT_TI_symbol_name("sec")
   11735                            .dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   11736                            .dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  215

   11737                            .dwattr $C$DW$882, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11738                            .dwattr $C$DW$882, DW_AT_decl_line(0x3ea)
   11739                            .dwattr $C$DW$882, DW_AT_decl_column(0x11)
   11740                    
   11741                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11742                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x3e0)
   11743                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
   11744                            .dwendtag $C$DW$T$45
   11745                    
   11746                    $C$DW$T$46      .dwtag  DW_TAG_typedef
   11747                            .dwattr $C$DW$T$46, DW_AT_name("macPanDesc_t")
   11748                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
   11749                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
   11750                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11751                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x3eb)
   11752                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
   11753                    
   11754                    $C$DW$T$47      .dwtag  DW_TAG_pointer_type
   11755                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
   11756                            .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
   11757                    
   11758                    $C$DW$T$809     .dwtag  DW_TAG_const_type
   11759                            .dwattr $C$DW$T$809, DW_AT_type(*$C$DW$T$47)
   11760                    
   11761                    
   11762                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
   11763                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x14)
   11764                    $C$DW$883       .dwtag  DW_TAG_member
   11765                            .dwattr $C$DW$883, DW_AT_type(*$C$DW$T$47)
   11766                            .dwattr $C$DW$883, DW_AT_name("pPanDesc")
   11767                            .dwattr $C$DW$883, DW_AT_TI_symbol_name("pPanDesc")
   11768                            .dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11769                            .dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
   11770                            .dwattr $C$DW$883, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11771                            .dwattr $C$DW$883, DW_AT_decl_line(0x4a4)
   11772                            .dwattr $C$DW$883, DW_AT_decl_column(0x13)
   11773                    
   11774                    $C$DW$884       .dwtag  DW_TAG_member
   11775                            .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$30)
   11776                            .dwattr $C$DW$884, DW_AT_name("pendAddrSpec")
   11777                            .dwattr $C$DW$884, DW_AT_TI_symbol_name("pendAddrSpec")
   11778                            .dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11779                            .dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
   11780                            .dwattr $C$DW$884, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11781                            .dwattr $C$DW$884, DW_AT_decl_line(0x4a5)
   11782                            .dwattr $C$DW$884, DW_AT_decl_column(0x12)
   11783                    
   11784                    $C$DW$885       .dwtag  DW_TAG_member
   11785                            .dwattr $C$DW$885, DW_AT_type(*$C$DW$T$48)
   11786                            .dwattr $C$DW$885, DW_AT_name("pAddrList")
   11787                            .dwattr $C$DW$885, DW_AT_TI_symbol_name("pAddrList")
   11788                            .dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11789                            .dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
   11790                            .dwattr $C$DW$885, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11791                            .dwattr $C$DW$885, DW_AT_decl_line(0x4a6)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  216

   11792                            .dwattr $C$DW$885, DW_AT_decl_column(0x13)
   11793                    
   11794                    $C$DW$886       .dwtag  DW_TAG_member
   11795                            .dwattr $C$DW$886, DW_AT_type(*$C$DW$T$30)
   11796                            .dwattr $C$DW$886, DW_AT_name("sduLength")
   11797                            .dwattr $C$DW$886, DW_AT_TI_symbol_name("sduLength")
   11798                            .dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11799                            .dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
   11800                            .dwattr $C$DW$886, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11801                            .dwattr $C$DW$886, DW_AT_decl_line(0x4a7)
   11802                            .dwattr $C$DW$886, DW_AT_decl_column(0x12)
   11803                    
   11804                    $C$DW$887       .dwtag  DW_TAG_member
   11805                            .dwattr $C$DW$887, DW_AT_type(*$C$DW$T$48)
   11806                            .dwattr $C$DW$887, DW_AT_name("pSdu")
   11807                            .dwattr $C$DW$887, DW_AT_TI_symbol_name("pSdu")
   11808                            .dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11809                            .dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
   11810                            .dwattr $C$DW$887, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11811                            .dwattr $C$DW$887, DW_AT_decl_line(0x4a8)
   11812                            .dwattr $C$DW$887, DW_AT_decl_column(0x13)
   11813                    
   11814                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11815                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x4a3)
   11816                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
   11817                            .dwendtag $C$DW$T$49
   11818                    
   11819                    $C$DW$T$201     .dwtag  DW_TAG_typedef
   11820                            .dwattr $C$DW$T$201, DW_AT_name("macBeaconData_t")
   11821                            .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$49)
   11822                            .dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
   11823                            .dwattr $C$DW$T$201, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   11824                            .dwattr $C$DW$T$201, DW_AT_decl_line(0x4a9)
   11825                            .dwattr $C$DW$T$201, DW_AT_decl_column(0x03)
   11826                    
   11827                    
   11828                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
   11829                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
   11830                    $C$DW$888       .dwtag  DW_TAG_member
   11831                            .dwattr $C$DW$888, DW_AT_type(*$C$DW$T$30)
   11832                            .dwattr $C$DW$888, DW_AT_name("beaconOrder")
   11833                            .dwattr $C$DW$888, DW_AT_TI_symbol_name("beaconOrder")
   11834                            .dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11835                            .dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
   11836                            .dwattr $C$DW$888, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11837                            .dwattr $C$DW$888, DW_AT_decl_line(0x4ae)
   11838                            .dwattr $C$DW$888, DW_AT_decl_column(0x11)
   11839                    
   11840                    $C$DW$889       .dwtag  DW_TAG_member
   11841                            .dwattr $C$DW$889, DW_AT_type(*$C$DW$T$30)
   11842                            .dwattr $C$DW$889, DW_AT_name("superFrameOrder")
   11843                            .dwattr $C$DW$889, DW_AT_TI_symbol_name("superFrameOrder")
   11844                            .dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11845                            .dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
   11846                            .dwattr $C$DW$889, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  217

   11847                            .dwattr $C$DW$889, DW_AT_decl_line(0x4af)
   11848                            .dwattr $C$DW$889, DW_AT_decl_column(0x11)
   11849                    
   11850                    $C$DW$890       .dwtag  DW_TAG_member
   11851                            .dwattr $C$DW$890, DW_AT_type(*$C$DW$T$30)
   11852                            .dwattr $C$DW$890, DW_AT_name("finalCapSlot")
   11853                            .dwattr $C$DW$890, DW_AT_TI_symbol_name("finalCapSlot")
   11854                            .dwattr $C$DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11855                            .dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
   11856                            .dwattr $C$DW$890, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11857                            .dwattr $C$DW$890, DW_AT_decl_line(0x4b1)
   11858                            .dwattr $C$DW$890, DW_AT_decl_column(0x11)
   11859                    
   11860                    $C$DW$891       .dwtag  DW_TAG_member
   11861                            .dwattr $C$DW$891, DW_AT_type(*$C$DW$T$30)
   11862                            .dwattr $C$DW$891, DW_AT_name("eBeaconOrder")
   11863                            .dwattr $C$DW$891, DW_AT_TI_symbol_name("eBeaconOrder")
   11864                            .dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11865                            .dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
   11866                            .dwattr $C$DW$891, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11867                            .dwattr $C$DW$891, DW_AT_decl_line(0x4b2)
   11868                            .dwattr $C$DW$891, DW_AT_decl_column(0x11)
   11869                    
   11870                    $C$DW$892       .dwtag  DW_TAG_member
   11871                            .dwattr $C$DW$892, DW_AT_type(*$C$DW$T$30)
   11872                            .dwattr $C$DW$892, DW_AT_name("offsetTimeSlot")
   11873                            .dwattr $C$DW$892, DW_AT_TI_symbol_name("offsetTimeSlot")
   11874                            .dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11875                            .dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
   11876                            .dwattr $C$DW$892, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11877                            .dwattr $C$DW$892, DW_AT_decl_line(0x4b4)
   11878                            .dwattr $C$DW$892, DW_AT_decl_column(0x11)
   11879                    
   11880                    $C$DW$893       .dwtag  DW_TAG_member
   11881                            .dwattr $C$DW$893, DW_AT_type(*$C$DW$T$30)
   11882                            .dwattr $C$DW$893, DW_AT_name("capBackOff")
   11883                            .dwattr $C$DW$893, DW_AT_TI_symbol_name("capBackOff")
   11884                            .dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11885                            .dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
   11886                            .dwattr $C$DW$893, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11887                            .dwattr $C$DW$893, DW_AT_decl_line(0x4b5)
   11888                            .dwattr $C$DW$893, DW_AT_decl_column(0x11)
   11889                    
   11890                    $C$DW$894       .dwtag  DW_TAG_member
   11891                            .dwattr $C$DW$894, DW_AT_type(*$C$DW$T$37)
   11892                            .dwattr $C$DW$894, DW_AT_name("eBeaconOrderNBPAN")
   11893                            .dwattr $C$DW$894, DW_AT_TI_symbol_name("eBeaconOrderNBPAN")
   11894                            .dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11895                            .dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
   11896                            .dwattr $C$DW$894, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11897                            .dwattr $C$DW$894, DW_AT_decl_line(0x4b7)
   11898                            .dwattr $C$DW$894, DW_AT_decl_column(0x11)
   11899                    
   11900                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11901                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x4ad)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  218

   11902                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
   11903                            .dwendtag $C$DW$T$50
   11904                    
   11905                    $C$DW$T$51      .dwtag  DW_TAG_typedef
   11906                            .dwattr $C$DW$T$51, DW_AT_name("macCoexist_t")
   11907                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
   11908                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
   11909                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11910                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x4b9)
   11911                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
   11912                    
   11913                    
   11914                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
   11915                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x0c)
   11916                    $C$DW$895       .dwtag  DW_TAG_member
   11917                            .dwattr $C$DW$895, DW_AT_type(*$C$DW$T$47)
   11918                            .dwattr $C$DW$895, DW_AT_name("pPanDesc")
   11919                            .dwattr $C$DW$895, DW_AT_TI_symbol_name("pPanDesc")
   11920                            .dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11921                            .dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
   11922                            .dwattr $C$DW$895, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11923                            .dwattr $C$DW$895, DW_AT_decl_line(0x4be)
   11924                            .dwattr $C$DW$895, DW_AT_decl_column(0x13)
   11925                    
   11926                    $C$DW$896       .dwtag  DW_TAG_member
   11927                            .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$51)
   11928                            .dwattr $C$DW$896, DW_AT_name("coexist")
   11929                            .dwattr $C$DW$896, DW_AT_TI_symbol_name("coexist")
   11930                            .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11931                            .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
   11932                            .dwattr $C$DW$896, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11933                            .dwattr $C$DW$896, DW_AT_decl_line(0x4bf)
   11934                            .dwattr $C$DW$896, DW_AT_decl_column(0x12)
   11935                    
   11936                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11937                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x4bd)
   11938                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
   11939                            .dwendtag $C$DW$T$52
   11940                    
   11941                    $C$DW$T$202     .dwtag  DW_TAG_typedef
   11942                            .dwattr $C$DW$T$202, DW_AT_name("macEBeaconData_t")
   11943                            .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$52)
   11944                            .dwattr $C$DW$T$202, DW_AT_language(DW_LANG_C)
   11945                            .dwattr $C$DW$T$202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   11946                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x4c1)
   11947                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x03)
   11948                    
   11949                    
   11950                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
   11951                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x18)
   11952                    $C$DW$897       .dwtag  DW_TAG_member
   11953                            .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$32)
   11954                            .dwattr $C$DW$897, DW_AT_name("hdr")
   11955                            .dwattr $C$DW$897, DW_AT_TI_symbol_name("hdr")
   11956                            .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  219

   11957                            .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
   11958                            .dwattr $C$DW$897, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11959                            .dwattr $C$DW$897, DW_AT_decl_line(0x4c6)
   11960                            .dwattr $C$DW$897, DW_AT_decl_column(0x12)
   11961                    
   11962                    $C$DW$898       .dwtag  DW_TAG_member
   11963                            .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$30)
   11964                            .dwattr $C$DW$898, DW_AT_name("beaconType")
   11965                            .dwattr $C$DW$898, DW_AT_TI_symbol_name("beaconType")
   11966                            .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11967                            .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
   11968                            .dwattr $C$DW$898, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11969                            .dwattr $C$DW$898, DW_AT_decl_line(0x4c7)
   11970                            .dwattr $C$DW$898, DW_AT_decl_column(0x12)
   11971                    
   11972                    $C$DW$899       .dwtag  DW_TAG_member
   11973                            .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$30)
   11974                            .dwattr $C$DW$899, DW_AT_name("bsn")
   11975                            .dwattr $C$DW$899, DW_AT_TI_symbol_name("bsn")
   11976                            .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11977                            .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
   11978                            .dwattr $C$DW$899, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11979                            .dwattr $C$DW$899, DW_AT_decl_line(0x4c8)
   11980                            .dwattr $C$DW$899, DW_AT_decl_column(0x12)
   11981                    
   11982                    $C$DW$900       .dwtag  DW_TAG_member
   11983                            .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$203)
   11984                            .dwattr $C$DW$900, DW_AT_name("info")
   11985                            .dwattr $C$DW$900, DW_AT_TI_symbol_name("info")
   11986                            .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11987                            .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
   11988                            .dwattr $C$DW$900, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11989                            .dwattr $C$DW$900, DW_AT_decl_line(0x4cd)
   11990                            .dwattr $C$DW$900, DW_AT_decl_column(0x05)
   11991                    
   11992                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11993                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x4c5)
   11994                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
   11995                            .dwendtag $C$DW$T$53
   11996                    
   11997                    $C$DW$T$212     .dwtag  DW_TAG_typedef
   11998                            .dwattr $C$DW$T$212, DW_AT_name("macMlmeBeaconNotifyInd_t")
   11999                            .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$53)
   12000                            .dwattr $C$DW$T$212, DW_AT_language(DW_LANG_C)
   12001                            .dwattr $C$DW$T$212, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   12002                            .dwattr $C$DW$T$212, DW_AT_decl_line(0x4ce)
   12003                            .dwattr $C$DW$T$212, DW_AT_decl_column(0x03)
   12004                    
   12005                    $C$DW$T$815     .dwtag  DW_TAG_pointer_type
   12006                            .dwattr $C$DW$T$815, DW_AT_type(*$C$DW$T$212)
   12007                            .dwattr $C$DW$T$815, DW_AT_address_class(0x20)
   12008                    
   12009                    $C$DW$T$816     .dwtag  DW_TAG_const_type
   12010                            .dwattr $C$DW$T$816, DW_AT_type(*$C$DW$T$815)
   12011                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  220

   12012                    
   12013                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
   12014                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x15)
   12015                    $C$DW$901       .dwtag  DW_TAG_member
   12016                            .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$32)
   12017                            .dwattr $C$DW$901, DW_AT_name("hdr")
   12018                            .dwattr $C$DW$901, DW_AT_TI_symbol_name("hdr")
   12019                            .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12020                            .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
   12021                            .dwattr $C$DW$901, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12022                            .dwattr $C$DW$901, DW_AT_decl_line(0x4d4)
   12023                            .dwattr $C$DW$901, DW_AT_decl_column(0x17)
   12024                    
   12025                    $C$DW$902       .dwtag  DW_TAG_member
   12026                            .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$34)
   12027                            .dwattr $C$DW$902, DW_AT_name("orphanAddress")
   12028                            .dwattr $C$DW$902, DW_AT_TI_symbol_name("orphanAddress")
   12029                            .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12030                            .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
   12031                            .dwattr $C$DW$902, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12032                            .dwattr $C$DW$902, DW_AT_decl_line(0x4d5)
   12033                            .dwattr $C$DW$902, DW_AT_decl_column(0x17)
   12034                    
   12035                    $C$DW$903       .dwtag  DW_TAG_member
   12036                            .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$35)
   12037                            .dwattr $C$DW$903, DW_AT_name("sec")
   12038                            .dwattr $C$DW$903, DW_AT_TI_symbol_name("sec")
   12039                            .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12040                            .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
   12041                            .dwattr $C$DW$903, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12042                            .dwattr $C$DW$903, DW_AT_decl_line(0x4d6)
   12043                            .dwattr $C$DW$903, DW_AT_decl_column(0x17)
   12044                    
   12045                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   12046                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x4d3)
   12047                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
   12048                            .dwendtag $C$DW$T$54
   12049                    
   12050                    $C$DW$T$213     .dwtag  DW_TAG_typedef
   12051                            .dwattr $C$DW$T$213, DW_AT_name("macMlmeOrphanInd_t")
   12052                            .dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$54)
   12053                            .dwattr $C$DW$T$213, DW_AT_language(DW_LANG_C)
   12054                            .dwattr $C$DW$T$213, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   12055                            .dwattr $C$DW$T$213, DW_AT_decl_line(0x4d7)
   12056                            .dwattr $C$DW$T$213, DW_AT_decl_column(0x03)
   12057                    
   12058                    
   12059                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
   12060                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x1c)
   12061                    $C$DW$904       .dwtag  DW_TAG_member
   12062                            .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$32)
   12063                            .dwattr $C$DW$904, DW_AT_name("hdr")
   12064                            .dwattr $C$DW$904, DW_AT_TI_symbol_name("hdr")
   12065                            .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12066                            .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  221

   12067                            .dwattr $C$DW$904, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12068                            .dwattr $C$DW$904, DW_AT_decl_line(0x4dc)
   12069                            .dwattr $C$DW$904, DW_AT_decl_column(0x13)
   12070                    
   12071                    $C$DW$905       .dwtag  DW_TAG_member
   12072                            .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$30)
   12073                            .dwattr $C$DW$905, DW_AT_name("scanType")
   12074                            .dwattr $C$DW$905, DW_AT_TI_symbol_name("scanType")
   12075                            .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12076                            .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
   12077                            .dwattr $C$DW$905, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12078                            .dwattr $C$DW$905, DW_AT_decl_line(0x4dd)
   12079                            .dwattr $C$DW$905, DW_AT_decl_column(0x13)
   12080                    
   12081                    $C$DW$906       .dwtag  DW_TAG_member
   12082                            .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$30)
   12083                            .dwattr $C$DW$906, DW_AT_name("channelPage")
   12084                            .dwattr $C$DW$906, DW_AT_TI_symbol_name("channelPage")
   12085                            .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12086                            .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
   12087                            .dwattr $C$DW$906, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12088                            .dwattr $C$DW$906, DW_AT_decl_line(0x4de)
   12089                            .dwattr $C$DW$906, DW_AT_decl_column(0x13)
   12090                    
   12091                    $C$DW$907       .dwtag  DW_TAG_member
   12092                            .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$30)
   12093                            .dwattr $C$DW$907, DW_AT_name("phyID")
   12094                            .dwattr $C$DW$907, DW_AT_TI_symbol_name("phyID")
   12095                            .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12096                            .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
   12097                            .dwattr $C$DW$907, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12098                            .dwattr $C$DW$907, DW_AT_decl_line(0x4df)
   12099                            .dwattr $C$DW$907, DW_AT_decl_column(0x13)
   12100                    
   12101                    $C$DW$908       .dwtag  DW_TAG_member
   12102                            .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$55)
   12103                            .dwattr $C$DW$908, DW_AT_name("unscannedChannels")
   12104                            .dwattr $C$DW$908, DW_AT_TI_symbol_name("unscannedChannels")
   12105                            .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12106                            .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
   12107                            .dwattr $C$DW$908, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12108                            .dwattr $C$DW$908, DW_AT_decl_line(0x4e0)
   12109                            .dwattr $C$DW$908, DW_AT_decl_column(0x13)
   12110                    
   12111                    $C$DW$909       .dwtag  DW_TAG_member
   12112                            .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$30)
   12113                            .dwattr $C$DW$909, DW_AT_name("resultListSize")
   12114                            .dwattr $C$DW$909, DW_AT_TI_symbol_name("resultListSize")
   12115                            .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   12116                            .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
   12117                            .dwattr $C$DW$909, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12118                            .dwattr $C$DW$909, DW_AT_decl_line(0x4e1)
   12119                            .dwattr $C$DW$909, DW_AT_decl_column(0x13)
   12120                    
   12121                    $C$DW$910       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  222

   12122                            .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$204)
   12123                            .dwattr $C$DW$910, DW_AT_name("result")
   12124                            .dwattr $C$DW$910, DW_AT_TI_symbol_name("result")
   12125                            .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   12126                            .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
   12127                            .dwattr $C$DW$910, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12128                            .dwattr $C$DW$910, DW_AT_decl_line(0x4e6)
   12129                            .dwattr $C$DW$910, DW_AT_decl_column(0x05)
   12130                    
   12131                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   12132                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x4db)
   12133                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
   12134                            .dwendtag $C$DW$T$56
   12135                    
   12136                    $C$DW$T$214     .dwtag  DW_TAG_typedef
   12137                            .dwattr $C$DW$T$214, DW_AT_name("macMlmeScanCnf_t")
   12138                            .dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$56)
   12139                            .dwattr $C$DW$T$214, DW_AT_language(DW_LANG_C)
   12140                            .dwattr $C$DW$T$214, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   12141                            .dwattr $C$DW$T$214, DW_AT_decl_line(0x4e7)
   12142                            .dwattr $C$DW$T$214, DW_AT_decl_column(0x03)
   12143                    
   12144                    $C$DW$T$819     .dwtag  DW_TAG_pointer_type
   12145                            .dwattr $C$DW$T$819, DW_AT_type(*$C$DW$T$214)
   12146                            .dwattr $C$DW$T$819, DW_AT_address_class(0x20)
   12147                    
   12148                    $C$DW$T$820     .dwtag  DW_TAG_const_type
   12149                            .dwattr $C$DW$T$820, DW_AT_type(*$C$DW$T$819)
   12150                    
   12151                    
   12152                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
   12153                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x02)
   12154                    $C$DW$911       .dwtag  DW_TAG_member
   12155                            .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$32)
   12156                            .dwattr $C$DW$911, DW_AT_name("hdr")
   12157                            .dwattr $C$DW$911, DW_AT_TI_symbol_name("hdr")
   12158                            .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12159                            .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
   12160                            .dwattr $C$DW$911, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12161                            .dwattr $C$DW$911, DW_AT_decl_line(0x4ec)
   12162                            .dwattr $C$DW$911, DW_AT_decl_column(0x13)
   12163                    
   12164                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   12165                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x4eb)
   12166                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x01)
   12167                            .dwendtag $C$DW$T$57
   12168                    
   12169                    $C$DW$T$215     .dwtag  DW_TAG_typedef
   12170                            .dwattr $C$DW$T$215, DW_AT_name("macMlmeStartCnf_t")
   12171                            .dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$57)
   12172                            .dwattr $C$DW$T$215, DW_AT_language(DW_LANG_C)
   12173                            .dwattr $C$DW$T$215, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   12174                            .dwattr $C$DW$T$215, DW_AT_decl_line(0x4ed)
   12175                            .dwattr $C$DW$T$215, DW_AT_decl_column(0x03)
   12176                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  223

   12177                    
   12178                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
   12179                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x12)
   12180                    $C$DW$912       .dwtag  DW_TAG_member
   12181                            .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$32)
   12182                            .dwattr $C$DW$912, DW_AT_name("hdr")
   12183                            .dwattr $C$DW$912, DW_AT_TI_symbol_name("hdr")
   12184                            .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12185                            .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
   12186                            .dwattr $C$DW$912, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12187                            .dwattr $C$DW$912, DW_AT_decl_line(0x4f2)
   12188                            .dwattr $C$DW$912, DW_AT_decl_column(0x13)
   12189                    
   12190                    $C$DW$913       .dwtag  DW_TAG_member
   12191                            .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$37)
   12192                            .dwattr $C$DW$913, DW_AT_name("panId")
   12193                            .dwattr $C$DW$913, DW_AT_TI_symbol_name("panId")
   12194                            .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12195                            .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
   12196                            .dwattr $C$DW$913, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12197                            .dwattr $C$DW$913, DW_AT_decl_line(0x4f3)
   12198                            .dwattr $C$DW$913, DW_AT_decl_column(0x13)
   12199                    
   12200                    $C$DW$914       .dwtag  DW_TAG_member
   12201                            .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$30)
   12202                            .dwattr $C$DW$914, DW_AT_name("logicalChannel")
   12203                            .dwattr $C$DW$914, DW_AT_TI_symbol_name("logicalChannel")
   12204                            .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12205                            .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
   12206                            .dwattr $C$DW$914, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12207                            .dwattr $C$DW$914, DW_AT_decl_line(0x4f4)
   12208                            .dwattr $C$DW$914, DW_AT_decl_column(0x13)
   12209                    
   12210                    $C$DW$915       .dwtag  DW_TAG_member
   12211                            .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$30)
   12212                            .dwattr $C$DW$915, DW_AT_name("channelPage")
   12213                            .dwattr $C$DW$915, DW_AT_TI_symbol_name("channelPage")
   12214                            .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12215                            .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
   12216                            .dwattr $C$DW$915, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12217                            .dwattr $C$DW$915, DW_AT_decl_line(0x4f5)
   12218                            .dwattr $C$DW$915, DW_AT_decl_column(0x13)
   12219                    
   12220                    $C$DW$916       .dwtag  DW_TAG_member
   12221                            .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$30)
   12222                            .dwattr $C$DW$916, DW_AT_name("phyID")
   12223                            .dwattr $C$DW$916, DW_AT_TI_symbol_name("phyID")
   12224                            .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12225                            .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
   12226                            .dwattr $C$DW$916, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12227                            .dwattr $C$DW$916, DW_AT_decl_line(0x4f6)
   12228                            .dwattr $C$DW$916, DW_AT_decl_column(0x13)
   12229                    
   12230                    $C$DW$917       .dwtag  DW_TAG_member
   12231                            .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$35)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  224

   12232                            .dwattr $C$DW$917, DW_AT_name("sec")
   12233                            .dwattr $C$DW$917, DW_AT_TI_symbol_name("sec")
   12234                            .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   12235                            .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
   12236                            .dwattr $C$DW$917, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12237                            .dwattr $C$DW$917, DW_AT_decl_line(0x4f7)
   12238                            .dwattr $C$DW$917, DW_AT_decl_column(0x13)
   12239                    
   12240                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   12241                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x4f1)
   12242                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x01)
   12243                            .dwendtag $C$DW$T$58
   12244                    
   12245                    $C$DW$T$216     .dwtag  DW_TAG_typedef
   12246                            .dwattr $C$DW$T$216, DW_AT_name("macMlmeSyncLossInd_t")
   12247                            .dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$58)
   12248                            .dwattr $C$DW$T$216, DW_AT_language(DW_LANG_C)
   12249                            .dwattr $C$DW$T$216, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   12250                            .dwattr $C$DW$T$216, DW_AT_decl_line(0x4f8)
   12251                            .dwattr $C$DW$T$216, DW_AT_decl_column(0x03)
   12252                    
   12253                    
   12254                    $C$DW$T$59      .dwtag  DW_TAG_structure_type
   12255                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x03)
   12256                    $C$DW$918       .dwtag  DW_TAG_member
   12257                            .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$32)
   12258                            .dwattr $C$DW$918, DW_AT_name("hdr")
   12259                            .dwattr $C$DW$918, DW_AT_TI_symbol_name("hdr")
   12260                            .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12261                            .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
   12262                            .dwattr $C$DW$918, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12263                            .dwattr $C$DW$918, DW_AT_decl_line(0x4fd)
   12264                            .dwattr $C$DW$918, DW_AT_decl_column(0x13)
   12265                    
   12266                    $C$DW$919       .dwtag  DW_TAG_member
   12267                            .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$30)
   12268                            .dwattr $C$DW$919, DW_AT_name("framePending")
   12269                            .dwattr $C$DW$919, DW_AT_TI_symbol_name("framePending")
   12270                            .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12271                            .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
   12272                            .dwattr $C$DW$919, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12273                            .dwattr $C$DW$919, DW_AT_decl_line(0x4fe)
   12274                            .dwattr $C$DW$919, DW_AT_decl_column(0x13)
   12275                    
   12276                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   12277                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x4fc)
   12278                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
   12279                            .dwendtag $C$DW$T$59
   12280                    
   12281                    $C$DW$T$217     .dwtag  DW_TAG_typedef
   12282                            .dwattr $C$DW$T$217, DW_AT_name("macMlmePollCnf_t")
   12283                            .dwattr $C$DW$T$217, DW_AT_type(*$C$DW$T$59)
   12284                            .dwattr $C$DW$T$217, DW_AT_language(DW_LANG_C)
   12285                            .dwattr $C$DW$T$217, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   12286                            .dwattr $C$DW$T$217, DW_AT_decl_line(0x4ff)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  225

   12287                            .dwattr $C$DW$T$217, DW_AT_decl_column(0x03)
   12288                    
   12289                    
   12290                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
   12291                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x24)
   12292                    $C$DW$920       .dwtag  DW_TAG_member
   12293                            .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$32)
   12294                            .dwattr $C$DW$920, DW_AT_name("hdr")
   12295                            .dwattr $C$DW$920, DW_AT_TI_symbol_name("hdr")
   12296                            .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12297                            .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
   12298                            .dwattr $C$DW$920, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12299                            .dwattr $C$DW$920, DW_AT_decl_line(0x504)
   12300                            .dwattr $C$DW$920, DW_AT_decl_column(0x13)
   12301                    
   12302                    $C$DW$921       .dwtag  DW_TAG_member
   12303                            .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$41)
   12304                            .dwattr $C$DW$921, DW_AT_name("srcAddr")
   12305                            .dwattr $C$DW$921, DW_AT_TI_symbol_name("srcAddr")
   12306                            .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12307                            .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
   12308                            .dwattr $C$DW$921, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12309                            .dwattr $C$DW$921, DW_AT_decl_line(0x505)
   12310                            .dwattr $C$DW$921, DW_AT_decl_column(0x13)
   12311                    
   12312                    $C$DW$922       .dwtag  DW_TAG_member
   12313                            .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$41)
   12314                            .dwattr $C$DW$922, DW_AT_name("dstAddr")
   12315                            .dwattr $C$DW$922, DW_AT_TI_symbol_name("dstAddr")
   12316                            .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12317                            .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
   12318                            .dwattr $C$DW$922, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12319                            .dwattr $C$DW$922, DW_AT_decl_line(0x506)
   12320                            .dwattr $C$DW$922, DW_AT_decl_column(0x13)
   12321                    
   12322                    $C$DW$923       .dwtag  DW_TAG_member
   12323                            .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$37)
   12324                            .dwattr $C$DW$923, DW_AT_name("panId")
   12325                            .dwattr $C$DW$923, DW_AT_TI_symbol_name("panId")
   12326                            .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   12327                            .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
   12328                            .dwattr $C$DW$923, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12329                            .dwattr $C$DW$923, DW_AT_decl_line(0x507)
   12330                            .dwattr $C$DW$923, DW_AT_decl_column(0x13)
   12331                    
   12332                    $C$DW$924       .dwtag  DW_TAG_member
   12333                            .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$30)
   12334                            .dwattr $C$DW$924, DW_AT_name("reason")
   12335                            .dwattr $C$DW$924, DW_AT_TI_symbol_name("reason")
   12336                            .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   12337                            .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
   12338                            .dwattr $C$DW$924, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12339                            .dwattr $C$DW$924, DW_AT_decl_line(0x508)
   12340                            .dwattr $C$DW$924, DW_AT_decl_column(0x13)
   12341                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{B4B2FEDC-5A78-4594-BEB6-3F19656B4E06} PAGE  226

   12342                    $C$DW$925       .dwtag  DW_TAG_member
   12343                            .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$35)
   12344                            .dwattr $C$DW$925, DW_AT_name("sec")
   12345                            .dwattr $C$DW$925, DW_AT_TI_symbol_name("sec")
   12346                            .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   12347                            .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
   12348                            .dwattr $C$DW$925, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12349                            .dwattr $C$DW$925, DW_AT_decl_line(0x509)
   12350                            .dwattr $C$DW$925, DW_AT_decl_column(0x13)
   12351                    
   12352                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   12353                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x503)
   12354                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x01)
   12355                            .dwendtag $C$DW$T$60
   12356                    
   12357                    $C$DW$T$218     .dwtag  DW_TAG_typedef
   12358                            .dwattr $C$DW$T$218, DW_AT_name("macMlmeCommStatusInd_t")
   12359                            .dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$60)
   12360                            .dwattr $C$DW$T$218, DW_AT_language(DW_LANG_C)
   12361                            .dwattr $C$DW$T$218, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   12362                            .dwattr $C$DW$T$218, DW_AT_decl_line(0x50a)
   12363                            .dwattr $C$DW$T$218, DW_AT_decl_column(0x03)
   12364                    
   12365                    
   12366                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
