TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Nov 28 13:22:04 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/LaunchPad/CC13X0_LAUNCHXL.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Adrian\workspace_v8\collector_cc1350lp\collector_cc
      13                            .bound  ".TI.bound:flashBuf", 106496, 0
      14                            .noinit ".TI.bound:flashBuf"

    3010                            .dwattr $C$DW$196, DW_AT_decl_column(0x05)
    3011                    
    3012                    $C$DW$197       .dwtag  DW_TAG_enumerator
    3013                            .dwattr $C$DW$197, DW_AT_name("RF_AllowDelayAny")
    3014                            .dwattr $C$DW$197, DW_AT_const_value(-1)
    3015                            .dwattr $C$DW$197, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3016                            .dwattr $C$DW$197, DW_AT_decl_line(0x5ee)
    3017                            .dwattr $C$DW$197, DW_AT_decl_column(0x05)
    3018                    
    3019                            .dwattr $C$DW$T$1060, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/driver
    3020                            .dwattr $C$DW$T$1060, DW_AT_decl_line(0x5ec)
    3021                            .dwattr $C$DW$T$1060, DW_AT_decl_column(0x0e)
    3022                            .dwendtag $C$DW$T$1060
    3023                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   56

    3024                    $C$DW$T$1061    .dwtag  DW_TAG_typedef
    3025                            .dwattr $C$DW$T$1061, DW_AT_name("RF_AllowDelay")
    3026                            .dwattr $C$DW$T$1061, DW_AT_type(*$C$DW$T$1060)
    3027                            .dwattr $C$DW$T$1061, DW_AT_language(DW_LANG_C)
    3028                            .dwattr $C$DW$T$1061, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/driver
    3029                            .dwattr $C$DW$T$1061, DW_AT_decl_line(0x5ef)
    3030                            .dwattr $C$DW$T$1061, DW_AT_decl_column(0x03)
    3031                    
    3032                    
    3033                    $C$DW$T$1062    .dwtag  DW_TAG_enumeration_type
    3034                            .dwattr $C$DW$T$1062, DW_AT_byte_size(0x01)
    3035                    $C$DW$198       .dwtag  DW_TAG_enumerator
    3036                            .dwattr $C$DW$198, DW_AT_name("RF_RatChannelAny")
    3037                            .dwattr $C$DW$198, DW_AT_const_value(-1)
    3038                            .dwattr $C$DW$198, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3039                            .dwattr $C$DW$198, DW_AT_decl_line(0x60f)
    3040                            .dwattr $C$DW$198, DW_AT_decl_column(0x05)
    3041                    
    3042                    $C$DW$199       .dwtag  DW_TAG_enumerator
    3043                            .dwattr $C$DW$199, DW_AT_name("RF_RatChannel0")
    3044                            .dwattr $C$DW$199, DW_AT_const_value(0x00)
    3045                            .dwattr $C$DW$199, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3046                            .dwattr $C$DW$199, DW_AT_decl_line(0x610)
    3047                            .dwattr $C$DW$199, DW_AT_decl_column(0x05)
    3048                    
    3049                    $C$DW$200       .dwtag  DW_TAG_enumerator
    3050                            .dwattr $C$DW$200, DW_AT_name("RF_RatChannel1")
    3051                            .dwattr $C$DW$200, DW_AT_const_value(0x01)
    3052                            .dwattr $C$DW$200, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3053                            .dwattr $C$DW$200, DW_AT_decl_line(0x611)
    3054                            .dwattr $C$DW$200, DW_AT_decl_column(0x05)
    3055                    
    3056                    $C$DW$201       .dwtag  DW_TAG_enumerator
    3057                            .dwattr $C$DW$201, DW_AT_name("RF_RatChannel2")
    3058                            .dwattr $C$DW$201, DW_AT_const_value(0x02)
    3059                            .dwattr $C$DW$201, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3060                            .dwattr $C$DW$201, DW_AT_decl_line(0x612)
    3061                            .dwattr $C$DW$201, DW_AT_decl_column(0x05)
    3062                    
    3063                            .dwattr $C$DW$T$1062, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/driver
    3064                            .dwattr $C$DW$T$1062, DW_AT_decl_line(0x60e)
    3065                            .dwattr $C$DW$T$1062, DW_AT_decl_column(0x0e)
    3066                            .dwendtag $C$DW$T$1062
    3067                    
    3068                    $C$DW$T$1063    .dwtag  DW_TAG_typedef
    3069                            .dwattr $C$DW$T$1063, DW_AT_name("RF_RatSelectChannel")
    3070                            .dwattr $C$DW$T$1063, DW_AT_type(*$C$DW$T$1062)
    3071                            .dwattr $C$DW$T$1063, DW_AT_language(DW_LANG_C)
    3072                            .dwattr $C$DW$T$1063, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/driver
    3073                            .dwattr $C$DW$T$1063, DW_AT_decl_line(0x613)
    3074                            .dwattr $C$DW$T$1063, DW_AT_decl_column(0x03)
    3075                    
    3076                    
    3077                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3078                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   57

    3079                    $C$DW$202       .dwtag  DW_TAG_member
    3080                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$22)
    3081                            .dwattr $C$DW$202, DW_AT_name("rfMode")
    3082                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("rfMode")
    3083                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3084                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3085                            .dwattr $C$DW$202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3086                            .dwattr $C$DW$202, DW_AT_decl_line(0x421)
    3087                            .dwattr $C$DW$202, DW_AT_decl_column(0x0d)
    3088                    
    3089                    $C$DW$203       .dwtag  DW_TAG_member
    3090                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$24)
    3091                            .dwattr $C$DW$203, DW_AT_name("cpePatchFxn")
    3092                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("cpePatchFxn")
    3093                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3094                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3095                            .dwattr $C$DW$203, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3096                            .dwattr $C$DW$203, DW_AT_decl_line(0x422)
    3097                            .dwattr $C$DW$203, DW_AT_decl_column(0x0c)
    3098                    
    3099                    $C$DW$204       .dwtag  DW_TAG_member
    3100                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$24)
    3101                            .dwattr $C$DW$204, DW_AT_name("mcePatchFxn")
    3102                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("mcePatchFxn")
    3103                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3104                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3105                            .dwattr $C$DW$204, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3106                            .dwattr $C$DW$204, DW_AT_decl_line(0x423)
    3107                            .dwattr $C$DW$204, DW_AT_decl_column(0x0c)
    3108                    
    3109                    $C$DW$205       .dwtag  DW_TAG_member
    3110                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$24)
    3111                            .dwattr $C$DW$205, DW_AT_name("rfePatchFxn")
    3112                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("rfePatchFxn")
    3113                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3114                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3115                            .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3116                            .dwattr $C$DW$205, DW_AT_decl_line(0x424)
    3117                            .dwattr $C$DW$205, DW_AT_decl_column(0x0c)
    3118                    
    3119                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    3120                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x420)
    3121                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3122                            .dwendtag $C$DW$T$25
    3123                    
    3124                    $C$DW$T$49      .dwtag  DW_TAG_typedef
    3125                            .dwattr $C$DW$T$49, DW_AT_name("RF_Mode")
    3126                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$25)
    3127                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3128                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    3129                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x425)
    3130                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
    3131                    
    3132                    $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    3133                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   58

    3134                            .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    3135                    
    3136                    
    3137                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3138                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    3139                    $C$DW$206       .dwtag  DW_TAG_member
    3140                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$22)
    3141                            .dwattr $C$DW$206, DW_AT_name("triggerType")
    3142                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("triggerType")
    3143                            .dwattr $C$DW$206, DW_AT_bit_offset(0x04)
    3144                            .dwattr $C$DW$206, DW_AT_bit_size(0x04)
    3145                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3146                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3147                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3148                            .dwattr $C$DW$206, DW_AT_decl_line(0x7d)
    3149                            .dwattr $C$DW$206, DW_AT_decl_column(0x0f)
    3150                    
    3151                    $C$DW$207       .dwtag  DW_TAG_member
    3152                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$22)
    3153                            .dwattr $C$DW$207, DW_AT_name("bEnaCmd")
    3154                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("bEnaCmd")
    3155                            .dwattr $C$DW$207, DW_AT_bit_offset(0x03)
    3156                            .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    3157                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3158                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3159                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3160                            .dwattr $C$DW$207, DW_AT_decl_line(0x7e)
    3161                            .dwattr $C$DW$207, DW_AT_decl_column(0x0f)
    3162                    
    3163                    $C$DW$208       .dwtag  DW_TAG_member
    3164                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$22)
    3165                            .dwattr $C$DW$208, DW_AT_name("triggerNo")
    3166                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("triggerNo")
    3167                            .dwattr $C$DW$208, DW_AT_bit_offset(0x01)
    3168                            .dwattr $C$DW$208, DW_AT_bit_size(0x02)
    3169                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3170                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3171                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3172                            .dwattr $C$DW$208, DW_AT_decl_line(0x80)
    3173                            .dwattr $C$DW$208, DW_AT_decl_column(0x0f)
    3174                    
    3175                    $C$DW$209       .dwtag  DW_TAG_member
    3176                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$22)
    3177                            .dwattr $C$DW$209, DW_AT_name("pastTrig")
    3178                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("pastTrig")
    3179                            .dwattr $C$DW$209, DW_AT_bit_offset(0x00)
    3180                            .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    3181                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3182                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3183                            .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3184                            .dwattr $C$DW$209, DW_AT_decl_line(0x81)
    3185                            .dwattr $C$DW$209, DW_AT_decl_column(0x0f)
    3186                    
    3187                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3188                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x7c)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   59

    3189                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x0b)
    3190                            .dwendtag $C$DW$T$26
    3191                    
    3192                    
    3193                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3194                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    3195                    $C$DW$210       .dwtag  DW_TAG_member
    3196                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$22)
    3197                            .dwattr $C$DW$210, DW_AT_name("rule")
    3198                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("rule")
    3199                            .dwattr $C$DW$210, DW_AT_bit_offset(0x04)
    3200                            .dwattr $C$DW$210, DW_AT_bit_size(0x04)
    3201                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3202                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3203                            .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3204                            .dwattr $C$DW$210, DW_AT_decl_line(0x85)
    3205                            .dwattr $C$DW$210, DW_AT_decl_column(0x0f)
    3206                    
    3207                    $C$DW$211       .dwtag  DW_TAG_member
    3208                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$22)
    3209                            .dwattr $C$DW$211, DW_AT_name("nSkip")
    3210                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("nSkip")
    3211                            .dwattr $C$DW$211, DW_AT_bit_offset(0x00)
    3212                            .dwattr $C$DW$211, DW_AT_bit_size(0x04)
    3213                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3214                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3215                            .dwattr $C$DW$211, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3216                            .dwattr $C$DW$211, DW_AT_decl_line(0x86)
    3217                            .dwattr $C$DW$211, DW_AT_decl_column(0x0f)
    3218                    
    3219                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3220                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x84)
    3221                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0b)
    3222                            .dwendtag $C$DW$T$27
    3223                    
    3224                    
    3225                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3226                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    3227                    $C$DW$212       .dwtag  DW_TAG_member
    3228                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$22)
    3229                            .dwattr $C$DW$212, DW_AT_name("triggerType")
    3230                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("triggerType")
    3231                            .dwattr $C$DW$212, DW_AT_bit_offset(0x04)
    3232                            .dwattr $C$DW$212, DW_AT_bit_size(0x04)
    3233                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3234                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3235                            .dwattr $C$DW$212, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3236                            .dwattr $C$DW$212, DW_AT_decl_line(0xb3)
    3237                            .dwattr $C$DW$212, DW_AT_decl_column(0x0f)
    3238                    
    3239                    $C$DW$213       .dwtag  DW_TAG_member
    3240                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$22)
    3241                            .dwattr $C$DW$213, DW_AT_name("bEnaCmd")
    3242                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("bEnaCmd")
    3243                            .dwattr $C$DW$213, DW_AT_bit_offset(0x03)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   60

    3244                            .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    3245                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3246                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3247                            .dwattr $C$DW$213, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3248                            .dwattr $C$DW$213, DW_AT_decl_line(0xb4)
    3249                            .dwattr $C$DW$213, DW_AT_decl_column(0x0f)
    3250                    
    3251                    $C$DW$214       .dwtag  DW_TAG_member
    3252                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$22)
    3253                            .dwattr $C$DW$214, DW_AT_name("triggerNo")
    3254                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("triggerNo")
    3255                            .dwattr $C$DW$214, DW_AT_bit_offset(0x01)
    3256                            .dwattr $C$DW$214, DW_AT_bit_size(0x02)
    3257                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3258                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3259                            .dwattr $C$DW$214, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3260                            .dwattr $C$DW$214, DW_AT_decl_line(0xb6)
    3261                            .dwattr $C$DW$214, DW_AT_decl_column(0x0f)
    3262                    
    3263                    $C$DW$215       .dwtag  DW_TAG_member
    3264                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$22)
    3265                            .dwattr $C$DW$215, DW_AT_name("pastTrig")
    3266                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("pastTrig")
    3267                            .dwattr $C$DW$215, DW_AT_bit_offset(0x00)
    3268                            .dwattr $C$DW$215, DW_AT_bit_size(0x01)
    3269                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3270                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3271                            .dwattr $C$DW$215, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3272                            .dwattr $C$DW$215, DW_AT_decl_line(0xb7)
    3273                            .dwattr $C$DW$215, DW_AT_decl_column(0x0f)
    3274                    
    3275                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3276                            .dwattr $C$DW$T$28, DW_AT_decl_line(0xb2)
    3277                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
    3278                            .dwendtag $C$DW$T$28
    3279                    
    3280                    
    3281                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3282                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    3283                    $C$DW$216       .dwtag  DW_TAG_member
    3284                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$22)
    3285                            .dwattr $C$DW$216, DW_AT_name("rule")
    3286                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("rule")
    3287                            .dwattr $C$DW$216, DW_AT_bit_offset(0x04)
    3288                            .dwattr $C$DW$216, DW_AT_bit_size(0x04)
    3289                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3290                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3291                            .dwattr $C$DW$216, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3292                            .dwattr $C$DW$216, DW_AT_decl_line(0xbb)
    3293                            .dwattr $C$DW$216, DW_AT_decl_column(0x0f)
    3294                    
    3295                    $C$DW$217       .dwtag  DW_TAG_member
    3296                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$22)
    3297                            .dwattr $C$DW$217, DW_AT_name("nSkip")
    3298                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("nSkip")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   61

    3299                            .dwattr $C$DW$217, DW_AT_bit_offset(0x00)
    3300                            .dwattr $C$DW$217, DW_AT_bit_size(0x04)
    3301                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3302                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3303                            .dwattr $C$DW$217, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3304                            .dwattr $C$DW$217, DW_AT_decl_line(0xbc)
    3305                            .dwattr $C$DW$217, DW_AT_decl_column(0x0f)
    3306                    
    3307                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3308                            .dwattr $C$DW$T$29, DW_AT_decl_line(0xba)
    3309                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    3310                            .dwendtag $C$DW$T$29
    3311                    
    3312                    
    3313                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3314                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    3315                    $C$DW$218       .dwtag  DW_TAG_member
    3316                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$31)
    3317                            .dwattr $C$DW$218, DW_AT_name("frontEndMode")
    3318                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("frontEndMode")
    3319                            .dwattr $C$DW$218, DW_AT_bit_offset(0x0d)
    3320                            .dwattr $C$DW$218, DW_AT_bit_size(0x03)
    3321                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3322                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3323                            .dwattr $C$DW$218, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3324                            .dwattr $C$DW$218, DW_AT_decl_line(0xc9)
    3325                            .dwattr $C$DW$218, DW_AT_decl_column(0x10)
    3326                    
    3327                    $C$DW$219       .dwtag  DW_TAG_member
    3328                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$31)
    3329                            .dwattr $C$DW$219, DW_AT_name("biasMode")
    3330                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("biasMode")
    3331                            .dwattr $C$DW$219, DW_AT_bit_offset(0x0c)
    3332                            .dwattr $C$DW$219, DW_AT_bit_size(0x01)
    3333                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3334                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3335                            .dwattr $C$DW$219, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3336                            .dwattr $C$DW$219, DW_AT_decl_line(0xcf)
    3337                            .dwattr $C$DW$219, DW_AT_decl_column(0x10)
    3338                    
    3339                    $C$DW$220       .dwtag  DW_TAG_member
    3340                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$31)
    3341                            .dwattr $C$DW$220, DW_AT_name("analogCfgMode")
    3342                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("analogCfgMode")
    3343                            .dwattr $C$DW$220, DW_AT_bit_offset(0x06)
    3344                            .dwattr $C$DW$220, DW_AT_bit_size(0x06)
    3345                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3346                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3347                            .dwattr $C$DW$220, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3348                            .dwattr $C$DW$220, DW_AT_decl_line(0xd1)
    3349                            .dwattr $C$DW$220, DW_AT_decl_column(0x10)
    3350                    
    3351                    $C$DW$221       .dwtag  DW_TAG_member
    3352                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$31)
    3353                            .dwattr $C$DW$221, DW_AT_name("bNoFsPowerUp")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   62

    3354                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("bNoFsPowerUp")
    3355                            .dwattr $C$DW$221, DW_AT_bit_offset(0x05)
    3356                            .dwattr $C$DW$221, DW_AT_bit_size(0x01)
    3357                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3358                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3359                            .dwattr $C$DW$221, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3360                            .dwattr $C$DW$221, DW_AT_decl_line(0xd8)
    3361                            .dwattr $C$DW$221, DW_AT_decl_column(0x10)
    3362                    
    3363                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3364                            .dwattr $C$DW$T$32, DW_AT_decl_line(0xc8)
    3365                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x0b)
    3366                            .dwendtag $C$DW$T$32
    3367                    
    3368                    
    3369                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3370                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    3371                    $C$DW$222       .dwtag  DW_TAG_member
    3372                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$22)
    3373                            .dwattr $C$DW$222, DW_AT_name("triggerType")
    3374                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("triggerType")
    3375                            .dwattr $C$DW$222, DW_AT_bit_offset(0x04)
    3376                            .dwattr $C$DW$222, DW_AT_bit_size(0x04)
    3377                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3378                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3379                            .dwattr $C$DW$222, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3380                            .dwattr $C$DW$222, DW_AT_decl_line(0x1cf)
    3381                            .dwattr $C$DW$222, DW_AT_decl_column(0x0f)
    3382                    
    3383                    $C$DW$223       .dwtag  DW_TAG_member
    3384                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$22)
    3385                            .dwattr $C$DW$223, DW_AT_name("bEnaCmd")
    3386                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("bEnaCmd")
    3387                            .dwattr $C$DW$223, DW_AT_bit_offset(0x03)
    3388                            .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    3389                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3390                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3391                            .dwattr $C$DW$223, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3392                            .dwattr $C$DW$223, DW_AT_decl_line(0x1d0)
    3393                            .dwattr $C$DW$223, DW_AT_decl_column(0x0f)
    3394                    
    3395                    $C$DW$224       .dwtag  DW_TAG_member
    3396                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$22)
    3397                            .dwattr $C$DW$224, DW_AT_name("triggerNo")
    3398                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("triggerNo")
    3399                            .dwattr $C$DW$224, DW_AT_bit_offset(0x01)
    3400                            .dwattr $C$DW$224, DW_AT_bit_size(0x02)
    3401                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3402                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3403                            .dwattr $C$DW$224, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3404                            .dwattr $C$DW$224, DW_AT_decl_line(0x1d2)
    3405                            .dwattr $C$DW$224, DW_AT_decl_column(0x0f)
    3406                    
    3407                    $C$DW$225       .dwtag  DW_TAG_member
    3408                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$22)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   63

    3409                            .dwattr $C$DW$225, DW_AT_name("pastTrig")
    3410                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("pastTrig")
    3411                            .dwattr $C$DW$225, DW_AT_bit_offset(0x00)
    3412                            .dwattr $C$DW$225, DW_AT_bit_size(0x01)
    3413                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3414                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3415                            .dwattr $C$DW$225, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3416                            .dwattr $C$DW$225, DW_AT_decl_line(0x1d3)
    3417                            .dwattr $C$DW$225, DW_AT_decl_column(0x0f)
    3418                    
    3419                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3420                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x1ce)
    3421                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
    3422                            .dwendtag $C$DW$T$33
    3423                    
    3424                    
    3425                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3426                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    3427                    $C$DW$226       .dwtag  DW_TAG_member
    3428                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$22)
    3429                            .dwattr $C$DW$226, DW_AT_name("rule")
    3430                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("rule")
    3431                            .dwattr $C$DW$226, DW_AT_bit_offset(0x04)
    3432                            .dwattr $C$DW$226, DW_AT_bit_size(0x04)
    3433                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3434                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3435                            .dwattr $C$DW$226, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3436                            .dwattr $C$DW$226, DW_AT_decl_line(0x1d7)
    3437                            .dwattr $C$DW$226, DW_AT_decl_column(0x0f)
    3438                    
    3439                    $C$DW$227       .dwtag  DW_TAG_member
    3440                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$22)
    3441                            .dwattr $C$DW$227, DW_AT_name("nSkip")
    3442                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("nSkip")
    3443                            .dwattr $C$DW$227, DW_AT_bit_offset(0x00)
    3444                            .dwattr $C$DW$227, DW_AT_bit_size(0x04)
    3445                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3446                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3447                            .dwattr $C$DW$227, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3448                            .dwattr $C$DW$227, DW_AT_decl_line(0x1d8)
    3449                            .dwattr $C$DW$227, DW_AT_decl_column(0x0f)
    3450                    
    3451                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3452                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x1d6)
    3453                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    3454                            .dwendtag $C$DW$T$34
    3455                    
    3456                    
    3457                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3458                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    3459                    $C$DW$228       .dwtag  DW_TAG_member
    3460                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$31)
    3461                            .dwattr $C$DW$228, DW_AT_name("modType")
    3462                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("modType")
    3463                            .dwattr $C$DW$228, DW_AT_bit_offset(0x0d)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   64

    3464                            .dwattr $C$DW$228, DW_AT_bit_size(0x03)
    3465                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3466                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3467                            .dwattr $C$DW$228, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3468                            .dwattr $C$DW$228, DW_AT_decl_line(0x1db)
    3469                            .dwattr $C$DW$228, DW_AT_decl_column(0x10)
    3470                    
    3471                    $C$DW$229       .dwtag  DW_TAG_member
    3472                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$31)
    3473                            .dwattr $C$DW$229, DW_AT_name("deviation")
    3474                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("deviation")
    3475                            .dwattr $C$DW$229, DW_AT_bit_offset(0x00)
    3476                            .dwattr $C$DW$229, DW_AT_bit_size(0x0d)
    3477                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3478                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3479                            .dwattr $C$DW$229, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3480                            .dwattr $C$DW$229, DW_AT_decl_line(0x1de)
    3481                            .dwattr $C$DW$229, DW_AT_decl_column(0x10)
    3482                    
    3483                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3484                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x1da)
    3485                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    3486                            .dwendtag $C$DW$T$35
    3487                    
    3488                    
    3489                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3490                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    3491                    $C$DW$230       .dwtag  DW_TAG_member
    3492                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$37)
    3493                            .dwattr $C$DW$230, DW_AT_name("preScale")
    3494                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("preScale")
    3495                            .dwattr $C$DW$230, DW_AT_bit_offset(0x1c)
    3496                            .dwattr $C$DW$230, DW_AT_bit_size(0x04)
    3497                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3498                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3499                            .dwattr $C$DW$230, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3500                            .dwattr $C$DW$230, DW_AT_decl_line(0x1e1)
    3501                            .dwattr $C$DW$230, DW_AT_decl_column(0x10)
    3502                    
    3503                    $C$DW$231       .dwtag  DW_TAG_member
    3504                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$37)
    3505                            .dwattr $C$DW$231, DW_AT_name("rateWord")
    3506                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("rateWord")
    3507                            .dwattr $C$DW$231, DW_AT_bit_offset(0x03)
    3508                            .dwattr $C$DW$231, DW_AT_bit_size(0x15)
    3509                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3510                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3511                            .dwattr $C$DW$231, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3512                            .dwattr $C$DW$231, DW_AT_decl_line(0x1e3)
    3513                            .dwattr $C$DW$231, DW_AT_decl_column(0x10)
    3514                    
    3515                    $C$DW$232       .dwtag  DW_TAG_member
    3516                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$37)
    3517                            .dwattr $C$DW$232, DW_AT_name("decimMode")
    3518                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("decimMode")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   65

    3519                            .dwattr $C$DW$232, DW_AT_bit_offset(0x00)
    3520                            .dwattr $C$DW$232, DW_AT_bit_size(0x03)
    3521                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3522                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3523                            .dwattr $C$DW$232, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3524                            .dwattr $C$DW$232, DW_AT_decl_line(0x1e4)
    3525                            .dwattr $C$DW$232, DW_AT_decl_column(0x10)
    3526                    
    3527                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3528                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x1e0)
    3529                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    3530                            .dwendtag $C$DW$T$38
    3531                    
    3532                    
    3533                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3534                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    3535                    $C$DW$233       .dwtag  DW_TAG_member
    3536                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$22)
    3537                            .dwattr $C$DW$233, DW_AT_name("nPreamBytes")
    3538                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("nPreamBytes")
    3539                            .dwattr $C$DW$233, DW_AT_bit_offset(0x02)
    3540                            .dwattr $C$DW$233, DW_AT_bit_size(0x06)
    3541                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3542                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3543                            .dwattr $C$DW$233, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3544                            .dwattr $C$DW$233, DW_AT_decl_line(0x1ec)
    3545                            .dwattr $C$DW$233, DW_AT_decl_column(0x0f)
    3546                    
    3547                    $C$DW$234       .dwtag  DW_TAG_member
    3548                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$22)
    3549                            .dwattr $C$DW$234, DW_AT_name("preamMode")
    3550                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("preamMode")
    3551                            .dwattr $C$DW$234, DW_AT_bit_offset(0x00)
    3552                            .dwattr $C$DW$234, DW_AT_bit_size(0x02)
    3553                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3554                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3555                            .dwattr $C$DW$234, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3556                            .dwattr $C$DW$234, DW_AT_decl_line(0x1f2)
    3557                            .dwattr $C$DW$234, DW_AT_decl_column(0x0f)
    3558                    
    3559                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3560                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x1eb)
    3561                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    3562                            .dwendtag $C$DW$T$39
    3563                    
    3564                    
    3565                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3566                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    3567                    $C$DW$235       .dwtag  DW_TAG_member
    3568                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$31)
    3569                            .dwattr $C$DW$235, DW_AT_name("nSwBits")
    3570                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("nSwBits")
    3571                            .dwattr $C$DW$235, DW_AT_bit_offset(0x0a)
    3572                            .dwattr $C$DW$235, DW_AT_bit_size(0x06)
    3573                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   66

    3574                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3575                            .dwattr $C$DW$235, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3576                            .dwattr $C$DW$235, DW_AT_decl_line(0x1f8)
    3577                            .dwattr $C$DW$235, DW_AT_decl_column(0x10)
    3578                    
    3579                    $C$DW$236       .dwtag  DW_TAG_member
    3580                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$31)
    3581                            .dwattr $C$DW$236, DW_AT_name("bBitReversal")
    3582                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("bBitReversal")
    3583                            .dwattr $C$DW$236, DW_AT_bit_offset(0x09)
    3584                            .dwattr $C$DW$236, DW_AT_bit_size(0x01)
    3585                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3586                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3587                            .dwattr $C$DW$236, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3588                            .dwattr $C$DW$236, DW_AT_decl_line(0x1f9)
    3589                            .dwattr $C$DW$236, DW_AT_decl_column(0x10)
    3590                    
    3591                    $C$DW$237       .dwtag  DW_TAG_member
    3592                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$31)
    3593                            .dwattr $C$DW$237, DW_AT_name("bMsbFirst")
    3594                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("bMsbFirst")
    3595                            .dwattr $C$DW$237, DW_AT_bit_offset(0x08)
    3596                            .dwattr $C$DW$237, DW_AT_bit_size(0x01)
    3597                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3598                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3599                            .dwattr $C$DW$237, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3600                            .dwattr $C$DW$237, DW_AT_decl_line(0x1fb)
    3601                            .dwattr $C$DW$237, DW_AT_decl_column(0x10)
    3602                    
    3603                    $C$DW$238       .dwtag  DW_TAG_member
    3604                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$31)
    3605                            .dwattr $C$DW$238, DW_AT_name("fecMode")
    3606                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("fecMode")
    3607                            .dwattr $C$DW$238, DW_AT_bit_offset(0x04)
    3608                            .dwattr $C$DW$238, DW_AT_bit_size(0x04)
    3609                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3610                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3611                            .dwattr $C$DW$238, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3612                            .dwattr $C$DW$238, DW_AT_decl_line(0x1fd)
    3613                            .dwattr $C$DW$238, DW_AT_decl_column(0x10)
    3614                    
    3615                    $C$DW$239       .dwtag  DW_TAG_member
    3616                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$31)
    3617                            .dwattr $C$DW$239, DW_AT_name("whitenMode")
    3618                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("whitenMode")
    3619                            .dwattr $C$DW$239, DW_AT_bit_offset(0x00)
    3620                            .dwattr $C$DW$239, DW_AT_bit_size(0x03)
    3621                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3622                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3623                            .dwattr $C$DW$239, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3624                            .dwattr $C$DW$239, DW_AT_decl_line(0x203)
    3625                            .dwattr $C$DW$239, DW_AT_decl_column(0x10)
    3626                    
    3627                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3628                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x1f7)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   67

    3629                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    3630                            .dwendtag $C$DW$T$40
    3631                    
    3632                    
    3633                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3634                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    3635                    $C$DW$240       .dwtag  DW_TAG_member
    3636                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$31)
    3637                            .dwattr $C$DW$240, DW_AT_name("frontEndMode")
    3638                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("frontEndMode")
    3639                            .dwattr $C$DW$240, DW_AT_bit_offset(0x0d)
    3640                            .dwattr $C$DW$240, DW_AT_bit_size(0x03)
    3641                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3642                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3643                            .dwattr $C$DW$240, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3644                            .dwattr $C$DW$240, DW_AT_decl_line(0x20d)
    3645                            .dwattr $C$DW$240, DW_AT_decl_column(0x10)
    3646                    
    3647                    $C$DW$241       .dwtag  DW_TAG_member
    3648                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$31)
    3649                            .dwattr $C$DW$241, DW_AT_name("biasMode")
    3650                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("biasMode")
    3651                            .dwattr $C$DW$241, DW_AT_bit_offset(0x0c)
    3652                            .dwattr $C$DW$241, DW_AT_bit_size(0x01)
    3653                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3654                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3655                            .dwattr $C$DW$241, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3656                            .dwattr $C$DW$241, DW_AT_decl_line(0x213)
    3657                            .dwattr $C$DW$241, DW_AT_decl_column(0x10)
    3658                    
    3659                    $C$DW$242       .dwtag  DW_TAG_member
    3660                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$31)
    3661                            .dwattr $C$DW$242, DW_AT_name("analogCfgMode")
    3662                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("analogCfgMode")
    3663                            .dwattr $C$DW$242, DW_AT_bit_offset(0x06)
    3664                            .dwattr $C$DW$242, DW_AT_bit_size(0x06)
    3665                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3666                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3667                            .dwattr $C$DW$242, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3668                            .dwattr $C$DW$242, DW_AT_decl_line(0x215)
    3669                            .dwattr $C$DW$242, DW_AT_decl_column(0x10)
    3670                    
    3671                    $C$DW$243       .dwtag  DW_TAG_member
    3672                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$31)
    3673                            .dwattr $C$DW$243, DW_AT_name("bNoFsPowerUp")
    3674                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("bNoFsPowerUp")
    3675                            .dwattr $C$DW$243, DW_AT_bit_offset(0x05)
    3676                            .dwattr $C$DW$243, DW_AT_bit_size(0x01)
    3677                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3678                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3679                            .dwattr $C$DW$243, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3680                            .dwattr $C$DW$243, DW_AT_decl_line(0x21c)
    3681                            .dwattr $C$DW$243, DW_AT_decl_column(0x10)
    3682                    
    3683                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   68

    3684                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x20c)
    3685                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    3686                            .dwendtag $C$DW$T$41
    3687                    
    3688                    
    3689                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    3690                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    3691                    $C$DW$244       .dwtag  DW_TAG_member
    3692                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$22)
    3693                            .dwattr $C$DW$244, DW_AT_name("triggerType")
    3694                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("triggerType")
    3695                            .dwattr $C$DW$244, DW_AT_bit_offset(0x04)
    3696                            .dwattr $C$DW$244, DW_AT_bit_size(0x04)
    3697                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3698                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3699                            .dwattr $C$DW$244, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3700                            .dwattr $C$DW$244, DW_AT_decl_line(0x232)
    3701                            .dwattr $C$DW$244, DW_AT_decl_column(0x0f)
    3702                    
    3703                    $C$DW$245       .dwtag  DW_TAG_member
    3704                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$22)
    3705                            .dwattr $C$DW$245, DW_AT_name("bEnaCmd")
    3706                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("bEnaCmd")
    3707                            .dwattr $C$DW$245, DW_AT_bit_offset(0x03)
    3708                            .dwattr $C$DW$245, DW_AT_bit_size(0x01)
    3709                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3710                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3711                            .dwattr $C$DW$245, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3712                            .dwattr $C$DW$245, DW_AT_decl_line(0x233)
    3713                            .dwattr $C$DW$245, DW_AT_decl_column(0x0f)
    3714                    
    3715                    $C$DW$246       .dwtag  DW_TAG_member
    3716                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$22)
    3717                            .dwattr $C$DW$246, DW_AT_name("triggerNo")
    3718                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("triggerNo")
    3719                            .dwattr $C$DW$246, DW_AT_bit_offset(0x01)
    3720                            .dwattr $C$DW$246, DW_AT_bit_size(0x02)
    3721                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3722                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3723                            .dwattr $C$DW$246, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3724                            .dwattr $C$DW$246, DW_AT_decl_line(0x235)
    3725                            .dwattr $C$DW$246, DW_AT_decl_column(0x0f)
    3726                    
    3727                    $C$DW$247       .dwtag  DW_TAG_member
    3728                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$22)
    3729                            .dwattr $C$DW$247, DW_AT_name("pastTrig")
    3730                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("pastTrig")
    3731                            .dwattr $C$DW$247, DW_AT_bit_offset(0x00)
    3732                            .dwattr $C$DW$247, DW_AT_bit_size(0x01)
    3733                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3734                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3735                            .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3736                            .dwattr $C$DW$247, DW_AT_decl_line(0x236)
    3737                            .dwattr $C$DW$247, DW_AT_decl_column(0x0f)
    3738                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   69

    3739                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3740                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x231)
    3741                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    3742                            .dwendtag $C$DW$T$42
    3743                    
    3744                    
    3745                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3746                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    3747                    $C$DW$248       .dwtag  DW_TAG_member
    3748                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$22)
    3749                            .dwattr $C$DW$248, DW_AT_name("rule")
    3750                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("rule")
    3751                            .dwattr $C$DW$248, DW_AT_bit_offset(0x04)
    3752                            .dwattr $C$DW$248, DW_AT_bit_size(0x04)
    3753                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3754                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3755                            .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3756                            .dwattr $C$DW$248, DW_AT_decl_line(0x23a)
    3757                            .dwattr $C$DW$248, DW_AT_decl_column(0x0f)
    3758                    
    3759                    $C$DW$249       .dwtag  DW_TAG_member
    3760                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$22)
    3761                            .dwattr $C$DW$249, DW_AT_name("nSkip")
    3762                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("nSkip")
    3763                            .dwattr $C$DW$249, DW_AT_bit_offset(0x00)
    3764                            .dwattr $C$DW$249, DW_AT_bit_size(0x04)
    3765                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3766                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3767                            .dwattr $C$DW$249, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3768                            .dwattr $C$DW$249, DW_AT_decl_line(0x23b)
    3769                            .dwattr $C$DW$249, DW_AT_decl_column(0x0f)
    3770                    
    3771                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3772                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x239)
    3773                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    3774                            .dwendtag $C$DW$T$43
    3775                    
    3776                    
    3777                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3778                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    3779                    $C$DW$250       .dwtag  DW_TAG_member
    3780                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$31)
    3781                            .dwattr $C$DW$250, DW_AT_name("modType")
    3782                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("modType")
    3783                            .dwattr $C$DW$250, DW_AT_bit_offset(0x0d)
    3784                            .dwattr $C$DW$250, DW_AT_bit_size(0x03)
    3785                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3786                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3787                            .dwattr $C$DW$250, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3788                            .dwattr $C$DW$250, DW_AT_decl_line(0x23e)
    3789                            .dwattr $C$DW$250, DW_AT_decl_column(0x10)
    3790                    
    3791                    $C$DW$251       .dwtag  DW_TAG_member
    3792                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$31)
    3793                            .dwattr $C$DW$251, DW_AT_name("deviation")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   70

    3794                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("deviation")
    3795                            .dwattr $C$DW$251, DW_AT_bit_offset(0x00)
    3796                            .dwattr $C$DW$251, DW_AT_bit_size(0x0d)
    3797                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3798                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3799                            .dwattr $C$DW$251, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3800                            .dwattr $C$DW$251, DW_AT_decl_line(0x241)
    3801                            .dwattr $C$DW$251, DW_AT_decl_column(0x10)
    3802                    
    3803                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3804                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x23d)
    3805                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x0b)
    3806                            .dwendtag $C$DW$T$44
    3807                    
    3808                    
    3809                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    3810                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    3811                    $C$DW$252       .dwtag  DW_TAG_member
    3812                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$37)
    3813                            .dwattr $C$DW$252, DW_AT_name("preScale")
    3814                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("preScale")
    3815                            .dwattr $C$DW$252, DW_AT_bit_offset(0x1c)
    3816                            .dwattr $C$DW$252, DW_AT_bit_size(0x04)
    3817                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3818                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3819                            .dwattr $C$DW$252, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3820                            .dwattr $C$DW$252, DW_AT_decl_line(0x244)
    3821                            .dwattr $C$DW$252, DW_AT_decl_column(0x10)
    3822                    
    3823                    $C$DW$253       .dwtag  DW_TAG_member
    3824                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$37)
    3825                            .dwattr $C$DW$253, DW_AT_name("rateWord")
    3826                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("rateWord")
    3827                            .dwattr $C$DW$253, DW_AT_bit_offset(0x03)
    3828                            .dwattr $C$DW$253, DW_AT_bit_size(0x15)
    3829                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3830                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3831                            .dwattr $C$DW$253, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3832                            .dwattr $C$DW$253, DW_AT_decl_line(0x246)
    3833                            .dwattr $C$DW$253, DW_AT_decl_column(0x10)
    3834                    
    3835                    $C$DW$254       .dwtag  DW_TAG_member
    3836                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$37)
    3837                            .dwattr $C$DW$254, DW_AT_name("decimMode")
    3838                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("decimMode")
    3839                            .dwattr $C$DW$254, DW_AT_bit_offset(0x00)
    3840                            .dwattr $C$DW$254, DW_AT_bit_size(0x03)
    3841                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3842                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3843                            .dwattr $C$DW$254, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3844                            .dwattr $C$DW$254, DW_AT_decl_line(0x247)
    3845                            .dwattr $C$DW$254, DW_AT_decl_column(0x10)
    3846                    
    3847                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3848                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x243)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   71

    3849                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0b)
    3850                            .dwendtag $C$DW$T$45
    3851                    
    3852                    
    3853                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    3854                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    3855                    $C$DW$255       .dwtag  DW_TAG_member
    3856                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$22)
    3857                            .dwattr $C$DW$255, DW_AT_name("nPreamBytes")
    3858                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("nPreamBytes")
    3859                            .dwattr $C$DW$255, DW_AT_bit_offset(0x02)
    3860                            .dwattr $C$DW$255, DW_AT_bit_size(0x06)
    3861                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3862                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3863                            .dwattr $C$DW$255, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3864                            .dwattr $C$DW$255, DW_AT_decl_line(0x24f)
    3865                            .dwattr $C$DW$255, DW_AT_decl_column(0x0f)
    3866                    
    3867                    $C$DW$256       .dwtag  DW_TAG_member
    3868                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$22)
    3869                            .dwattr $C$DW$256, DW_AT_name("preamMode")
    3870                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("preamMode")
    3871                            .dwattr $C$DW$256, DW_AT_bit_offset(0x00)
    3872                            .dwattr $C$DW$256, DW_AT_bit_size(0x02)
    3873                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3874                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3875                            .dwattr $C$DW$256, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3876                            .dwattr $C$DW$256, DW_AT_decl_line(0x255)
    3877                            .dwattr $C$DW$256, DW_AT_decl_column(0x0f)
    3878                    
    3879                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3880                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x24e)
    3881                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x0b)
    3882                            .dwendtag $C$DW$T$46
    3883                    
    3884                    
    3885                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3886                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    3887                    $C$DW$257       .dwtag  DW_TAG_member
    3888                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$31)
    3889                            .dwattr $C$DW$257, DW_AT_name("nSwBits")
    3890                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("nSwBits")
    3891                            .dwattr $C$DW$257, DW_AT_bit_offset(0x0a)
    3892                            .dwattr $C$DW$257, DW_AT_bit_size(0x06)
    3893                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3894                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3895                            .dwattr $C$DW$257, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3896                            .dwattr $C$DW$257, DW_AT_decl_line(0x25b)
    3897                            .dwattr $C$DW$257, DW_AT_decl_column(0x10)
    3898                    
    3899                    $C$DW$258       .dwtag  DW_TAG_member
    3900                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$31)
    3901                            .dwattr $C$DW$258, DW_AT_name("bBitReversal")
    3902                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("bBitReversal")
    3903                            .dwattr $C$DW$258, DW_AT_bit_offset(0x09)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   72

    3904                            .dwattr $C$DW$258, DW_AT_bit_size(0x01)
    3905                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3906                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3907                            .dwattr $C$DW$258, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3908                            .dwattr $C$DW$258, DW_AT_decl_line(0x25c)
    3909                            .dwattr $C$DW$258, DW_AT_decl_column(0x10)
    3910                    
    3911                    $C$DW$259       .dwtag  DW_TAG_member
    3912                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$31)
    3913                            .dwattr $C$DW$259, DW_AT_name("bMsbFirst")
    3914                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("bMsbFirst")
    3915                            .dwattr $C$DW$259, DW_AT_bit_offset(0x08)
    3916                            .dwattr $C$DW$259, DW_AT_bit_size(0x01)
    3917                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3918                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3919                            .dwattr $C$DW$259, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3920                            .dwattr $C$DW$259, DW_AT_decl_line(0x25e)
    3921                            .dwattr $C$DW$259, DW_AT_decl_column(0x10)
    3922                    
    3923                    $C$DW$260       .dwtag  DW_TAG_member
    3924                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$31)
    3925                            .dwattr $C$DW$260, DW_AT_name("fecMode")
    3926                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("fecMode")
    3927                            .dwattr $C$DW$260, DW_AT_bit_offset(0x04)
    3928                            .dwattr $C$DW$260, DW_AT_bit_size(0x04)
    3929                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3930                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3931                            .dwattr $C$DW$260, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3932                            .dwattr $C$DW$260, DW_AT_decl_line(0x260)
    3933                            .dwattr $C$DW$260, DW_AT_decl_column(0x10)
    3934                    
    3935                    $C$DW$261       .dwtag  DW_TAG_member
    3936                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$31)
    3937                            .dwattr $C$DW$261, DW_AT_name("whitenMode")
    3938                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("whitenMode")
    3939                            .dwattr $C$DW$261, DW_AT_bit_offset(0x00)
    3940                            .dwattr $C$DW$261, DW_AT_bit_size(0x03)
    3941                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3942                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3943                            .dwattr $C$DW$261, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3944                            .dwattr $C$DW$261, DW_AT_decl_line(0x266)
    3945                            .dwattr $C$DW$261, DW_AT_decl_column(0x10)
    3946                    
    3947                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3948                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x25a)
    3949                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x0b)
    3950                            .dwendtag $C$DW$T$47
    3951                    
    3952                    
    3953                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    3954                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    3955                    $C$DW$262       .dwtag  DW_TAG_member
    3956                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$31)
    3957                            .dwattr $C$DW$262, DW_AT_name("frontEndMode")
    3958                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("frontEndMode")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   73

    3959                            .dwattr $C$DW$262, DW_AT_bit_offset(0x0d)
    3960                            .dwattr $C$DW$262, DW_AT_bit_size(0x03)
    3961                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3962                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3963                            .dwattr $C$DW$262, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3964                            .dwattr $C$DW$262, DW_AT_decl_line(0x270)
    3965                            .dwattr $C$DW$262, DW_AT_decl_column(0x10)
    3966                    
    3967                    $C$DW$263       .dwtag  DW_TAG_member
    3968                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$31)
    3969                            .dwattr $C$DW$263, DW_AT_name("biasMode")
    3970                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("biasMode")
    3971                            .dwattr $C$DW$263, DW_AT_bit_offset(0x0c)
    3972                            .dwattr $C$DW$263, DW_AT_bit_size(0x01)
    3973                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3974                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3975                            .dwattr $C$DW$263, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3976                            .dwattr $C$DW$263, DW_AT_decl_line(0x276)
    3977                            .dwattr $C$DW$263, DW_AT_decl_column(0x10)
    3978                    
    3979                    $C$DW$264       .dwtag  DW_TAG_member
    3980                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$31)
    3981                            .dwattr $C$DW$264, DW_AT_name("analogCfgMode")
    3982                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("analogCfgMode")
    3983                            .dwattr $C$DW$264, DW_AT_bit_offset(0x06)
    3984                            .dwattr $C$DW$264, DW_AT_bit_size(0x06)
    3985                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3986                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3987                            .dwattr $C$DW$264, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3988                            .dwattr $C$DW$264, DW_AT_decl_line(0x278)
    3989                            .dwattr $C$DW$264, DW_AT_decl_column(0x10)
    3990                    
    3991                    $C$DW$265       .dwtag  DW_TAG_member
    3992                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$31)
    3993                            .dwattr $C$DW$265, DW_AT_name("bNoFsPowerUp")
    3994                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("bNoFsPowerUp")
    3995                            .dwattr $C$DW$265, DW_AT_bit_offset(0x05)
    3996                            .dwattr $C$DW$265, DW_AT_bit_size(0x01)
    3997                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3998                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3999                            .dwattr $C$DW$265, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4000                            .dwattr $C$DW$265, DW_AT_decl_line(0x27f)
    4001                            .dwattr $C$DW$265, DW_AT_decl_column(0x10)
    4002                    
    4003                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4004                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x26f)
    4005                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x0b)
    4006                            .dwendtag $C$DW$T$48
    4007                    
    4008                    
    4009                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    4010                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x24)
    4011                    $C$DW$266       .dwtag  DW_TAG_member
    4012                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$37)
    4013                            .dwattr $C$DW$266, DW_AT_name("nInactivityTimeout")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   74

    4014                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("nInactivityTimeout")
    4015                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4016                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    4017                            .dwattr $C$DW$266, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4018                            .dwattr $C$DW$266, DW_AT_decl_line(0x515)
    4019                            .dwattr $C$DW$266, DW_AT_decl_column(0x1d)
    4020                    
    4021                    $C$DW$267       .dwtag  DW_TAG_member
    4022                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$50)
    4023                            .dwattr $C$DW$267, DW_AT_name("pRfMode")
    4024                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("pRfMode")
    4025                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4026                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4027                            .dwattr $C$DW$267, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4028                            .dwattr $C$DW$267, DW_AT_decl_line(0x516)
    4029                            .dwattr $C$DW$267, DW_AT_decl_column(0x1d)
    4030                    
    4031                    $C$DW$268       .dwtag  DW_TAG_member
    4032                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$52)
    4033                            .dwattr $C$DW$268, DW_AT_name("pRadioSetup")
    4034                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("pRadioSetup")
    4035                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4036                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    4037                            .dwattr $C$DW$268, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4038                            .dwattr $C$DW$268, DW_AT_decl_line(0x517)
    4039                            .dwattr $C$DW$268, DW_AT_decl_column(0x1d)
    4040                    
    4041                    $C$DW$269       .dwtag  DW_TAG_member
    4042                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$37)
    4043                            .dwattr $C$DW$269, DW_AT_name("nPowerUpDuration")
    4044                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("nPowerUpDuration")
    4045                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4046                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4047                            .dwattr $C$DW$269, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4048                            .dwattr $C$DW$269, DW_AT_decl_line(0x518)
    4049                            .dwattr $C$DW$269, DW_AT_decl_column(0x1d)
    4050                    
    4051                    $C$DW$270       .dwtag  DW_TAG_member
    4052                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$53)
    4053                            .dwattr $C$DW$270, DW_AT_name("bMeasurePowerUpDuration")
    4054                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("bMeasurePowerUpDuration")
    4055                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4056                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    4057                            .dwattr $C$DW$270, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4058                            .dwattr $C$DW$270, DW_AT_decl_line(0x519)
    4059                            .dwattr $C$DW$270, DW_AT_decl_column(0x1d)
    4060                    
    4061                    $C$DW$271       .dwtag  DW_TAG_member
    4062                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$53)
    4063                            .dwattr $C$DW$271, DW_AT_name("bUpdateSetup")
    4064                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("bUpdateSetup")
    4065                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4066                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    4067                            .dwattr $C$DW$271, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4068                            .dwattr $C$DW$271, DW_AT_decl_line(0x51a)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   75

    4069                            .dwattr $C$DW$271, DW_AT_decl_column(0x1d)
    4070                    
    4071                    $C$DW$272       .dwtag  DW_TAG_member
    4072                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$31)
    4073                            .dwattr $C$DW$272, DW_AT_name("nPowerUpDurationMargin")
    4074                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("nPowerUpDurationMargin")
    4075                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4076                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    4077                            .dwattr $C$DW$272, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4078                            .dwattr $C$DW$272, DW_AT_decl_line(0x51b)
    4079                            .dwattr $C$DW$272, DW_AT_decl_column(0x1d)
    4080                    
    4081                    $C$DW$273       .dwtag  DW_TAG_member
    4082                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$3)
    4083                            .dwattr $C$DW$273, DW_AT_name("pPowerCb")
    4084                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("pPowerCb")
    4085                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4086                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4087                            .dwattr $C$DW$273, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4088                            .dwattr $C$DW$273, DW_AT_decl_line(0x51c)
    4089                            .dwattr $C$DW$273, DW_AT_decl_column(0x1d)
    4090                    
    4091                    $C$DW$274       .dwtag  DW_TAG_member
    4092                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$3)
    4093                            .dwattr $C$DW$274, DW_AT_name("pErrCb")
    4094                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("pErrCb")
    4095                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4096                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    4097                            .dwattr $C$DW$274, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4098                            .dwattr $C$DW$274, DW_AT_decl_line(0x51d)
    4099                            .dwattr $C$DW$274, DW_AT_decl_column(0x1d)
    4100                    
    4101                    $C$DW$275       .dwtag  DW_TAG_member
    4102                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$3)
    4103                            .dwattr $C$DW$275, DW_AT_name("pClientEventCb")
    4104                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("pClientEventCb")
    4105                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4106                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    4107                            .dwattr $C$DW$275, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4108                            .dwattr $C$DW$275, DW_AT_decl_line(0x51e)
    4109                            .dwattr $C$DW$275, DW_AT_decl_column(0x1d)
    4110                    
    4111                    $C$DW$276       .dwtag  DW_TAG_member
    4112                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$54)
    4113                            .dwattr $C$DW$276, DW_AT_name("nClientEventMask")
    4114                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("nClientEventMask")
    4115                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4116                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    4117                            .dwattr $C$DW$276, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4118                            .dwattr $C$DW$276, DW_AT_decl_line(0x51f)
    4119                            .dwattr $C$DW$276, DW_AT_decl_column(0x1d)
    4120                    
    4121                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4122                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x514)
    4123                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   76

    4124                            .dwendtag $C$DW$T$55
    4125                    
    4126                    
    4127                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    4128                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
    4129                    $C$DW$277       .dwtag  DW_TAG_member
    4130                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$22)
    4131                            .dwattr $C$DW$277, DW_AT_name("triggerType")
    4132                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("triggerType")
    4133                            .dwattr $C$DW$277, DW_AT_bit_offset(0x04)
    4134                            .dwattr $C$DW$277, DW_AT_bit_size(0x04)
    4135                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4136                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4137                            .dwattr $C$DW$277, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4138                            .dwattr $C$DW$277, DW_AT_decl_line(0xee)
    4139                            .dwattr $C$DW$277, DW_AT_decl_column(0x0f)
    4140                    
    4141                    $C$DW$278       .dwtag  DW_TAG_member
    4142                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$22)
    4143                            .dwattr $C$DW$278, DW_AT_name("bEnaCmd")
    4144                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("bEnaCmd")
    4145                            .dwattr $C$DW$278, DW_AT_bit_offset(0x03)
    4146                            .dwattr $C$DW$278, DW_AT_bit_size(0x01)
    4147                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4148                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    4149                            .dwattr $C$DW$278, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4150                            .dwattr $C$DW$278, DW_AT_decl_line(0xef)
    4151                            .dwattr $C$DW$278, DW_AT_decl_column(0x0f)
    4152                    
    4153                    $C$DW$279       .dwtag  DW_TAG_member
    4154                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$22)
    4155                            .dwattr $C$DW$279, DW_AT_name("triggerNo")
    4156                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("triggerNo")
    4157                            .dwattr $C$DW$279, DW_AT_bit_offset(0x01)
    4158                            .dwattr $C$DW$279, DW_AT_bit_size(0x02)
    4159                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4160                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    4161                            .dwattr $C$DW$279, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4162                            .dwattr $C$DW$279, DW_AT_decl_line(0xf1)
    4163                            .dwattr $C$DW$279, DW_AT_decl_column(0x0f)
    4164                    
    4165                    $C$DW$280       .dwtag  DW_TAG_member
    4166                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$22)
    4167                            .dwattr $C$DW$280, DW_AT_name("pastTrig")
    4168                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("pastTrig")
    4169                            .dwattr $C$DW$280, DW_AT_bit_offset(0x00)
    4170                            .dwattr $C$DW$280, DW_AT_bit_size(0x01)
    4171                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4172                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    4173                            .dwattr $C$DW$280, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4174                            .dwattr $C$DW$280, DW_AT_decl_line(0xf2)
    4175                            .dwattr $C$DW$280, DW_AT_decl_column(0x0f)
    4176                    
    4177                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4178                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xed)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{5C725042-4DF9-42C5-9CCC-DE35BF480495} PAGE   77

    4179                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x0b)
    4180                            .dwendtag $C$DW$T$56
    4181                    
    4182                    
    4183                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    4184                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
    4185                    $C$DW$281       .dwtag  DW_TAG_member
    4186                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$22)
    4187                            .dwattr $C$DW$281, DW_AT_name("rule")
    4188                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("rule")
