TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Nov 28 13:22:05 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/HAL/target/dbg.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Adrian\workspace_v8\collector_cc1350lp\collector_cc
      13 00000000                   .sect   ".const"
      14                            .align  4

C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   62

    3354                            .dwattr $C$DW$T$917, DW_AT_name("tFlashStateCommandsType")
    3355                            .dwattr $C$DW$T$917, DW_AT_type(*$C$DW$T$916)
    3356                            .dwattr $C$DW$T$917, DW_AT_language(DW_LANG_C)
    3357                            .dwattr $C$DW$T$917, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    3358                            .dwattr $C$DW$T$917, DW_AT_decl_line(0xb0)
    3359                            .dwattr $C$DW$T$917, DW_AT_decl_column(0x03)
    3360                    
    3361                    
    3362                    $C$DW$T$918     .dwtag  DW_TAG_enumeration_type
    3363                            .dwattr $C$DW$T$918, DW_AT_byte_size(0x01)
    3364                    $C$DW$328       .dwtag  DW_TAG_enumerator
    3365                            .dwattr $C$DW$328, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    3366                            .dwattr $C$DW$328, DW_AT_const_value(0xe0)
    3367                            .dwattr $C$DW$328, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3368                            .dwattr $C$DW$328, DW_AT_decl_line(0x3de)
    3369                            .dwattr $C$DW$328, DW_AT_decl_column(0x04)
    3370                    
    3371                    $C$DW$329       .dwtag  DW_TAG_enumerator
    3372                            .dwattr $C$DW$329, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    3373                            .dwattr $C$DW$329, DW_AT_const_value(0xe1)
    3374                            .dwattr $C$DW$329, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3375                            .dwattr $C$DW$329, DW_AT_decl_line(0x3e0)
    3376                            .dwattr $C$DW$329, DW_AT_decl_column(0x04)
    3377                    
    3378                    $C$DW$330       .dwtag  DW_TAG_enumerator
    3379                            .dwattr $C$DW$330, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    3380                            .dwattr $C$DW$330, DW_AT_const_value(0xe2)
    3381                            .dwattr $C$DW$330, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3382                            .dwattr $C$DW$330, DW_AT_decl_line(0x3e2)
    3383                            .dwattr $C$DW$330, DW_AT_decl_column(0x04)
    3384                    
    3385                    $C$DW$331       .dwtag  DW_TAG_enumerator
    3386                            .dwattr $C$DW$331, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    3387                            .dwattr $C$DW$331, DW_AT_const_value(0xe3)
    3388                            .dwattr $C$DW$331, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3389                            .dwattr $C$DW$331, DW_AT_decl_line(0x3e4)
    3390                            .dwattr $C$DW$331, DW_AT_decl_column(0x04)
    3391                    
    3392                    $C$DW$332       .dwtag  DW_TAG_enumerator
    3393                            .dwattr $C$DW$332, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    3394                            .dwattr $C$DW$332, DW_AT_const_value(0xe4)
    3395                            .dwattr $C$DW$332, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3396                            .dwattr $C$DW$332, DW_AT_decl_line(0x3e6)
    3397                            .dwattr $C$DW$332, DW_AT_decl_column(0x04)
    3398                    
    3399                    $C$DW$333       .dwtag  DW_TAG_enumerator
    3400                            .dwattr $C$DW$333, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    3401                            .dwattr $C$DW$333, DW_AT_const_value(0xe5)
    3402                            .dwattr $C$DW$333, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3403                            .dwattr $C$DW$333, DW_AT_decl_line(0x3e8)
    3404                            .dwattr $C$DW$333, DW_AT_decl_column(0x04)
    3405                    
    3406                            .dwattr $C$DW$T$918, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3407                            .dwattr $C$DW$T$918, DW_AT_decl_line(0x3dc)
    3408                            .dwattr $C$DW$T$918, DW_AT_decl_column(0x01)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   63

    3409                            .dwendtag $C$DW$T$918
    3410                    
    3411                    $C$DW$T$919     .dwtag  DW_TAG_typedef
    3412                            .dwattr $C$DW$T$919, DW_AT_name("ICall_RemotiCmdEvent_t")
    3413                            .dwattr $C$DW$T$919, DW_AT_type(*$C$DW$T$918)
    3414                            .dwattr $C$DW$T$919, DW_AT_language(DW_LANG_C)
    3415                            .dwattr $C$DW$T$919, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3416                            .dwattr $C$DW$T$919, DW_AT_decl_line(0x3e9)
    3417                            .dwattr $C$DW$T$919, DW_AT_decl_column(0x02)
    3418                    
    3419                    
    3420                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    3421                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    3422                    $C$DW$334       .dwtag  DW_TAG_member
    3423                            .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$14)
    3424                            .dwattr $C$DW$334, DW_AT_name("__max_align1")
    3425                            .dwattr $C$DW$334, DW_AT_TI_symbol_name("__max_align1")
    3426                            .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3427                            .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3428                            .dwattr $C$DW$334, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    3429                            .dwattr $C$DW$334, DW_AT_decl_line(0x70)
    3430                            .dwattr $C$DW$334, DW_AT_decl_column(0x0c)
    3431                    
    3432                    $C$DW$335       .dwtag  DW_TAG_member
    3433                            .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$18)
    3434                            .dwattr $C$DW$335, DW_AT_name("__max_align2")
    3435                            .dwattr $C$DW$335, DW_AT_TI_symbol_name("__max_align2")
    3436                            .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3437                            .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3438                            .dwattr $C$DW$335, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    3439                            .dwattr $C$DW$335, DW_AT_decl_line(0x71)
    3440                            .dwattr $C$DW$335, DW_AT_decl_column(0x0e)
    3441                    
    3442                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    3443                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x6f)
    3444                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    3445                            .dwendtag $C$DW$T$21
    3446                    
    3447                    $C$DW$T$920     .dwtag  DW_TAG_typedef
    3448                            .dwattr $C$DW$T$920, DW_AT_name("__max_align_t")
    3449                            .dwattr $C$DW$T$920, DW_AT_type(*$C$DW$T$21)
    3450                            .dwattr $C$DW$T$920, DW_AT_language(DW_LANG_C)
    3451                            .dwattr $C$DW$T$920, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    3452                            .dwattr $C$DW$T$920, DW_AT_decl_line(0x72)
    3453                            .dwattr $C$DW$T$920, DW_AT_decl_column(0x03)
    3454                    
    3455                    
    3456                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3457                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x08)
    3458                    $C$DW$336       .dwtag  DW_TAG_member
    3459                            .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$24)
    3460                            .dwattr $C$DW$336, DW_AT_name("pCurrEntry")
    3461                            .dwattr $C$DW$336, DW_AT_TI_symbol_name("pCurrEntry")
    3462                            .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3463                            .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   64

    3464                            .dwattr $C$DW$336, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3465                            .dwattr $C$DW$336, DW_AT_decl_line(0x41)
    3466                            .dwattr $C$DW$336, DW_AT_decl_column(0x0d)
    3467                    
    3468                    $C$DW$337       .dwtag  DW_TAG_member
    3469                            .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$24)
    3470                            .dwattr $C$DW$337, DW_AT_name("pLastEntry")
    3471                            .dwattr $C$DW$337, DW_AT_TI_symbol_name("pLastEntry")
    3472                            .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3473                            .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3474                            .dwattr $C$DW$337, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3475                            .dwattr $C$DW$337, DW_AT_decl_line(0x42)
    3476                            .dwattr $C$DW$337, DW_AT_decl_column(0x0d)
    3477                    
    3478                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    3479                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x40)
    3480                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3481                            .dwendtag $C$DW$T$25
    3482                    
    3483                    $C$DW$T$756     .dwtag  DW_TAG_typedef
    3484                            .dwattr $C$DW$T$756, DW_AT_name("dataQueue_t")
    3485                            .dwattr $C$DW$T$756, DW_AT_type(*$C$DW$T$25)
    3486                            .dwattr $C$DW$T$756, DW_AT_language(DW_LANG_C)
    3487                            .dwattr $C$DW$T$756, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    3488                            .dwattr $C$DW$T$756, DW_AT_decl_line(0x43)
    3489                            .dwattr $C$DW$T$756, DW_AT_decl_column(0x03)
    3490                    
    3491                    $C$DW$T$757     .dwtag  DW_TAG_pointer_type
    3492                            .dwattr $C$DW$T$757, DW_AT_type(*$C$DW$T$756)
    3493                            .dwattr $C$DW$T$757, DW_AT_address_class(0x20)
    3494                    
    3495                    
    3496                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3497                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    3498                    $C$DW$338       .dwtag  DW_TAG_member
    3499                            .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$23)
    3500                            .dwattr $C$DW$338, DW_AT_name("triggerType")
    3501                            .dwattr $C$DW$338, DW_AT_TI_symbol_name("triggerType")
    3502                            .dwattr $C$DW$338, DW_AT_bit_offset(0x04)
    3503                            .dwattr $C$DW$338, DW_AT_bit_size(0x04)
    3504                            .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3505                            .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3506                            .dwattr $C$DW$338, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3507                            .dwattr $C$DW$338, DW_AT_decl_line(0x7d)
    3508                            .dwattr $C$DW$338, DW_AT_decl_column(0x0f)
    3509                    
    3510                    $C$DW$339       .dwtag  DW_TAG_member
    3511                            .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$23)
    3512                            .dwattr $C$DW$339, DW_AT_name("bEnaCmd")
    3513                            .dwattr $C$DW$339, DW_AT_TI_symbol_name("bEnaCmd")
    3514                            .dwattr $C$DW$339, DW_AT_bit_offset(0x03)
    3515                            .dwattr $C$DW$339, DW_AT_bit_size(0x01)
    3516                            .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3517                            .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3518                            .dwattr $C$DW$339, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   65

    3519                            .dwattr $C$DW$339, DW_AT_decl_line(0x7e)
    3520                            .dwattr $C$DW$339, DW_AT_decl_column(0x0f)
    3521                    
    3522                    $C$DW$340       .dwtag  DW_TAG_member
    3523                            .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$23)
    3524                            .dwattr $C$DW$340, DW_AT_name("triggerNo")
    3525                            .dwattr $C$DW$340, DW_AT_TI_symbol_name("triggerNo")
    3526                            .dwattr $C$DW$340, DW_AT_bit_offset(0x01)
    3527                            .dwattr $C$DW$340, DW_AT_bit_size(0x02)
    3528                            .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3529                            .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3530                            .dwattr $C$DW$340, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3531                            .dwattr $C$DW$340, DW_AT_decl_line(0x80)
    3532                            .dwattr $C$DW$340, DW_AT_decl_column(0x0f)
    3533                    
    3534                    $C$DW$341       .dwtag  DW_TAG_member
    3535                            .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$23)
    3536                            .dwattr $C$DW$341, DW_AT_name("pastTrig")
    3537                            .dwattr $C$DW$341, DW_AT_TI_symbol_name("pastTrig")
    3538                            .dwattr $C$DW$341, DW_AT_bit_offset(0x00)
    3539                            .dwattr $C$DW$341, DW_AT_bit_size(0x01)
    3540                            .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3541                            .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3542                            .dwattr $C$DW$341, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3543                            .dwattr $C$DW$341, DW_AT_decl_line(0x81)
    3544                            .dwattr $C$DW$341, DW_AT_decl_column(0x0f)
    3545                    
    3546                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3547                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x7c)
    3548                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x0b)
    3549                            .dwendtag $C$DW$T$26
    3550                    
    3551                    
    3552                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3553                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    3554                    $C$DW$342       .dwtag  DW_TAG_member
    3555                            .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$23)
    3556                            .dwattr $C$DW$342, DW_AT_name("rule")
    3557                            .dwattr $C$DW$342, DW_AT_TI_symbol_name("rule")
    3558                            .dwattr $C$DW$342, DW_AT_bit_offset(0x04)
    3559                            .dwattr $C$DW$342, DW_AT_bit_size(0x04)
    3560                            .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3561                            .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3562                            .dwattr $C$DW$342, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3563                            .dwattr $C$DW$342, DW_AT_decl_line(0x85)
    3564                            .dwattr $C$DW$342, DW_AT_decl_column(0x0f)
    3565                    
    3566                    $C$DW$343       .dwtag  DW_TAG_member
    3567                            .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$23)
    3568                            .dwattr $C$DW$343, DW_AT_name("nSkip")
    3569                            .dwattr $C$DW$343, DW_AT_TI_symbol_name("nSkip")
    3570                            .dwattr $C$DW$343, DW_AT_bit_offset(0x00)
    3571                            .dwattr $C$DW$343, DW_AT_bit_size(0x04)
    3572                            .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3573                            .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   66

    3574                            .dwattr $C$DW$343, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3575                            .dwattr $C$DW$343, DW_AT_decl_line(0x86)
    3576                            .dwattr $C$DW$343, DW_AT_decl_column(0x0f)
    3577                    
    3578                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3579                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x84)
    3580                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0b)
    3581                            .dwendtag $C$DW$T$27
    3582                    
    3583                    
    3584                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3585                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    3586                    $C$DW$344       .dwtag  DW_TAG_member
    3587                            .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$23)
    3588                            .dwattr $C$DW$344, DW_AT_name("triggerType")
    3589                            .dwattr $C$DW$344, DW_AT_TI_symbol_name("triggerType")
    3590                            .dwattr $C$DW$344, DW_AT_bit_offset(0x04)
    3591                            .dwattr $C$DW$344, DW_AT_bit_size(0x04)
    3592                            .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3593                            .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3594                            .dwattr $C$DW$344, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3595                            .dwattr $C$DW$344, DW_AT_decl_line(0x98)
    3596                            .dwattr $C$DW$344, DW_AT_decl_column(0x0f)
    3597                    
    3598                    $C$DW$345       .dwtag  DW_TAG_member
    3599                            .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$23)
    3600                            .dwattr $C$DW$345, DW_AT_name("bEnaCmd")
    3601                            .dwattr $C$DW$345, DW_AT_TI_symbol_name("bEnaCmd")
    3602                            .dwattr $C$DW$345, DW_AT_bit_offset(0x03)
    3603                            .dwattr $C$DW$345, DW_AT_bit_size(0x01)
    3604                            .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3605                            .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3606                            .dwattr $C$DW$345, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3607                            .dwattr $C$DW$345, DW_AT_decl_line(0x99)
    3608                            .dwattr $C$DW$345, DW_AT_decl_column(0x0f)
    3609                    
    3610                    $C$DW$346       .dwtag  DW_TAG_member
    3611                            .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$23)
    3612                            .dwattr $C$DW$346, DW_AT_name("triggerNo")
    3613                            .dwattr $C$DW$346, DW_AT_TI_symbol_name("triggerNo")
    3614                            .dwattr $C$DW$346, DW_AT_bit_offset(0x01)
    3615                            .dwattr $C$DW$346, DW_AT_bit_size(0x02)
    3616                            .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3617                            .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3618                            .dwattr $C$DW$346, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3619                            .dwattr $C$DW$346, DW_AT_decl_line(0x9b)
    3620                            .dwattr $C$DW$346, DW_AT_decl_column(0x0f)
    3621                    
    3622                    $C$DW$347       .dwtag  DW_TAG_member
    3623                            .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$23)
    3624                            .dwattr $C$DW$347, DW_AT_name("pastTrig")
    3625                            .dwattr $C$DW$347, DW_AT_TI_symbol_name("pastTrig")
    3626                            .dwattr $C$DW$347, DW_AT_bit_offset(0x00)
    3627                            .dwattr $C$DW$347, DW_AT_bit_size(0x01)
    3628                            .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   67

    3629                            .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3630                            .dwattr $C$DW$347, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3631                            .dwattr $C$DW$347, DW_AT_decl_line(0x9c)
    3632                            .dwattr $C$DW$347, DW_AT_decl_column(0x0f)
    3633                    
    3634                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3635                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x97)
    3636                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
    3637                            .dwendtag $C$DW$T$28
    3638                    
    3639                    
    3640                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3641                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    3642                    $C$DW$348       .dwtag  DW_TAG_member
    3643                            .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$23)
    3644                            .dwattr $C$DW$348, DW_AT_name("rule")
    3645                            .dwattr $C$DW$348, DW_AT_TI_symbol_name("rule")
    3646                            .dwattr $C$DW$348, DW_AT_bit_offset(0x04)
    3647                            .dwattr $C$DW$348, DW_AT_bit_size(0x04)
    3648                            .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3649                            .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3650                            .dwattr $C$DW$348, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3651                            .dwattr $C$DW$348, DW_AT_decl_line(0xa0)
    3652                            .dwattr $C$DW$348, DW_AT_decl_column(0x0f)
    3653                    
    3654                    $C$DW$349       .dwtag  DW_TAG_member
    3655                            .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$23)
    3656                            .dwattr $C$DW$349, DW_AT_name("nSkip")
    3657                            .dwattr $C$DW$349, DW_AT_TI_symbol_name("nSkip")
    3658                            .dwattr $C$DW$349, DW_AT_bit_offset(0x00)
    3659                            .dwattr $C$DW$349, DW_AT_bit_size(0x04)
    3660                            .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3661                            .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3662                            .dwattr $C$DW$349, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3663                            .dwattr $C$DW$349, DW_AT_decl_line(0xa1)
    3664                            .dwattr $C$DW$349, DW_AT_decl_column(0x0f)
    3665                    
    3666                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3667                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x9f)
    3668                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    3669                            .dwendtag $C$DW$T$29
    3670                    
    3671                    
    3672                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3673                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    3674                    $C$DW$350       .dwtag  DW_TAG_member
    3675                            .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$23)
    3676                            .dwattr $C$DW$350, DW_AT_name("triggerType")
    3677                            .dwattr $C$DW$350, DW_AT_TI_symbol_name("triggerType")
    3678                            .dwattr $C$DW$350, DW_AT_bit_offset(0x04)
    3679                            .dwattr $C$DW$350, DW_AT_bit_size(0x04)
    3680                            .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3681                            .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3682                            .dwattr $C$DW$350, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3683                            .dwattr $C$DW$350, DW_AT_decl_line(0xb3)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   68

    3684                            .dwattr $C$DW$350, DW_AT_decl_column(0x0f)
    3685                    
    3686                    $C$DW$351       .dwtag  DW_TAG_member
    3687                            .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$23)
    3688                            .dwattr $C$DW$351, DW_AT_name("bEnaCmd")
    3689                            .dwattr $C$DW$351, DW_AT_TI_symbol_name("bEnaCmd")
    3690                            .dwattr $C$DW$351, DW_AT_bit_offset(0x03)
    3691                            .dwattr $C$DW$351, DW_AT_bit_size(0x01)
    3692                            .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3693                            .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3694                            .dwattr $C$DW$351, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3695                            .dwattr $C$DW$351, DW_AT_decl_line(0xb4)
    3696                            .dwattr $C$DW$351, DW_AT_decl_column(0x0f)
    3697                    
    3698                    $C$DW$352       .dwtag  DW_TAG_member
    3699                            .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$23)
    3700                            .dwattr $C$DW$352, DW_AT_name("triggerNo")
    3701                            .dwattr $C$DW$352, DW_AT_TI_symbol_name("triggerNo")
    3702                            .dwattr $C$DW$352, DW_AT_bit_offset(0x01)
    3703                            .dwattr $C$DW$352, DW_AT_bit_size(0x02)
    3704                            .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3705                            .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3706                            .dwattr $C$DW$352, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3707                            .dwattr $C$DW$352, DW_AT_decl_line(0xb6)
    3708                            .dwattr $C$DW$352, DW_AT_decl_column(0x0f)
    3709                    
    3710                    $C$DW$353       .dwtag  DW_TAG_member
    3711                            .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$23)
    3712                            .dwattr $C$DW$353, DW_AT_name("pastTrig")
    3713                            .dwattr $C$DW$353, DW_AT_TI_symbol_name("pastTrig")
    3714                            .dwattr $C$DW$353, DW_AT_bit_offset(0x00)
    3715                            .dwattr $C$DW$353, DW_AT_bit_size(0x01)
    3716                            .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3717                            .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3718                            .dwattr $C$DW$353, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3719                            .dwattr $C$DW$353, DW_AT_decl_line(0xb7)
    3720                            .dwattr $C$DW$353, DW_AT_decl_column(0x0f)
    3721                    
    3722                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3723                            .dwattr $C$DW$T$30, DW_AT_decl_line(0xb2)
    3724                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x0b)
    3725                            .dwendtag $C$DW$T$30
    3726                    
    3727                    
    3728                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3729                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    3730                    $C$DW$354       .dwtag  DW_TAG_member
    3731                            .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$23)
    3732                            .dwattr $C$DW$354, DW_AT_name("rule")
    3733                            .dwattr $C$DW$354, DW_AT_TI_symbol_name("rule")
    3734                            .dwattr $C$DW$354, DW_AT_bit_offset(0x04)
    3735                            .dwattr $C$DW$354, DW_AT_bit_size(0x04)
    3736                            .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3737                            .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3738                            .dwattr $C$DW$354, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   69

    3739                            .dwattr $C$DW$354, DW_AT_decl_line(0xbb)
    3740                            .dwattr $C$DW$354, DW_AT_decl_column(0x0f)
    3741                    
    3742                    $C$DW$355       .dwtag  DW_TAG_member
    3743                            .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$23)
    3744                            .dwattr $C$DW$355, DW_AT_name("nSkip")
    3745                            .dwattr $C$DW$355, DW_AT_TI_symbol_name("nSkip")
    3746                            .dwattr $C$DW$355, DW_AT_bit_offset(0x00)
    3747                            .dwattr $C$DW$355, DW_AT_bit_size(0x04)
    3748                            .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3749                            .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3750                            .dwattr $C$DW$355, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3751                            .dwattr $C$DW$355, DW_AT_decl_line(0xbc)
    3752                            .dwattr $C$DW$355, DW_AT_decl_column(0x0f)
    3753                    
    3754                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3755                            .dwattr $C$DW$T$31, DW_AT_decl_line(0xba)
    3756                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x0b)
    3757                            .dwendtag $C$DW$T$31
    3758                    
    3759                    
    3760                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3761                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    3762                    $C$DW$356       .dwtag  DW_TAG_member
    3763                            .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$33)
    3764                            .dwattr $C$DW$356, DW_AT_name("frontEndMode")
    3765                            .dwattr $C$DW$356, DW_AT_TI_symbol_name("frontEndMode")
    3766                            .dwattr $C$DW$356, DW_AT_bit_offset(0x0d)
    3767                            .dwattr $C$DW$356, DW_AT_bit_size(0x03)
    3768                            .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3769                            .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3770                            .dwattr $C$DW$356, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3771                            .dwattr $C$DW$356, DW_AT_decl_line(0xc9)
    3772                            .dwattr $C$DW$356, DW_AT_decl_column(0x10)
    3773                    
    3774                    $C$DW$357       .dwtag  DW_TAG_member
    3775                            .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$33)
    3776                            .dwattr $C$DW$357, DW_AT_name("biasMode")
    3777                            .dwattr $C$DW$357, DW_AT_TI_symbol_name("biasMode")
    3778                            .dwattr $C$DW$357, DW_AT_bit_offset(0x0c)
    3779                            .dwattr $C$DW$357, DW_AT_bit_size(0x01)
    3780                            .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3781                            .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3782                            .dwattr $C$DW$357, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3783                            .dwattr $C$DW$357, DW_AT_decl_line(0xcf)
    3784                            .dwattr $C$DW$357, DW_AT_decl_column(0x10)
    3785                    
    3786                    $C$DW$358       .dwtag  DW_TAG_member
    3787                            .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$33)
    3788                            .dwattr $C$DW$358, DW_AT_name("analogCfgMode")
    3789                            .dwattr $C$DW$358, DW_AT_TI_symbol_name("analogCfgMode")
    3790                            .dwattr $C$DW$358, DW_AT_bit_offset(0x06)
    3791                            .dwattr $C$DW$358, DW_AT_bit_size(0x06)
    3792                            .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3793                            .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   70

    3794                            .dwattr $C$DW$358, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3795                            .dwattr $C$DW$358, DW_AT_decl_line(0xd1)
    3796                            .dwattr $C$DW$358, DW_AT_decl_column(0x10)
    3797                    
    3798                    $C$DW$359       .dwtag  DW_TAG_member
    3799                            .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$33)
    3800                            .dwattr $C$DW$359, DW_AT_name("bNoFsPowerUp")
    3801                            .dwattr $C$DW$359, DW_AT_TI_symbol_name("bNoFsPowerUp")
    3802                            .dwattr $C$DW$359, DW_AT_bit_offset(0x05)
    3803                            .dwattr $C$DW$359, DW_AT_bit_size(0x01)
    3804                            .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3805                            .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3806                            .dwattr $C$DW$359, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3807                            .dwattr $C$DW$359, DW_AT_decl_line(0xd8)
    3808                            .dwattr $C$DW$359, DW_AT_decl_column(0x10)
    3809                    
    3810                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3811                            .dwattr $C$DW$T$34, DW_AT_decl_line(0xc8)
    3812                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    3813                            .dwendtag $C$DW$T$34
    3814                    
    3815                    
    3816                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3817                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    3818                    $C$DW$360       .dwtag  DW_TAG_member
    3819                            .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$23)
    3820                            .dwattr $C$DW$360, DW_AT_name("triggerType")
    3821                            .dwattr $C$DW$360, DW_AT_TI_symbol_name("triggerType")
    3822                            .dwattr $C$DW$360, DW_AT_bit_offset(0x04)
    3823                            .dwattr $C$DW$360, DW_AT_bit_size(0x04)
    3824                            .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3825                            .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3826                            .dwattr $C$DW$360, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3827                            .dwattr $C$DW$360, DW_AT_decl_line(0xee)
    3828                            .dwattr $C$DW$360, DW_AT_decl_column(0x0f)
    3829                    
    3830                    $C$DW$361       .dwtag  DW_TAG_member
    3831                            .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$23)
    3832                            .dwattr $C$DW$361, DW_AT_name("bEnaCmd")
    3833                            .dwattr $C$DW$361, DW_AT_TI_symbol_name("bEnaCmd")
    3834                            .dwattr $C$DW$361, DW_AT_bit_offset(0x03)
    3835                            .dwattr $C$DW$361, DW_AT_bit_size(0x01)
    3836                            .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3837                            .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3838                            .dwattr $C$DW$361, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3839                            .dwattr $C$DW$361, DW_AT_decl_line(0xef)
    3840                            .dwattr $C$DW$361, DW_AT_decl_column(0x0f)
    3841                    
    3842                    $C$DW$362       .dwtag  DW_TAG_member
    3843                            .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$23)
    3844                            .dwattr $C$DW$362, DW_AT_name("triggerNo")
    3845                            .dwattr $C$DW$362, DW_AT_TI_symbol_name("triggerNo")
    3846                            .dwattr $C$DW$362, DW_AT_bit_offset(0x01)
    3847                            .dwattr $C$DW$362, DW_AT_bit_size(0x02)
    3848                            .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   71

    3849                            .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3850                            .dwattr $C$DW$362, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3851                            .dwattr $C$DW$362, DW_AT_decl_line(0xf1)
    3852                            .dwattr $C$DW$362, DW_AT_decl_column(0x0f)
    3853                    
    3854                    $C$DW$363       .dwtag  DW_TAG_member
    3855                            .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$23)
    3856                            .dwattr $C$DW$363, DW_AT_name("pastTrig")
    3857                            .dwattr $C$DW$363, DW_AT_TI_symbol_name("pastTrig")
    3858                            .dwattr $C$DW$363, DW_AT_bit_offset(0x00)
    3859                            .dwattr $C$DW$363, DW_AT_bit_size(0x01)
    3860                            .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3861                            .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3862                            .dwattr $C$DW$363, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3863                            .dwattr $C$DW$363, DW_AT_decl_line(0xf2)
    3864                            .dwattr $C$DW$363, DW_AT_decl_column(0x0f)
    3865                    
    3866                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3867                            .dwattr $C$DW$T$35, DW_AT_decl_line(0xed)
    3868                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    3869                            .dwendtag $C$DW$T$35
    3870                    
    3871                    
    3872                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3873                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    3874                    $C$DW$364       .dwtag  DW_TAG_member
    3875                            .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$23)
    3876                            .dwattr $C$DW$364, DW_AT_name("rule")
    3877                            .dwattr $C$DW$364, DW_AT_TI_symbol_name("rule")
    3878                            .dwattr $C$DW$364, DW_AT_bit_offset(0x04)
    3879                            .dwattr $C$DW$364, DW_AT_bit_size(0x04)
    3880                            .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3881                            .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3882                            .dwattr $C$DW$364, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3883                            .dwattr $C$DW$364, DW_AT_decl_line(0xf6)
    3884                            .dwattr $C$DW$364, DW_AT_decl_column(0x0f)
    3885                    
    3886                    $C$DW$365       .dwtag  DW_TAG_member
    3887                            .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$23)
    3888                            .dwattr $C$DW$365, DW_AT_name("nSkip")
    3889                            .dwattr $C$DW$365, DW_AT_TI_symbol_name("nSkip")
    3890                            .dwattr $C$DW$365, DW_AT_bit_offset(0x00)
    3891                            .dwattr $C$DW$365, DW_AT_bit_size(0x04)
    3892                            .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3893                            .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3894                            .dwattr $C$DW$365, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3895                            .dwattr $C$DW$365, DW_AT_decl_line(0xf7)
    3896                            .dwattr $C$DW$365, DW_AT_decl_column(0x0f)
    3897                    
    3898                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3899                            .dwattr $C$DW$T$36, DW_AT_decl_line(0xf5)
    3900                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x0b)
    3901                            .dwendtag $C$DW$T$36
    3902                    
    3903                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   72

    3904                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3905                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    3906                    $C$DW$366       .dwtag  DW_TAG_member
    3907                            .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$23)
    3908                            .dwattr $C$DW$366, DW_AT_name("bTxMode")
    3909                            .dwattr $C$DW$366, DW_AT_TI_symbol_name("bTxMode")
    3910                            .dwattr $C$DW$366, DW_AT_bit_offset(0x07)
    3911                            .dwattr $C$DW$366, DW_AT_bit_size(0x01)
    3912                            .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3913                            .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3914                            .dwattr $C$DW$366, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3915                            .dwattr $C$DW$366, DW_AT_decl_line(0xfc)
    3916                            .dwattr $C$DW$366, DW_AT_decl_column(0x0f)
    3917                    
    3918                    $C$DW$367       .dwtag  DW_TAG_member
    3919                            .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$23)
    3920                            .dwattr $C$DW$367, DW_AT_name("refFreq")
    3921                            .dwattr $C$DW$367, DW_AT_TI_symbol_name("refFreq")
    3922                            .dwattr $C$DW$367, DW_AT_bit_offset(0x01)
    3923                            .dwattr $C$DW$367, DW_AT_bit_size(0x06)
    3924                            .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3925                            .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3926                            .dwattr $C$DW$367, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3927                            .dwattr $C$DW$367, DW_AT_decl_line(0xfe)
    3928                            .dwattr $C$DW$367, DW_AT_decl_column(0x0f)
    3929                    
    3930                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3931                            .dwattr $C$DW$T$37, DW_AT_decl_line(0xfb)
    3932                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x0b)
    3933                            .dwendtag $C$DW$T$37
    3934                    
    3935                    
    3936                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3937                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    3938                    $C$DW$368       .dwtag  DW_TAG_member
    3939                            .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$23)
    3940                            .dwattr $C$DW$368, DW_AT_name("triggerType")
    3941                            .dwattr $C$DW$368, DW_AT_TI_symbol_name("triggerType")
    3942                            .dwattr $C$DW$368, DW_AT_bit_offset(0x04)
    3943                            .dwattr $C$DW$368, DW_AT_bit_size(0x04)
    3944                            .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3945                            .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3946                            .dwattr $C$DW$368, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3947                            .dwattr $C$DW$368, DW_AT_decl_line(0x115)
    3948                            .dwattr $C$DW$368, DW_AT_decl_column(0x0f)
    3949                    
    3950                    $C$DW$369       .dwtag  DW_TAG_member
    3951                            .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$23)
    3952                            .dwattr $C$DW$369, DW_AT_name("bEnaCmd")
    3953                            .dwattr $C$DW$369, DW_AT_TI_symbol_name("bEnaCmd")
    3954                            .dwattr $C$DW$369, DW_AT_bit_offset(0x03)
    3955                            .dwattr $C$DW$369, DW_AT_bit_size(0x01)
    3956                            .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3957                            .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3958                            .dwattr $C$DW$369, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   73

    3959                            .dwattr $C$DW$369, DW_AT_decl_line(0x116)
    3960                            .dwattr $C$DW$369, DW_AT_decl_column(0x0f)
    3961                    
    3962                    $C$DW$370       .dwtag  DW_TAG_member
    3963                            .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$23)
    3964                            .dwattr $C$DW$370, DW_AT_name("triggerNo")
    3965                            .dwattr $C$DW$370, DW_AT_TI_symbol_name("triggerNo")
    3966                            .dwattr $C$DW$370, DW_AT_bit_offset(0x01)
    3967                            .dwattr $C$DW$370, DW_AT_bit_size(0x02)
    3968                            .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3969                            .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3970                            .dwattr $C$DW$370, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3971                            .dwattr $C$DW$370, DW_AT_decl_line(0x118)
    3972                            .dwattr $C$DW$370, DW_AT_decl_column(0x0f)
    3973                    
    3974                    $C$DW$371       .dwtag  DW_TAG_member
    3975                            .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$23)
    3976                            .dwattr $C$DW$371, DW_AT_name("pastTrig")
    3977                            .dwattr $C$DW$371, DW_AT_TI_symbol_name("pastTrig")
    3978                            .dwattr $C$DW$371, DW_AT_bit_offset(0x00)
    3979                            .dwattr $C$DW$371, DW_AT_bit_size(0x01)
    3980                            .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3981                            .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3982                            .dwattr $C$DW$371, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3983                            .dwattr $C$DW$371, DW_AT_decl_line(0x119)
    3984                            .dwattr $C$DW$371, DW_AT_decl_column(0x0f)
    3985                    
    3986                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3987                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x114)
    3988                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    3989                            .dwendtag $C$DW$T$38
    3990                    
    3991                    
    3992                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3993                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    3994                    $C$DW$372       .dwtag  DW_TAG_member
    3995                            .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$23)
    3996                            .dwattr $C$DW$372, DW_AT_name("rule")
    3997                            .dwattr $C$DW$372, DW_AT_TI_symbol_name("rule")
    3998                            .dwattr $C$DW$372, DW_AT_bit_offset(0x04)
    3999                            .dwattr $C$DW$372, DW_AT_bit_size(0x04)
    4000                            .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4001                            .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4002                            .dwattr $C$DW$372, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4003                            .dwattr $C$DW$372, DW_AT_decl_line(0x11d)
    4004                            .dwattr $C$DW$372, DW_AT_decl_column(0x0f)
    4005                    
    4006                    $C$DW$373       .dwtag  DW_TAG_member
    4007                            .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$23)
    4008                            .dwattr $C$DW$373, DW_AT_name("nSkip")
    4009                            .dwattr $C$DW$373, DW_AT_TI_symbol_name("nSkip")
    4010                            .dwattr $C$DW$373, DW_AT_bit_offset(0x00)
    4011                            .dwattr $C$DW$373, DW_AT_bit_size(0x04)
    4012                            .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4013                            .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   74

    4014                            .dwattr $C$DW$373, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4015                            .dwattr $C$DW$373, DW_AT_decl_line(0x11e)
    4016                            .dwattr $C$DW$373, DW_AT_decl_column(0x0f)
    4017                    
    4018                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4019                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x11c)
    4020                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    4021                            .dwendtag $C$DW$T$39
    4022                    
    4023                    
    4024                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4025                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    4026                    $C$DW$374       .dwtag  DW_TAG_member
    4027                            .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$23)
    4028                            .dwattr $C$DW$374, DW_AT_name("triggerType")
    4029                            .dwattr $C$DW$374, DW_AT_TI_symbol_name("triggerType")
    4030                            .dwattr $C$DW$374, DW_AT_bit_offset(0x04)
    4031                            .dwattr $C$DW$374, DW_AT_bit_size(0x04)
    4032                            .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4033                            .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4034                            .dwattr $C$DW$374, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4035                            .dwattr $C$DW$374, DW_AT_decl_line(0x130)
    4036                            .dwattr $C$DW$374, DW_AT_decl_column(0x0f)
    4037                    
    4038                    $C$DW$375       .dwtag  DW_TAG_member
    4039                            .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$23)
    4040                            .dwattr $C$DW$375, DW_AT_name("bEnaCmd")
    4041                            .dwattr $C$DW$375, DW_AT_TI_symbol_name("bEnaCmd")
    4042                            .dwattr $C$DW$375, DW_AT_bit_offset(0x03)
    4043                            .dwattr $C$DW$375, DW_AT_bit_size(0x01)
    4044                            .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4045                            .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4046                            .dwattr $C$DW$375, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4047                            .dwattr $C$DW$375, DW_AT_decl_line(0x131)
    4048                            .dwattr $C$DW$375, DW_AT_decl_column(0x0f)
    4049                    
    4050                    $C$DW$376       .dwtag  DW_TAG_member
    4051                            .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$23)
    4052                            .dwattr $C$DW$376, DW_AT_name("triggerNo")
    4053                            .dwattr $C$DW$376, DW_AT_TI_symbol_name("triggerNo")
    4054                            .dwattr $C$DW$376, DW_AT_bit_offset(0x01)
    4055                            .dwattr $C$DW$376, DW_AT_bit_size(0x02)
    4056                            .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4057                            .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4058                            .dwattr $C$DW$376, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4059                            .dwattr $C$DW$376, DW_AT_decl_line(0x133)
    4060                            .dwattr $C$DW$376, DW_AT_decl_column(0x0f)
    4061                    
    4062                    $C$DW$377       .dwtag  DW_TAG_member
    4063                            .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$23)
    4064                            .dwattr $C$DW$377, DW_AT_name("pastTrig")
    4065                            .dwattr $C$DW$377, DW_AT_TI_symbol_name("pastTrig")
    4066                            .dwattr $C$DW$377, DW_AT_bit_offset(0x00)
    4067                            .dwattr $C$DW$377, DW_AT_bit_size(0x01)
    4068                            .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   75

    4069                            .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4070                            .dwattr $C$DW$377, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4071                            .dwattr $C$DW$377, DW_AT_decl_line(0x134)
    4072                            .dwattr $C$DW$377, DW_AT_decl_column(0x0f)
    4073                    
    4074                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4075                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x12f)
    4076                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    4077                            .dwendtag $C$DW$T$40
    4078                    
    4079                    
    4080                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4081                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    4082                    $C$DW$378       .dwtag  DW_TAG_member
    4083                            .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$23)
    4084                            .dwattr $C$DW$378, DW_AT_name("rule")
    4085                            .dwattr $C$DW$378, DW_AT_TI_symbol_name("rule")
    4086                            .dwattr $C$DW$378, DW_AT_bit_offset(0x04)
    4087                            .dwattr $C$DW$378, DW_AT_bit_size(0x04)
    4088                            .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4089                            .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4090                            .dwattr $C$DW$378, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4091                            .dwattr $C$DW$378, DW_AT_decl_line(0x138)
    4092                            .dwattr $C$DW$378, DW_AT_decl_column(0x0f)
    4093                    
    4094                    $C$DW$379       .dwtag  DW_TAG_member
    4095                            .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$23)
    4096                            .dwattr $C$DW$379, DW_AT_name("nSkip")
    4097                            .dwattr $C$DW$379, DW_AT_TI_symbol_name("nSkip")
    4098                            .dwattr $C$DW$379, DW_AT_bit_offset(0x00)
    4099                            .dwattr $C$DW$379, DW_AT_bit_size(0x04)
    4100                            .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4101                            .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4102                            .dwattr $C$DW$379, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4103                            .dwattr $C$DW$379, DW_AT_decl_line(0x139)
    4104                            .dwattr $C$DW$379, DW_AT_decl_column(0x0f)
    4105                    
    4106                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4107                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x137)
    4108                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    4109                            .dwendtag $C$DW$T$41
    4110                    
    4111                    
    4112                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    4113                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    4114                    $C$DW$380       .dwtag  DW_TAG_member
    4115                            .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$23)
    4116                            .dwattr $C$DW$380, DW_AT_name("bEnaFifo")
    4117                            .dwattr $C$DW$380, DW_AT_TI_symbol_name("bEnaFifo")
    4118                            .dwattr $C$DW$380, DW_AT_bit_offset(0x07)
    4119                            .dwattr $C$DW$380, DW_AT_bit_size(0x01)
    4120                            .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4121                            .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4122                            .dwattr $C$DW$380, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4123                            .dwattr $C$DW$380, DW_AT_decl_line(0x13c)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   76

    4124                            .dwattr $C$DW$380, DW_AT_decl_column(0x0f)
    4125                    
    4126                    $C$DW$381       .dwtag  DW_TAG_member
    4127                            .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$23)
    4128                            .dwattr $C$DW$381, DW_AT_name("bFsOff")
    4129                            .dwattr $C$DW$381, DW_AT_TI_symbol_name("bFsOff")
    4130                            .dwattr $C$DW$381, DW_AT_bit_offset(0x06)
    4131                            .dwattr $C$DW$381, DW_AT_bit_size(0x01)
    4132                            .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4133                            .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4134                            .dwattr $C$DW$381, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4135                            .dwattr $C$DW$381, DW_AT_decl_line(0x13e)
    4136                            .dwattr $C$DW$381, DW_AT_decl_column(0x0f)
    4137                    
    4138                    $C$DW$382       .dwtag  DW_TAG_member
    4139                            .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$23)
    4140                            .dwattr $C$DW$382, DW_AT_name("bNoSync")
    4141                            .dwattr $C$DW$382, DW_AT_TI_symbol_name("bNoSync")
    4142                            .dwattr $C$DW$382, DW_AT_bit_offset(0x05)
    4143                            .dwattr $C$DW$382, DW_AT_bit_size(0x01)
    4144                            .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4145                            .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4146                            .dwattr $C$DW$382, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4147                            .dwattr $C$DW$382, DW_AT_decl_line(0x140)
    4148                            .dwattr $C$DW$382, DW_AT_decl_column(0x0f)
    4149                    
    4150                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4151                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x13b)
    4152                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    4153                            .dwendtag $C$DW$T$42
    4154                    
    4155                    
    4156                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    4157                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    4158                    $C$DW$383       .dwtag  DW_TAG_member
    4159                            .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$23)
    4160                            .dwattr $C$DW$383, DW_AT_name("triggerType")
    4161                            .dwattr $C$DW$383, DW_AT_TI_symbol_name("triggerType")
    4162                            .dwattr $C$DW$383, DW_AT_bit_offset(0x04)
    4163                            .dwattr $C$DW$383, DW_AT_bit_size(0x04)
    4164                            .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4165                            .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4166                            .dwattr $C$DW$383, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4167                            .dwattr $C$DW$383, DW_AT_decl_line(0x144)
    4168                            .dwattr $C$DW$383, DW_AT_decl_column(0x0f)
    4169                    
    4170                    $C$DW$384       .dwtag  DW_TAG_member
    4171                            .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$23)
    4172                            .dwattr $C$DW$384, DW_AT_name("bEnaCmd")
    4173                            .dwattr $C$DW$384, DW_AT_TI_symbol_name("bEnaCmd")
    4174                            .dwattr $C$DW$384, DW_AT_bit_offset(0x03)
    4175                            .dwattr $C$DW$384, DW_AT_bit_size(0x01)
    4176                            .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4177                            .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4178                            .dwattr $C$DW$384, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   77

    4179                            .dwattr $C$DW$384, DW_AT_decl_line(0x145)
    4180                            .dwattr $C$DW$384, DW_AT_decl_column(0x0f)
    4181                    
    4182                    $C$DW$385       .dwtag  DW_TAG_member
    4183                            .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$23)
    4184                            .dwattr $C$DW$385, DW_AT_name("triggerNo")
    4185                            .dwattr $C$DW$385, DW_AT_TI_symbol_name("triggerNo")
    4186                            .dwattr $C$DW$385, DW_AT_bit_offset(0x01)
    4187                            .dwattr $C$DW$385, DW_AT_bit_size(0x02)
    4188                            .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4189                            .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4190                            .dwattr $C$DW$385, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4191                            .dwattr $C$DW$385, DW_AT_decl_line(0x147)
    4192                            .dwattr $C$DW$385, DW_AT_decl_column(0x0f)
    4193                    
    4194                    $C$DW$386       .dwtag  DW_TAG_member
    4195                            .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$23)
    4196                            .dwattr $C$DW$386, DW_AT_name("pastTrig")
    4197                            .dwattr $C$DW$386, DW_AT_TI_symbol_name("pastTrig")
    4198                            .dwattr $C$DW$386, DW_AT_bit_offset(0x00)
    4199                            .dwattr $C$DW$386, DW_AT_bit_size(0x01)
    4200                            .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4201                            .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4202                            .dwattr $C$DW$386, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4203                            .dwattr $C$DW$386, DW_AT_decl_line(0x148)
    4204                            .dwattr $C$DW$386, DW_AT_decl_column(0x0f)
    4205                    
    4206                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4207                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x143)
    4208                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    4209                            .dwendtag $C$DW$T$43
    4210                    
    4211                    
    4212                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    4213                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    4214                    $C$DW$387       .dwtag  DW_TAG_member
    4215                            .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$23)
    4216                            .dwattr $C$DW$387, DW_AT_name("triggerType")
    4217                            .dwattr $C$DW$387, DW_AT_TI_symbol_name("triggerType")
    4218                            .dwattr $C$DW$387, DW_AT_bit_offset(0x04)
    4219                            .dwattr $C$DW$387, DW_AT_bit_size(0x04)
    4220                            .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4221                            .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4222                            .dwattr $C$DW$387, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4223                            .dwattr $C$DW$387, DW_AT_decl_line(0x15d)
    4224                            .dwattr $C$DW$387, DW_AT_decl_column(0x0f)
    4225                    
    4226                    $C$DW$388       .dwtag  DW_TAG_member
    4227                            .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$23)
    4228                            .dwattr $C$DW$388, DW_AT_name("bEnaCmd")
    4229                            .dwattr $C$DW$388, DW_AT_TI_symbol_name("bEnaCmd")
    4230                            .dwattr $C$DW$388, DW_AT_bit_offset(0x03)
    4231                            .dwattr $C$DW$388, DW_AT_bit_size(0x01)
    4232                            .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4233                            .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   78

    4234                            .dwattr $C$DW$388, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4235                            .dwattr $C$DW$388, DW_AT_decl_line(0x15e)
    4236                            .dwattr $C$DW$388, DW_AT_decl_column(0x0f)
    4237                    
    4238                    $C$DW$389       .dwtag  DW_TAG_member
    4239                            .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$23)
    4240                            .dwattr $C$DW$389, DW_AT_name("triggerNo")
    4241                            .dwattr $C$DW$389, DW_AT_TI_symbol_name("triggerNo")
    4242                            .dwattr $C$DW$389, DW_AT_bit_offset(0x01)
    4243                            .dwattr $C$DW$389, DW_AT_bit_size(0x02)
    4244                            .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4245                            .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4246                            .dwattr $C$DW$389, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4247                            .dwattr $C$DW$389, DW_AT_decl_line(0x160)
    4248                            .dwattr $C$DW$389, DW_AT_decl_column(0x0f)
    4249                    
    4250                    $C$DW$390       .dwtag  DW_TAG_member
    4251                            .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$23)
    4252                            .dwattr $C$DW$390, DW_AT_name("pastTrig")
    4253                            .dwattr $C$DW$390, DW_AT_TI_symbol_name("pastTrig")
    4254                            .dwattr $C$DW$390, DW_AT_bit_offset(0x00)
    4255                            .dwattr $C$DW$390, DW_AT_bit_size(0x01)
    4256                            .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4257                            .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4258                            .dwattr $C$DW$390, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4259                            .dwattr $C$DW$390, DW_AT_decl_line(0x161)
    4260                            .dwattr $C$DW$390, DW_AT_decl_column(0x0f)
    4261                    
    4262                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4263                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x15c)
    4264                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x0b)
    4265                            .dwendtag $C$DW$T$44
    4266                    
    4267                    
    4268                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    4269                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    4270                    $C$DW$391       .dwtag  DW_TAG_member
    4271                            .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$23)
    4272                            .dwattr $C$DW$391, DW_AT_name("rule")
    4273                            .dwattr $C$DW$391, DW_AT_TI_symbol_name("rule")
    4274                            .dwattr $C$DW$391, DW_AT_bit_offset(0x04)
    4275                            .dwattr $C$DW$391, DW_AT_bit_size(0x04)
    4276                            .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4277                            .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4278                            .dwattr $C$DW$391, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4279                            .dwattr $C$DW$391, DW_AT_decl_line(0x165)
    4280                            .dwattr $C$DW$391, DW_AT_decl_column(0x0f)
    4281                    
    4282                    $C$DW$392       .dwtag  DW_TAG_member
    4283                            .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$23)
    4284                            .dwattr $C$DW$392, DW_AT_name("nSkip")
    4285                            .dwattr $C$DW$392, DW_AT_TI_symbol_name("nSkip")
    4286                            .dwattr $C$DW$392, DW_AT_bit_offset(0x00)
    4287                            .dwattr $C$DW$392, DW_AT_bit_size(0x04)
    4288                            .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   79

    4289                            .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4290                            .dwattr $C$DW$392, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4291                            .dwattr $C$DW$392, DW_AT_decl_line(0x166)
    4292                            .dwattr $C$DW$392, DW_AT_decl_column(0x0f)
    4293                    
    4294                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4295                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x164)
    4296                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0b)
    4297                            .dwendtag $C$DW$T$45
    4298                    
    4299                    
    4300                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    4301                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    4302                    $C$DW$393       .dwtag  DW_TAG_member
    4303                            .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$23)
    4304                            .dwattr $C$DW$393, DW_AT_name("bUseCw")
    4305                            .dwattr $C$DW$393, DW_AT_TI_symbol_name("bUseCw")
    4306                            .dwattr $C$DW$393, DW_AT_bit_offset(0x07)
    4307                            .dwattr $C$DW$393, DW_AT_bit_size(0x01)
    4308                            .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4309                            .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4310                            .dwattr $C$DW$393, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4311                            .dwattr $C$DW$393, DW_AT_decl_line(0x169)
    4312                            .dwattr $C$DW$393, DW_AT_decl_column(0x0f)
    4313                    
    4314                    $C$DW$394       .dwtag  DW_TAG_member
    4315                            .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$23)
    4316                            .dwattr $C$DW$394, DW_AT_name("bFsOff")
    4317                            .dwattr $C$DW$394, DW_AT_TI_symbol_name("bFsOff")
    4318                            .dwattr $C$DW$394, DW_AT_bit_offset(0x06)
    4319                            .dwattr $C$DW$394, DW_AT_bit_size(0x01)
    4320                            .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4321                            .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4322                            .dwattr $C$DW$394, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4323                            .dwattr $C$DW$394, DW_AT_decl_line(0x16b)
    4324                            .dwattr $C$DW$394, DW_AT_decl_column(0x0f)
    4325                    
    4326                    $C$DW$395       .dwtag  DW_TAG_member
    4327                            .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$23)
    4328                            .dwattr $C$DW$395, DW_AT_name("whitenMode")
    4329                            .dwattr $C$DW$395, DW_AT_TI_symbol_name("whitenMode")
    4330                            .dwattr $C$DW$395, DW_AT_bit_offset(0x04)
    4331                            .dwattr $C$DW$395, DW_AT_bit_size(0x02)
    4332                            .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4333                            .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4334                            .dwattr $C$DW$395, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4335                            .dwattr $C$DW$395, DW_AT_decl_line(0x16d)
    4336                            .dwattr $C$DW$395, DW_AT_decl_column(0x0f)
    4337                    
    4338                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4339                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x168)
    4340                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x0b)
    4341                            .dwendtag $C$DW$T$46
    4342                    
    4343                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   80

    4344                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    4345                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    4346                    $C$DW$396       .dwtag  DW_TAG_member
    4347                            .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$23)
    4348                            .dwattr $C$DW$396, DW_AT_name("triggerType")
    4349                            .dwattr $C$DW$396, DW_AT_TI_symbol_name("triggerType")
    4350                            .dwattr $C$DW$396, DW_AT_bit_offset(0x04)
    4351                            .dwattr $C$DW$396, DW_AT_bit_size(0x04)
    4352                            .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4353                            .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4354                            .dwattr $C$DW$396, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4355                            .dwattr $C$DW$396, DW_AT_decl_line(0x176)
    4356                            .dwattr $C$DW$396, DW_AT_decl_column(0x0f)
    4357                    
    4358                    $C$DW$397       .dwtag  DW_TAG_member
    4359                            .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$23)
    4360                            .dwattr $C$DW$397, DW_AT_name("bEnaCmd")
    4361                            .dwattr $C$DW$397, DW_AT_TI_symbol_name("bEnaCmd")
    4362                            .dwattr $C$DW$397, DW_AT_bit_offset(0x03)
    4363                            .dwattr $C$DW$397, DW_AT_bit_size(0x01)
    4364                            .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4365                            .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4366                            .dwattr $C$DW$397, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4367                            .dwattr $C$DW$397, DW_AT_decl_line(0x177)
    4368                            .dwattr $C$DW$397, DW_AT_decl_column(0x0f)
    4369                    
    4370                    $C$DW$398       .dwtag  DW_TAG_member
    4371                            .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$23)
    4372                            .dwattr $C$DW$398, DW_AT_name("triggerNo")
    4373                            .dwattr $C$DW$398, DW_AT_TI_symbol_name("triggerNo")
    4374                            .dwattr $C$DW$398, DW_AT_bit_offset(0x01)
    4375                            .dwattr $C$DW$398, DW_AT_bit_size(0x02)
    4376                            .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4377                            .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4378                            .dwattr $C$DW$398, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4379                            .dwattr $C$DW$398, DW_AT_decl_line(0x179)
    4380                            .dwattr $C$DW$398, DW_AT_decl_column(0x0f)
    4381                    
    4382                    $C$DW$399       .dwtag  DW_TAG_member
    4383                            .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$23)
    4384                            .dwattr $C$DW$399, DW_AT_name("pastTrig")
    4385                            .dwattr $C$DW$399, DW_AT_TI_symbol_name("pastTrig")
    4386                            .dwattr $C$DW$399, DW_AT_bit_offset(0x00)
    4387                            .dwattr $C$DW$399, DW_AT_bit_size(0x01)
    4388                            .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4389                            .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4390                            .dwattr $C$DW$399, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4391                            .dwattr $C$DW$399, DW_AT_decl_line(0x17a)
    4392                            .dwattr $C$DW$399, DW_AT_decl_column(0x0f)
    4393                    
    4394                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4395                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x175)
    4396                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x0b)
    4397                            .dwendtag $C$DW$T$47
    4398                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   81

    4399                    
    4400                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    4401                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    4402                    $C$DW$400       .dwtag  DW_TAG_member
    4403                            .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$23)
    4404                            .dwattr $C$DW$400, DW_AT_name("triggerType")
    4405                            .dwattr $C$DW$400, DW_AT_TI_symbol_name("triggerType")
    4406                            .dwattr $C$DW$400, DW_AT_bit_offset(0x04)
    4407                            .dwattr $C$DW$400, DW_AT_bit_size(0x04)
    4408                            .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4409                            .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4410                            .dwattr $C$DW$400, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4411                            .dwattr $C$DW$400, DW_AT_decl_line(0x18f)
    4412                            .dwattr $C$DW$400, DW_AT_decl_column(0x0f)
    4413                    
    4414                    $C$DW$401       .dwtag  DW_TAG_member
    4415                            .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$23)
    4416                            .dwattr $C$DW$401, DW_AT_name("bEnaCmd")
    4417                            .dwattr $C$DW$401, DW_AT_TI_symbol_name("bEnaCmd")
    4418                            .dwattr $C$DW$401, DW_AT_bit_offset(0x03)
    4419                            .dwattr $C$DW$401, DW_AT_bit_size(0x01)
    4420                            .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4421                            .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4422                            .dwattr $C$DW$401, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4423                            .dwattr $C$DW$401, DW_AT_decl_line(0x190)
    4424                            .dwattr $C$DW$401, DW_AT_decl_column(0x0f)
    4425                    
    4426                    $C$DW$402       .dwtag  DW_TAG_member
    4427                            .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$23)
    4428                            .dwattr $C$DW$402, DW_AT_name("triggerNo")
    4429                            .dwattr $C$DW$402, DW_AT_TI_symbol_name("triggerNo")
    4430                            .dwattr $C$DW$402, DW_AT_bit_offset(0x01)
    4431                            .dwattr $C$DW$402, DW_AT_bit_size(0x02)
    4432                            .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4433                            .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4434                            .dwattr $C$DW$402, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4435                            .dwattr $C$DW$402, DW_AT_decl_line(0x192)
    4436                            .dwattr $C$DW$402, DW_AT_decl_column(0x0f)
    4437                    
    4438                    $C$DW$403       .dwtag  DW_TAG_member
    4439                            .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$23)
    4440                            .dwattr $C$DW$403, DW_AT_name("pastTrig")
    4441                            .dwattr $C$DW$403, DW_AT_TI_symbol_name("pastTrig")
    4442                            .dwattr $C$DW$403, DW_AT_bit_offset(0x00)
    4443                            .dwattr $C$DW$403, DW_AT_bit_size(0x01)
    4444                            .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4445                            .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4446                            .dwattr $C$DW$403, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4447                            .dwattr $C$DW$403, DW_AT_decl_line(0x193)
    4448                            .dwattr $C$DW$403, DW_AT_decl_column(0x0f)
    4449                    
    4450                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4451                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x18e)
    4452                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x0b)
    4453                            .dwendtag $C$DW$T$48
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   82

    4454                    
    4455                    
    4456                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    4457                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    4458                    $C$DW$404       .dwtag  DW_TAG_member
    4459                            .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$23)
    4460                            .dwattr $C$DW$404, DW_AT_name("rule")
    4461                            .dwattr $C$DW$404, DW_AT_TI_symbol_name("rule")
    4462                            .dwattr $C$DW$404, DW_AT_bit_offset(0x04)
    4463                            .dwattr $C$DW$404, DW_AT_bit_size(0x04)
    4464                            .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4465                            .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4466                            .dwattr $C$DW$404, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4467                            .dwattr $C$DW$404, DW_AT_decl_line(0x197)
    4468                            .dwattr $C$DW$404, DW_AT_decl_column(0x0f)
    4469                    
    4470                    $C$DW$405       .dwtag  DW_TAG_member
    4471                            .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$23)
    4472                            .dwattr $C$DW$405, DW_AT_name("nSkip")
    4473                            .dwattr $C$DW$405, DW_AT_TI_symbol_name("nSkip")
    4474                            .dwattr $C$DW$405, DW_AT_bit_offset(0x00)
    4475                            .dwattr $C$DW$405, DW_AT_bit_size(0x04)
    4476                            .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4477                            .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4478                            .dwattr $C$DW$405, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4479                            .dwattr $C$DW$405, DW_AT_decl_line(0x198)
    4480                            .dwattr $C$DW$405, DW_AT_decl_column(0x0f)
    4481                    
    4482                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4483                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x196)
    4484                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x0b)
    4485                            .dwendtag $C$DW$T$49
    4486                    
    4487                    
    4488                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    4489                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    4490                    $C$DW$406       .dwtag  DW_TAG_member
    4491                            .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$23)
    4492                            .dwattr $C$DW$406, DW_AT_name("triggerType")
    4493                            .dwattr $C$DW$406, DW_AT_TI_symbol_name("triggerType")
    4494                            .dwattr $C$DW$406, DW_AT_bit_offset(0x04)
    4495                            .dwattr $C$DW$406, DW_AT_bit_size(0x04)
    4496                            .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4497                            .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4498                            .dwattr $C$DW$406, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4499                            .dwattr $C$DW$406, DW_AT_decl_line(0x1ad)
    4500                            .dwattr $C$DW$406, DW_AT_decl_column(0x0f)
    4501                    
    4502                    $C$DW$407       .dwtag  DW_TAG_member
    4503                            .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$23)
    4504                            .dwattr $C$DW$407, DW_AT_name("bEnaCmd")
    4505                            .dwattr $C$DW$407, DW_AT_TI_symbol_name("bEnaCmd")
    4506                            .dwattr $C$DW$407, DW_AT_bit_offset(0x03)
    4507                            .dwattr $C$DW$407, DW_AT_bit_size(0x01)
    4508                            .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{83C91EA5-0908-4968-BDA3-C48C7E7FBAF9} PAGE   83

    4509                            .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4510                            .dwattr $C$DW$407, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4511                            .dwattr $C$DW$407, DW_AT_decl_line(0x1ae)
    4512                            .dwattr $C$DW$407, DW_AT_decl_column(0x0f)
    4513                    
    4514                    $C$DW$408       .dwtag  DW_TAG_member
    4515                            .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$23)
    4516                            .dwattr $C$DW$408, DW_AT_name("triggerNo")
    4517                            .dwattr $C$DW$408, DW_AT_TI_symbol_name("triggerNo")
    4518                            .dwattr $C$DW$408, DW_AT_bit_offset(0x01)
    4519                            .dwattr $C$DW$408, DW_AT_bit_size(0x02)
    4520                            .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4521                            .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4522                            .dwattr $C$DW$408, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4523                            .dwattr $C$DW$408, DW_AT_decl_line(0x1b0)
    4524                            .dwattr $C$DW$408, DW_AT_decl_column(0x0f)
    4525                    
    4526                    $C$DW$409       .dwtag  DW_TAG_member
    4527                            .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$23)
    4528                            .dwattr $C$DW$409, DW_AT_name("pastTrig")
    4529                            .dwattr $C$DW$409, DW_AT_TI_symbol_name("pastTrig")
    4530                            .dwattr $C$DW$409, DW_AT_bit_offset(0x00)
    4531                            .dwattr $C$DW$409, DW_AT_bit_size(0x01)
    4532                            .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4533                            .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4534                            .dwattr $C$DW$409, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4535                            .dwattr $C$DW$409, DW_AT_decl_line(0x1b1)
    4536                            .dwattr $C$DW$409, DW_AT_decl_column(0x0f)
    4537                    
    4538                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
