TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Nov 28 13:22:06 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/LowLevel/lmac_global.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Adrian\workspace_v8\collector_cc1350lp\collector_cc
      13                            .global macTxSlottedDelay
      14 00000000                   .data

    2844                            .dwattr $C$DW$299, DW_AT_decl_column(0x05)
    2845                    
    2846                    $C$DW$300       .dwtag  DW_TAG_enumerator
    2847                            .dwattr $C$DW$300, DW_AT_name("RF_AllowDelayAny")
    2848                            .dwattr $C$DW$300, DW_AT_const_value(-1)
    2849                            .dwattr $C$DW$300, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2850                            .dwattr $C$DW$300, DW_AT_decl_line(0x5ee)
    2851                            .dwattr $C$DW$300, DW_AT_decl_column(0x05)
    2852                    
    2853                            .dwattr $C$DW$T$916, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2854                            .dwattr $C$DW$T$916, DW_AT_decl_line(0x5ec)
    2855                            .dwattr $C$DW$T$916, DW_AT_decl_column(0x0e)
    2856                            .dwendtag $C$DW$T$916
    2857                    
    2858                    $C$DW$T$917     .dwtag  DW_TAG_typedef
    2859                            .dwattr $C$DW$T$917, DW_AT_name("RF_AllowDelay")
    2860                            .dwattr $C$DW$T$917, DW_AT_type(*$C$DW$T$916)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   53

    2861                            .dwattr $C$DW$T$917, DW_AT_language(DW_LANG_C)
    2862                            .dwattr $C$DW$T$917, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2863                            .dwattr $C$DW$T$917, DW_AT_decl_line(0x5ef)
    2864                            .dwattr $C$DW$T$917, DW_AT_decl_column(0x03)
    2865                    
    2866                    
    2867                    $C$DW$T$918     .dwtag  DW_TAG_enumeration_type
    2868                            .dwattr $C$DW$T$918, DW_AT_byte_size(0x01)
    2869                    $C$DW$301       .dwtag  DW_TAG_enumerator
    2870                            .dwattr $C$DW$301, DW_AT_name("RF_RatChannelAny")
    2871                            .dwattr $C$DW$301, DW_AT_const_value(-1)
    2872                            .dwattr $C$DW$301, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2873                            .dwattr $C$DW$301, DW_AT_decl_line(0x60f)
    2874                            .dwattr $C$DW$301, DW_AT_decl_column(0x05)
    2875                    
    2876                    $C$DW$302       .dwtag  DW_TAG_enumerator
    2877                            .dwattr $C$DW$302, DW_AT_name("RF_RatChannel0")
    2878                            .dwattr $C$DW$302, DW_AT_const_value(0x00)
    2879                            .dwattr $C$DW$302, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2880                            .dwattr $C$DW$302, DW_AT_decl_line(0x610)
    2881                            .dwattr $C$DW$302, DW_AT_decl_column(0x05)
    2882                    
    2883                    $C$DW$303       .dwtag  DW_TAG_enumerator
    2884                            .dwattr $C$DW$303, DW_AT_name("RF_RatChannel1")
    2885                            .dwattr $C$DW$303, DW_AT_const_value(0x01)
    2886                            .dwattr $C$DW$303, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2887                            .dwattr $C$DW$303, DW_AT_decl_line(0x611)
    2888                            .dwattr $C$DW$303, DW_AT_decl_column(0x05)
    2889                    
    2890                    $C$DW$304       .dwtag  DW_TAG_enumerator
    2891                            .dwattr $C$DW$304, DW_AT_name("RF_RatChannel2")
    2892                            .dwattr $C$DW$304, DW_AT_const_value(0x02)
    2893                            .dwattr $C$DW$304, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2894                            .dwattr $C$DW$304, DW_AT_decl_line(0x612)
    2895                            .dwattr $C$DW$304, DW_AT_decl_column(0x05)
    2896                    
    2897                            .dwattr $C$DW$T$918, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2898                            .dwattr $C$DW$T$918, DW_AT_decl_line(0x60e)
    2899                            .dwattr $C$DW$T$918, DW_AT_decl_column(0x0e)
    2900                            .dwendtag $C$DW$T$918
    2901                    
    2902                    $C$DW$T$919     .dwtag  DW_TAG_typedef
    2903                            .dwattr $C$DW$T$919, DW_AT_name("RF_RatSelectChannel")
    2904                            .dwattr $C$DW$T$919, DW_AT_type(*$C$DW$T$918)
    2905                            .dwattr $C$DW$T$919, DW_AT_language(DW_LANG_C)
    2906                            .dwattr $C$DW$T$919, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2907                            .dwattr $C$DW$T$919, DW_AT_decl_line(0x613)
    2908                            .dwattr $C$DW$T$919, DW_AT_decl_column(0x03)
    2909                    
    2910                    
    2911                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2912                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    2913                    $C$DW$305       .dwtag  DW_TAG_member
    2914                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$14)
    2915                            .dwattr $C$DW$305, DW_AT_name("__max_align1")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   54

    2916                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("__max_align1")
    2917                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2918                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2919                            .dwattr $C$DW$305, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    2920                            .dwattr $C$DW$305, DW_AT_decl_line(0x70)
    2921                            .dwattr $C$DW$305, DW_AT_decl_column(0x0c)
    2922                    
    2923                    $C$DW$306       .dwtag  DW_TAG_member
    2924                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$18)
    2925                            .dwattr $C$DW$306, DW_AT_name("__max_align2")
    2926                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("__max_align2")
    2927                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2928                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2929                            .dwattr $C$DW$306, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    2930                            .dwattr $C$DW$306, DW_AT_decl_line(0x71)
    2931                            .dwattr $C$DW$306, DW_AT_decl_column(0x0e)
    2932                    
    2933                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    2934                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x6f)
    2935                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    2936                            .dwendtag $C$DW$T$21
    2937                    
    2938                    $C$DW$T$920     .dwtag  DW_TAG_typedef
    2939                            .dwattr $C$DW$T$920, DW_AT_name("__max_align_t")
    2940                            .dwattr $C$DW$T$920, DW_AT_type(*$C$DW$T$21)
    2941                            .dwattr $C$DW$T$920, DW_AT_language(DW_LANG_C)
    2942                            .dwattr $C$DW$T$920, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    2943                            .dwattr $C$DW$T$920, DW_AT_decl_line(0x72)
    2944                            .dwattr $C$DW$T$920, DW_AT_decl_column(0x03)
    2945                    
    2946                    
    2947                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2948                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
    2949                    $C$DW$307       .dwtag  DW_TAG_member
    2950                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$418)
    2951                            .dwattr $C$DW$307, DW_AT_name("addr")
    2952                            .dwattr $C$DW$307, DW_AT_TI_symbol_name("addr")
    2953                            .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2954                            .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2955                            .dwattr $C$DW$307, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    2956                            .dwattr $C$DW$307, DW_AT_decl_line(0x55)
    2957                            .dwattr $C$DW$307, DW_AT_decl_column(0x05)
    2958                    
    2959                    $C$DW$308       .dwtag  DW_TAG_member
    2960                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$23)
    2961                            .dwattr $C$DW$308, DW_AT_name("addrMode")
    2962                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("addrMode")
    2963                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2964                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2965                            .dwattr $C$DW$308, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    2966                            .dwattr $C$DW$308, DW_AT_decl_line(0x56)
    2967                            .dwattr $C$DW$308, DW_AT_decl_column(0x13)
    2968                    
    2969                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicati
    2970                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x50)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   55

    2971                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
    2972                            .dwendtag $C$DW$T$24
    2973                    
    2974                    $C$DW$T$83      .dwtag  DW_TAG_typedef
    2975                            .dwattr $C$DW$T$83, DW_AT_name("sAddr_t")
    2976                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$24)
    2977                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    2978                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicati
    2979                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x57)
    2980                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x03)
    2981                    
    2982                    
    2983                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2984                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    2985                    $C$DW$309       .dwtag  DW_TAG_member
    2986                            .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$26)
    2987                            .dwattr $C$DW$309, DW_AT_name("p")
    2988                            .dwattr $C$DW$309, DW_AT_TI_symbol_name("p")
    2989                            .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2990                            .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2991                            .dwattr $C$DW$309, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    2992                            .dwattr $C$DW$309, DW_AT_decl_line(0x3d)
    2993                            .dwattr $C$DW$309, DW_AT_decl_column(0x0e)
    2994                    
    2995                    $C$DW$310       .dwtag  DW_TAG_member
    2996                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$27)
    2997                            .dwattr $C$DW$310, DW_AT_name("len")
    2998                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("len")
    2999                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3000                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3001                            .dwattr $C$DW$310, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    3002                            .dwattr $C$DW$310, DW_AT_decl_line(0x3e)
    3003                            .dwattr $C$DW$310, DW_AT_decl_column(0x0e)
    3004                    
    3005                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicati
    3006                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x3c)
    3007                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
    3008                            .dwendtag $C$DW$T$28
    3009                    
    3010                    $C$DW$T$86      .dwtag  DW_TAG_typedef
    3011                            .dwattr $C$DW$T$86, DW_AT_name("sData_t")
    3012                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$28)
    3013                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    3014                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicati
    3015                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x3f)
    3016                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
    3017                    
    3018                    
    3019                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3020                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    3021                    $C$DW$311       .dwtag  DW_TAG_member
    3022                            .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$420)
    3023                            .dwattr $C$DW$311, DW_AT_name("addr")
    3024                            .dwattr $C$DW$311, DW_AT_TI_symbol_name("addr")
    3025                            .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   56

    3026                            .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3027                            .dwattr $C$DW$311, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    3028                            .dwattr $C$DW$311, DW_AT_decl_line(0x4db)
    3029                            .dwattr $C$DW$311, DW_AT_decl_column(0x07)
    3030                    
    3031                    $C$DW$312       .dwtag  DW_TAG_member
    3032                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$30)
    3033                            .dwattr $C$DW$312, DW_AT_name("addrMode")
    3034                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("addrMode")
    3035                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3036                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3037                            .dwattr $C$DW$312, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    3038                            .dwattr $C$DW$312, DW_AT_decl_line(0x4de)
    3039                            .dwattr $C$DW$312, DW_AT_decl_column(0x17)
    3040                    
    3041                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicati
    3042                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x4d0)
    3043                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
    3044                            .dwendtag $C$DW$T$31
    3045                    
    3046                    $C$DW$T$592     .dwtag  DW_TAG_typedef
    3047                            .dwattr $C$DW$T$592, DW_AT_name("ApiMac_sAddr_t")
    3048                            .dwattr $C$DW$T$592, DW_AT_type(*$C$DW$T$31)
    3049                            .dwattr $C$DW$T$592, DW_AT_language(DW_LANG_C)
    3050                            .dwattr $C$DW$T$592, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicat
    3051                            .dwattr $C$DW$T$592, DW_AT_decl_line(0x4df)
    3052                            .dwattr $C$DW$T$592, DW_AT_decl_column(0x03)
    3053                    
    3054                    
    3055                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3056                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    3057                    $C$DW$313       .dwtag  DW_TAG_member
    3058                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$33)
    3059                            .dwattr $C$DW$313, DW_AT_name("frameCounter")
    3060                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("frameCounter")
    3061                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3062                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3063                            .dwattr $C$DW$313, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    3064                            .dwattr $C$DW$313, DW_AT_decl_line(0x575)
    3065                            .dwattr $C$DW$313, DW_AT_decl_column(0x1a)
    3066                    
    3067                    $C$DW$314       .dwtag  DW_TAG_member
    3068                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$35)
    3069                            .dwattr $C$DW$314, DW_AT_name("keyIdx")
    3070                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("keyIdx")
    3071                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3072                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3073                            .dwattr $C$DW$314, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    3074                            .dwattr $C$DW$314, DW_AT_decl_line(0x576)
    3075                            .dwattr $C$DW$314, DW_AT_decl_column(0x1a)
    3076                    
    3077                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicati
    3078                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x574)
    3079                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    3080                            .dwendtag $C$DW$T$36
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   57

    3081                    
    3082                    $C$DW$T$652     .dwtag  DW_TAG_typedef
    3083                            .dwattr $C$DW$T$652, DW_AT_name("ApiMac_frameCntr_t")
    3084                            .dwattr $C$DW$T$652, DW_AT_type(*$C$DW$T$36)
    3085                            .dwattr $C$DW$T$652, DW_AT_language(DW_LANG_C)
    3086                            .dwattr $C$DW$T$652, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicat
    3087                            .dwattr $C$DW$T$652, DW_AT_decl_line(0x577)
    3088                            .dwattr $C$DW$T$652, DW_AT_decl_column(0x03)
    3089                    
    3090                    $C$DW$T$653     .dwtag  DW_TAG_pointer_type
    3091                            .dwattr $C$DW$T$653, DW_AT_type(*$C$DW$T$652)
    3092                            .dwattr $C$DW$T$653, DW_AT_address_class(0x20)
    3093                    
    3094                    
    3095                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3096                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x40)
    3097                    $C$DW$315       .dwtag  DW_TAG_member
    3098                            .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$38)
    3099                            .dwattr $C$DW$315, DW_AT_name("beaconType")
    3100                            .dwattr $C$DW$315, DW_AT_TI_symbol_name("beaconType")
    3101                            .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3102                            .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3103                            .dwattr $C$DW$315, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    3104                            .dwattr $C$DW$315, DW_AT_decl_line(0x886)
    3105                            .dwattr $C$DW$315, DW_AT_decl_column(0x19)
    3106                    
    3107                    $C$DW$316       .dwtag  DW_TAG_member
    3108                            .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$23)
    3109                            .dwattr $C$DW$316, DW_AT_name("bsn")
    3110                            .dwattr $C$DW$316, DW_AT_TI_symbol_name("bsn")
    3111                            .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3112                            .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3113                            .dwattr $C$DW$316, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    3114                            .dwattr $C$DW$316, DW_AT_decl_line(0x888)
    3115                            .dwattr $C$DW$316, DW_AT_decl_column(0x0d)
    3116                    
    3117                    $C$DW$317       .dwtag  DW_TAG_member
    3118                            .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$39)
    3119                            .dwattr $C$DW$317, DW_AT_name("panDesc")
    3120                            .dwattr $C$DW$317, DW_AT_TI_symbol_name("panDesc")
    3121                            .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3122                            .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3123                            .dwattr $C$DW$317, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    3124                            .dwattr $C$DW$317, DW_AT_decl_line(0x88a)
    3125                            .dwattr $C$DW$317, DW_AT_decl_column(0x16)
    3126                    
    3127                    $C$DW$318       .dwtag  DW_TAG_member
    3128                            .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$423)
    3129                            .dwattr $C$DW$318, DW_AT_name("beaconData")
    3130                            .dwattr $C$DW$318, DW_AT_TI_symbol_name("beaconData")
    3131                            .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3132                            .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3133                            .dwattr $C$DW$318, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    3134                            .dwattr $C$DW$318, DW_AT_decl_line(0x895)
    3135                            .dwattr $C$DW$318, DW_AT_decl_column(0x07)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   58

    3136                    
    3137                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicati
    3138                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x884)
    3139                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
    3140                            .dwendtag $C$DW$T$40
    3141                    
    3142                    $C$DW$T$506     .dwtag  DW_TAG_typedef
    3143                            .dwattr $C$DW$T$506, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    3144                            .dwattr $C$DW$T$506, DW_AT_type(*$C$DW$T$40)
    3145                            .dwattr $C$DW$T$506, DW_AT_language(DW_LANG_C)
    3146                            .dwattr $C$DW$T$506, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicat
    3147                            .dwattr $C$DW$T$506, DW_AT_decl_line(0x896)
    3148                            .dwattr $C$DW$T$506, DW_AT_decl_column(0x03)
    3149                    
    3150                    $C$DW$T$507     .dwtag  DW_TAG_pointer_type
    3151                            .dwattr $C$DW$T$507, DW_AT_type(*$C$DW$T$506)
    3152                            .dwattr $C$DW$T$507, DW_AT_address_class(0x20)
    3153                    
    3154                    
    3155                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    3156                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x10)
    3157                    $C$DW$319       .dwtag  DW_TAG_member
    3158                            .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$41)
    3159                            .dwattr $C$DW$319, DW_AT_name("firstChCentrFreq")
    3160                            .dwattr $C$DW$319, DW_AT_TI_symbol_name("firstChCentrFreq")
    3161                            .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3162                            .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3163                            .dwattr $C$DW$319, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3164                            .dwattr $C$DW$319, DW_AT_decl_line(0x29b)
    3165                            .dwattr $C$DW$319, DW_AT_decl_column(0x0a)
    3166                    
    3167                    $C$DW$320       .dwtag  DW_TAG_member
    3168                            .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$41)
    3169                            .dwattr $C$DW$320, DW_AT_name("channelSpacing")
    3170                            .dwattr $C$DW$320, DW_AT_TI_symbol_name("channelSpacing")
    3171                            .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3172                            .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3173                            .dwattr $C$DW$320, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3174                            .dwattr $C$DW$320, DW_AT_decl_line(0x29c)
    3175                            .dwattr $C$DW$320, DW_AT_decl_column(0x0a)
    3176                    
    3177                    $C$DW$321       .dwtag  DW_TAG_member
    3178                            .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$27)
    3179                            .dwattr $C$DW$321, DW_AT_name("noOfChannels")
    3180                            .dwattr $C$DW$321, DW_AT_TI_symbol_name("noOfChannels")
    3181                            .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3182                            .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3183                            .dwattr $C$DW$321, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3184                            .dwattr $C$DW$321, DW_AT_decl_line(0x29d)
    3185                            .dwattr $C$DW$321, DW_AT_decl_column(0x0a)
    3186                    
    3187                    $C$DW$322       .dwtag  DW_TAG_member
    3188                            .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$25)
    3189                            .dwattr $C$DW$322, DW_AT_name("fskModScheme")
    3190                            .dwattr $C$DW$322, DW_AT_TI_symbol_name("fskModScheme")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   59

    3191                            .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3192                            .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3193                            .dwattr $C$DW$322, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3194                            .dwattr $C$DW$322, DW_AT_decl_line(0x29f)
    3195                            .dwattr $C$DW$322, DW_AT_decl_column(0x09)
    3196                    
    3197                    $C$DW$323       .dwtag  DW_TAG_member
    3198                            .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$27)
    3199                            .dwattr $C$DW$323, DW_AT_name("symbolRate")
    3200                            .dwattr $C$DW$323, DW_AT_TI_symbol_name("symbolRate")
    3201                            .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3202                            .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3203                            .dwattr $C$DW$323, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3204                            .dwattr $C$DW$323, DW_AT_decl_line(0x2a1)
    3205                            .dwattr $C$DW$323, DW_AT_decl_column(0x0a)
    3206                    
    3207                    $C$DW$324       .dwtag  DW_TAG_member
    3208                            .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$25)
    3209                            .dwattr $C$DW$324, DW_AT_name("fskModIndex")
    3210                            .dwattr $C$DW$324, DW_AT_TI_symbol_name("fskModIndex")
    3211                            .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3212                            .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3213                            .dwattr $C$DW$324, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3214                            .dwattr $C$DW$324, DW_AT_decl_line(0x2a2)
    3215                            .dwattr $C$DW$324, DW_AT_decl_column(0x09)
    3216                    
    3217                    $C$DW$325       .dwtag  DW_TAG_member
    3218                            .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$25)
    3219                            .dwattr $C$DW$325, DW_AT_name("ccaType")
    3220                            .dwattr $C$DW$325, DW_AT_TI_symbol_name("ccaType")
    3221                            .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3222                            .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3223                            .dwattr $C$DW$325, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3224                            .dwattr $C$DW$325, DW_AT_decl_line(0x2aa)
    3225                            .dwattr $C$DW$325, DW_AT_decl_column(0x09)
    3226                    
    3227                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3228                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x29a)
    3229                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    3230                            .dwendtag $C$DW$T$42
    3231                    
    3232                    $C$DW$T$921     .dwtag  DW_TAG_typedef
    3233                            .dwattr $C$DW$T$921, DW_AT_name("macMRFSKPHYDesc_t")
    3234                            .dwattr $C$DW$T$921, DW_AT_type(*$C$DW$T$42)
    3235                            .dwattr $C$DW$T$921, DW_AT_language(DW_LANG_C)
    3236                            .dwattr $C$DW$T$921, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3237                            .dwattr $C$DW$T$921, DW_AT_decl_line(0x2ab)
    3238                            .dwattr $C$DW$T$921, DW_AT_decl_column(0x03)
    3239                    
    3240                    $C$DW$T$922     .dwtag  DW_TAG_typedef
    3241                            .dwattr $C$DW$T$922, DW_AT_name("macPHYDesc_t")
    3242                            .dwattr $C$DW$T$922, DW_AT_type(*$C$DW$T$921)
    3243                            .dwattr $C$DW$T$922, DW_AT_language(DW_LANG_C)
    3244                            .dwattr $C$DW$T$922, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3245                            .dwattr $C$DW$T$922, DW_AT_decl_line(0x2b1)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   60

    3246                            .dwattr $C$DW$T$922, DW_AT_decl_column(0x1b)
    3247                    
    3248                    
    3249                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3250                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    3251                    $C$DW$326       .dwtag  DW_TAG_member
    3252                            .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$25)
    3253                            .dwattr $C$DW$326, DW_AT_name("event")
    3254                            .dwattr $C$DW$326, DW_AT_TI_symbol_name("event")
    3255                            .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3256                            .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3257                            .dwattr $C$DW$326, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3258                            .dwattr $C$DW$326, DW_AT_decl_line(0x2b6)
    3259                            .dwattr $C$DW$326, DW_AT_decl_column(0x0b)
    3260                    
    3261                    $C$DW$327       .dwtag  DW_TAG_member
    3262                            .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$25)
    3263                            .dwattr $C$DW$327, DW_AT_name("status")
    3264                            .dwattr $C$DW$327, DW_AT_TI_symbol_name("status")
    3265                            .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3266                            .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3267                            .dwattr $C$DW$327, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3268                            .dwattr $C$DW$327, DW_AT_decl_line(0x2b7)
    3269                            .dwattr $C$DW$327, DW_AT_decl_column(0x0b)
    3270                    
    3271                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3272                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x2b5)
    3273                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
    3274                            .dwendtag $C$DW$T$43
    3275                    
    3276                    $C$DW$T$85      .dwtag  DW_TAG_typedef
    3277                            .dwattr $C$DW$T$85, DW_AT_name("macEventHdr_t")
    3278                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$43)
    3279                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3280                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3281                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x2b8)
    3282                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x03)
    3283                    
    3284                    
    3285                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    3286                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x0c)
    3287                    $C$DW$328       .dwtag  DW_TAG_member
    3288                            .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$44)
    3289                            .dwattr $C$DW$328, DW_AT_name("keySource")
    3290                            .dwattr $C$DW$328, DW_AT_TI_symbol_name("keySource")
    3291                            .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3292                            .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3293                            .dwattr $C$DW$328, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3294                            .dwattr $C$DW$328, DW_AT_decl_line(0x2bd)
    3295                            .dwattr $C$DW$328, DW_AT_decl_column(0x0b)
    3296                    
    3297                    $C$DW$329       .dwtag  DW_TAG_member
    3298                            .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$25)
    3299                            .dwattr $C$DW$329, DW_AT_name("securityLevel")
    3300                            .dwattr $C$DW$329, DW_AT_TI_symbol_name("securityLevel")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   61

    3301                            .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3302                            .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3303                            .dwattr $C$DW$329, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3304                            .dwattr $C$DW$329, DW_AT_decl_line(0x2be)
    3305                            .dwattr $C$DW$329, DW_AT_decl_column(0x0b)
    3306                    
    3307                    $C$DW$330       .dwtag  DW_TAG_member
    3308                            .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$25)
    3309                            .dwattr $C$DW$330, DW_AT_name("keyIdMode")
    3310                            .dwattr $C$DW$330, DW_AT_TI_symbol_name("keyIdMode")
    3311                            .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3312                            .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3313                            .dwattr $C$DW$330, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3314                            .dwattr $C$DW$330, DW_AT_decl_line(0x2bf)
    3315                            .dwattr $C$DW$330, DW_AT_decl_column(0x0b)
    3316                    
    3317                    $C$DW$331       .dwtag  DW_TAG_member
    3318                            .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$27)
    3319                            .dwattr $C$DW$331, DW_AT_name("keyIndex")
    3320                            .dwattr $C$DW$331, DW_AT_TI_symbol_name("keyIndex")
    3321                            .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3322                            .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3323                            .dwattr $C$DW$331, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3324                            .dwattr $C$DW$331, DW_AT_decl_line(0x2c0)
    3325                            .dwattr $C$DW$331, DW_AT_decl_column(0x0b)
    3326                    
    3327                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3328                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x2bc)
    3329                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
    3330                            .dwendtag $C$DW$T$45
    3331                    
    3332                    $C$DW$T$923     .dwtag  DW_TAG_typedef
    3333                            .dwattr $C$DW$T$923, DW_AT_name("macSec_t")
    3334                            .dwattr $C$DW$T$923, DW_AT_type(*$C$DW$T$45)
    3335                            .dwattr $C$DW$T$923, DW_AT_language(DW_LANG_C)
    3336                            .dwattr $C$DW$T$923, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3337                            .dwattr $C$DW$T$923, DW_AT_decl_line(0x2c1)
    3338                            .dwattr $C$DW$T$923, DW_AT_decl_column(0x03)
    3339                    
    3340                    
    3341                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3342                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x0a)
    3343                    $C$DW$332       .dwtag  DW_TAG_member
    3344                            .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$46)
    3345                            .dwattr $C$DW$332, DW_AT_name("lookupData")
    3346                            .dwattr $C$DW$332, DW_AT_TI_symbol_name("lookupData")
    3347                            .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3348                            .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3349                            .dwattr $C$DW$332, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3350                            .dwattr $C$DW$332, DW_AT_decl_line(0x2c6)
    3351                            .dwattr $C$DW$332, DW_AT_decl_column(0x16)
    3352                    
    3353                    $C$DW$333       .dwtag  DW_TAG_member
    3354                            .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$25)
    3355                            .dwattr $C$DW$333, DW_AT_name("lookupDataSize")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   62

    3356                            .dwattr $C$DW$333, DW_AT_TI_symbol_name("lookupDataSize")
    3357                            .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3358                            .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3359                            .dwattr $C$DW$333, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3360                            .dwattr $C$DW$333, DW_AT_decl_line(0x2c7)
    3361                            .dwattr $C$DW$333, DW_AT_decl_column(0x16)
    3362                    
    3363                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3364                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x2c5)
    3365                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
    3366                            .dwendtag $C$DW$T$47
    3367                    
    3368                    $C$DW$T$51      .dwtag  DW_TAG_typedef
    3369                            .dwattr $C$DW$T$51, DW_AT_name("keyIdLookupDescriptor_t")
    3370                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$47)
    3371                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    3372                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3373                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x2c8)
    3374                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
    3375                    
    3376                    $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    3377                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    3378                            .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    3379                    
    3380                    
    3381                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3382                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x04)
    3383                    $C$DW$334       .dwtag  DW_TAG_member
    3384                            .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$27)
    3385                            .dwattr $C$DW$334, DW_AT_name("deviceDescriptorHandle")
    3386                            .dwattr $C$DW$334, DW_AT_TI_symbol_name("deviceDescriptorHandle")
    3387                            .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3388                            .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3389                            .dwattr $C$DW$334, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3390                            .dwattr $C$DW$334, DW_AT_decl_line(0x2cd)
    3391                            .dwattr $C$DW$334, DW_AT_decl_column(0x16)
    3392                    
    3393                    $C$DW$335       .dwtag  DW_TAG_member
    3394                            .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$48)
    3395                            .dwattr $C$DW$335, DW_AT_name("uniqueDevice")
    3396                            .dwattr $C$DW$335, DW_AT_TI_symbol_name("uniqueDevice")
    3397                            .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3398                            .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3399                            .dwattr $C$DW$335, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3400                            .dwattr $C$DW$335, DW_AT_decl_line(0x2ce)
    3401                            .dwattr $C$DW$335, DW_AT_decl_column(0x16)
    3402                    
    3403                    $C$DW$336       .dwtag  DW_TAG_member
    3404                            .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$48)
    3405                            .dwattr $C$DW$336, DW_AT_name("blackListed")
    3406                            .dwattr $C$DW$336, DW_AT_TI_symbol_name("blackListed")
    3407                            .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3408                            .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3409                            .dwattr $C$DW$336, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3410                            .dwattr $C$DW$336, DW_AT_decl_line(0x2cf)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   63

    3411                            .dwattr $C$DW$336, DW_AT_decl_column(0x16)
    3412                    
    3413                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3414                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x2cc)
    3415                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    3416                            .dwendtag $C$DW$T$49
    3417                    
    3418                    $C$DW$T$53      .dwtag  DW_TAG_typedef
    3419                            .dwattr $C$DW$T$53, DW_AT_name("keyDeviceDescriptor_t")
    3420                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$49)
    3421                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    3422                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3423                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x2d0)
    3424                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x03)
    3425                    
    3426                    $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    3427                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    3428                            .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
    3429                    
    3430                    
    3431                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3432                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    3433                    $C$DW$337       .dwtag  DW_TAG_member
    3434                            .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$25)
    3435                            .dwattr $C$DW$337, DW_AT_name("frameType")
    3436                            .dwattr $C$DW$337, DW_AT_TI_symbol_name("frameType")
    3437                            .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3438                            .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3439                            .dwattr $C$DW$337, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3440                            .dwattr $C$DW$337, DW_AT_decl_line(0x2d5)
    3441                            .dwattr $C$DW$337, DW_AT_decl_column(0x16)
    3442                    
    3443                    $C$DW$338       .dwtag  DW_TAG_member
    3444                            .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$25)
    3445                            .dwattr $C$DW$338, DW_AT_name("cmdFrameId")
    3446                            .dwattr $C$DW$338, DW_AT_TI_symbol_name("cmdFrameId")
    3447                            .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3448                            .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3449                            .dwattr $C$DW$338, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3450                            .dwattr $C$DW$338, DW_AT_decl_line(0x2d6)
    3451                            .dwattr $C$DW$338, DW_AT_decl_column(0x16)
    3452                    
    3453                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3454                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2d4)
    3455                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    3456                            .dwendtag $C$DW$T$50
    3457                    
    3458                    $C$DW$T$55      .dwtag  DW_TAG_typedef
    3459                            .dwattr $C$DW$T$55, DW_AT_name("keyUsageDescriptor_t")
    3460                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$50)
    3461                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3462                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3463                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x2d7)
    3464                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x03)
    3465                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   64

    3466                    $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    3467                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    3468                            .dwattr $C$DW$T$56, DW_AT_address_class(0x20)
    3469                    
    3470                    
    3471                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    3472                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x2c)
    3473                    $C$DW$339       .dwtag  DW_TAG_member
    3474                            .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$52)
    3475                            .dwattr $C$DW$339, DW_AT_name("keyIdLookupList")
    3476                            .dwattr $C$DW$339, DW_AT_TI_symbol_name("keyIdLookupList")
    3477                            .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3478                            .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3479                            .dwattr $C$DW$339, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3480                            .dwattr $C$DW$339, DW_AT_decl_line(0x2dc)
    3481                            .dwattr $C$DW$339, DW_AT_decl_column(0x1d)
    3482                    
    3483                    $C$DW$340       .dwtag  DW_TAG_member
    3484                            .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$25)
    3485                            .dwattr $C$DW$340, DW_AT_name("keyIdLookupEntries")
    3486                            .dwattr $C$DW$340, DW_AT_TI_symbol_name("keyIdLookupEntries")
    3487                            .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3488                            .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3489                            .dwattr $C$DW$340, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3490                            .dwattr $C$DW$340, DW_AT_decl_line(0x2dd)
    3491                            .dwattr $C$DW$340, DW_AT_decl_column(0x1c)
    3492                    
    3493                    $C$DW$341       .dwtag  DW_TAG_member
    3494                            .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$54)
    3495                            .dwattr $C$DW$341, DW_AT_name("keyDeviceList")
    3496                            .dwattr $C$DW$341, DW_AT_TI_symbol_name("keyDeviceList")
    3497                            .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3498                            .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3499                            .dwattr $C$DW$341, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3500                            .dwattr $C$DW$341, DW_AT_decl_line(0x2df)
    3501                            .dwattr $C$DW$341, DW_AT_decl_column(0x1d)
    3502                    
    3503                    $C$DW$342       .dwtag  DW_TAG_member
    3504                            .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$27)
    3505                            .dwattr $C$DW$342, DW_AT_name("keyDeviceListEntries")
    3506                            .dwattr $C$DW$342, DW_AT_TI_symbol_name("keyDeviceListEntries")
    3507                            .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3508                            .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3509                            .dwattr $C$DW$342, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3510                            .dwattr $C$DW$342, DW_AT_decl_line(0x2e2)
    3511                            .dwattr $C$DW$342, DW_AT_decl_column(0x1d)
    3512                    
    3513                    $C$DW$343       .dwtag  DW_TAG_member
    3514                            .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$56)
    3515                            .dwattr $C$DW$343, DW_AT_name("keyUsageList")
    3516                            .dwattr $C$DW$343, DW_AT_TI_symbol_name("keyUsageList")
    3517                            .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3518                            .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3519                            .dwattr $C$DW$343, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3520                            .dwattr $C$DW$343, DW_AT_decl_line(0x2e4)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   65

    3521                            .dwattr $C$DW$343, DW_AT_decl_column(0x1d)
    3522                    
    3523                    $C$DW$344       .dwtag  DW_TAG_member
    3524                            .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$25)
    3525                            .dwattr $C$DW$344, DW_AT_name("keyUsageListEntries")
    3526                            .dwattr $C$DW$344, DW_AT_TI_symbol_name("keyUsageListEntries")
    3527                            .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3528                            .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3529                            .dwattr $C$DW$344, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3530                            .dwattr $C$DW$344, DW_AT_decl_line(0x2e6)
    3531                            .dwattr $C$DW$344, DW_AT_decl_column(0x1c)
    3532                    
    3533                    $C$DW$345       .dwtag  DW_TAG_member
    3534                            .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$57)
    3535                            .dwattr $C$DW$345, DW_AT_name("key")
    3536                            .dwattr $C$DW$345, DW_AT_TI_symbol_name("key")
    3537                            .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3538                            .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3539                            .dwattr $C$DW$345, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3540                            .dwattr $C$DW$345, DW_AT_decl_line(0x2e8)
    3541                            .dwattr $C$DW$345, DW_AT_decl_column(0x1c)
    3542                    
    3543                    $C$DW$346       .dwtag  DW_TAG_member
    3544                            .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$41)
    3545                            .dwattr $C$DW$346, DW_AT_name("frameCounter")
    3546                            .dwattr $C$DW$346, DW_AT_TI_symbol_name("frameCounter")
    3547                            .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3548                            .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3549                            .dwattr $C$DW$346, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3550                            .dwattr $C$DW$346, DW_AT_decl_line(0x2e9)
    3551                            .dwattr $C$DW$346, DW_AT_decl_column(0x1c)
    3552                    
    3553                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3554                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x2db)
    3555                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x01)
    3556                            .dwendtag $C$DW$T$58
    3557                    
    3558                    $C$DW$T$75      .dwtag  DW_TAG_typedef
    3559                            .dwattr $C$DW$T$75, DW_AT_name("keyDescriptor_t")
    3560                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$58)
    3561                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3562                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3563                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x2ec)
    3564                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    3565                    
    3566                    $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    3567                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    3568                            .dwattr $C$DW$T$76, DW_AT_address_class(0x20)
    3569                    
    3570                    
    3571                    $C$DW$T$59      .dwtag  DW_TAG_structure_type
    3572                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x08)
    3573                    $C$DW$347       .dwtag  DW_TAG_member
    3574                            .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$41)
    3575                            .dwattr $C$DW$347, DW_AT_name("frameCounter")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   66

    3576                            .dwattr $C$DW$347, DW_AT_TI_symbol_name("frameCounter")
    3577                            .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3578                            .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3579                            .dwattr $C$DW$347, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3580                            .dwattr $C$DW$347, DW_AT_decl_line(0x2f1)
    3581                            .dwattr $C$DW$347, DW_AT_decl_column(0x18)
    3582                    
    3583                    $C$DW$348       .dwtag  DW_TAG_member
    3584                            .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$27)
    3585                            .dwattr $C$DW$348, DW_AT_name("frameCntrIdx")
    3586                            .dwattr $C$DW$348, DW_AT_TI_symbol_name("frameCntrIdx")
    3587                            .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3588                            .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3589                            .dwattr $C$DW$348, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3590                            .dwattr $C$DW$348, DW_AT_decl_line(0x2f2)
    3591                            .dwattr $C$DW$348, DW_AT_decl_column(0x18)
    3592                    
    3593                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3594                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x2f0)
    3595                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    3596                            .dwendtag $C$DW$T$59
    3597                    
    3598                    $C$DW$T$62      .dwtag  DW_TAG_typedef
    3599                            .dwattr $C$DW$T$62, DW_AT_name("frameCntr_t")
    3600                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$59)
    3601                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3602                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3603                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x2f3)
    3604                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    3605                    
    3606                    $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    3607                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    3608                            .dwattr $C$DW$T$63, DW_AT_address_class(0x20)
    3609                    
    3610                    
    3611                    $C$DW$T$64      .dwtag  DW_TAG_structure_type
    3612                            .dwattr $C$DW$T$64, DW_AT_byte_size(0x14)
    3613                    $C$DW$349       .dwtag  DW_TAG_member
    3614                            .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$27)
    3615                            .dwattr $C$DW$349, DW_AT_name("panID")
    3616                            .dwattr $C$DW$349, DW_AT_TI_symbol_name("panID")
    3617                            .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3618                            .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3619                            .dwattr $C$DW$349, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3620                            .dwattr $C$DW$349, DW_AT_decl_line(0x2f8)
    3621                            .dwattr $C$DW$349, DW_AT_decl_column(0x16)
    3622                    
    3623                    $C$DW$350       .dwtag  DW_TAG_member
    3624                            .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$27)
    3625                            .dwattr $C$DW$350, DW_AT_name("shortAddress")
    3626                            .dwattr $C$DW$350, DW_AT_TI_symbol_name("shortAddress")
    3627                            .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3628                            .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3629                            .dwattr $C$DW$350, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3630                            .dwattr $C$DW$350, DW_AT_decl_line(0x2f9)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   67

    3631                            .dwattr $C$DW$350, DW_AT_decl_column(0x16)
    3632                    
    3633                    $C$DW$351       .dwtag  DW_TAG_member
    3634                            .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$61)
    3635                            .dwattr $C$DW$351, DW_AT_name("extAddress")
    3636                            .dwattr $C$DW$351, DW_AT_TI_symbol_name("extAddress")
    3637                            .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3638                            .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3639                            .dwattr $C$DW$351, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3640                            .dwattr $C$DW$351, DW_AT_decl_line(0x2fa)
    3641                            .dwattr $C$DW$351, DW_AT_decl_column(0x16)
    3642                    
    3643                    $C$DW$352       .dwtag  DW_TAG_member
    3644                            .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$63)
    3645                            .dwattr $C$DW$352, DW_AT_name("frameCtr")
    3646                            .dwattr $C$DW$352, DW_AT_TI_symbol_name("frameCtr")
    3647                            .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3648                            .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3649                            .dwattr $C$DW$352, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3650                            .dwattr $C$DW$352, DW_AT_decl_line(0x2fd)
    3651                            .dwattr $C$DW$352, DW_AT_decl_column(0x19)
    3652                    
    3653                    $C$DW$353       .dwtag  DW_TAG_member
    3654                            .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$48)
    3655                            .dwattr $C$DW$353, DW_AT_name("exempt")
    3656                            .dwattr $C$DW$353, DW_AT_TI_symbol_name("exempt")
    3657                            .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3658                            .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3659                            .dwattr $C$DW$353, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3660                            .dwattr $C$DW$353, DW_AT_decl_line(0x303)
    3661                            .dwattr $C$DW$353, DW_AT_decl_column(0x16)
    3662                    
    3663                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3664                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x2f7)
    3665                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x01)
    3666                            .dwendtag $C$DW$T$64
    3667                    
    3668                    $C$DW$T$70      .dwtag  DW_TAG_typedef
    3669                            .dwattr $C$DW$T$70, DW_AT_name("deviceDescriptor_t")
    3670                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$64)
    3671                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    3672                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3673                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x305)
    3674                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    3675                    
    3676                    
    3677                    $C$DW$T$65      .dwtag  DW_TAG_structure_type
    3678                            .dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
    3679                    $C$DW$354       .dwtag  DW_TAG_member
    3680                            .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$25)
    3681                            .dwattr $C$DW$354, DW_AT_name("frameType")
    3682                            .dwattr $C$DW$354, DW_AT_TI_symbol_name("frameType")
    3683                            .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3684                            .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3685                            .dwattr $C$DW$354, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   68

    3686                            .dwattr $C$DW$354, DW_AT_decl_line(0x30a)
    3687                            .dwattr $C$DW$354, DW_AT_decl_column(0x16)
    3688                    
    3689                    $C$DW$355       .dwtag  DW_TAG_member
    3690                            .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$25)
    3691                            .dwattr $C$DW$355, DW_AT_name("commandFrameIdentifier")
    3692                            .dwattr $C$DW$355, DW_AT_TI_symbol_name("commandFrameIdentifier")
    3693                            .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3694                            .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3695                            .dwattr $C$DW$355, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3696                            .dwattr $C$DW$355, DW_AT_decl_line(0x30b)
    3697                            .dwattr $C$DW$355, DW_AT_decl_column(0x16)
    3698                    
    3699                    $C$DW$356       .dwtag  DW_TAG_member
    3700                            .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$25)
    3701                            .dwattr $C$DW$356, DW_AT_name("securityMinimum")
    3702                            .dwattr $C$DW$356, DW_AT_TI_symbol_name("securityMinimum")
    3703                            .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3704                            .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3705                            .dwattr $C$DW$356, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3706                            .dwattr $C$DW$356, DW_AT_decl_line(0x30c)
    3707                            .dwattr $C$DW$356, DW_AT_decl_column(0x16)
    3708                    
    3709                    $C$DW$357       .dwtag  DW_TAG_member
    3710                            .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$48)
    3711                            .dwattr $C$DW$357, DW_AT_name("securityOverrideSecurityMinimum")
    3712                            .dwattr $C$DW$357, DW_AT_TI_symbol_name("securityOverrideSecurityMinimum")
    3713                            .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3714                            .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3715                            .dwattr $C$DW$357, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3716                            .dwattr $C$DW$357, DW_AT_decl_line(0x30e)
    3717                            .dwattr $C$DW$357, DW_AT_decl_column(0x16)
    3718                    
    3719                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3720                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x309)
    3721                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x01)
    3722                            .dwendtag $C$DW$T$65
    3723                    
    3724                    $C$DW$T$72      .dwtag  DW_TAG_typedef
    3725                            .dwattr $C$DW$T$72, DW_AT_name("securityLevelDescriptor_t")
    3726                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$65)
    3727                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3728                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3729                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x317)
    3730                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    3731                    
    3732                    
    3733                    $C$DW$T$66      .dwtag  DW_TAG_structure_type
    3734                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    3735                    $C$DW$358       .dwtag  DW_TAG_member
    3736                            .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$27)
    3737                            .dwattr $C$DW$358, DW_AT_name("key_index")
    3738                            .dwattr $C$DW$358, DW_AT_TI_symbol_name("key_index")
    3739                            .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3740                            .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   69

    3741                            .dwattr $C$DW$358, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3742                            .dwattr $C$DW$358, DW_AT_decl_line(0x31c)
    3743                            .dwattr $C$DW$358, DW_AT_decl_column(0x1b)
    3744                    
    3745                    $C$DW$359       .dwtag  DW_TAG_member
    3746                            .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$25)
    3747                            .dwattr $C$DW$359, DW_AT_name("key_id_lookup_index")
    3748                            .dwattr $C$DW$359, DW_AT_TI_symbol_name("key_id_lookup_index")
    3749                            .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3750                            .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3751                            .dwattr $C$DW$359, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3752                            .dwattr $C$DW$359, DW_AT_decl_line(0x31d)
    3753                            .dwattr $C$DW$359, DW_AT_decl_column(0x1b)
    3754                    
    3755                    $C$DW$360       .dwtag  DW_TAG_member
    3756                            .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$51)
    3757                            .dwattr $C$DW$360, DW_AT_name("macKeyIdLookupEntry")
    3758                            .dwattr $C$DW$360, DW_AT_TI_symbol_name("macKeyIdLookupEntry")
    3759                            .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3760                            .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3761                            .dwattr $C$DW$360, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3762                            .dwattr $C$DW$360, DW_AT_decl_line(0x31e)
    3763                            .dwattr $C$DW$360, DW_AT_decl_column(0x1b)
    3764                    
    3765                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3766                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x31b)
    3767                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x01)
    3768                            .dwendtag $C$DW$T$66
    3769                    
    3770                    $C$DW$T$924     .dwtag  DW_TAG_typedef
    3771                            .dwattr $C$DW$T$924, DW_AT_name("macSecurityPibKeyIdLookupEntry_t")
    3772                            .dwattr $C$DW$T$924, DW_AT_type(*$C$DW$T$66)
    3773                            .dwattr $C$DW$T$924, DW_AT_language(DW_LANG_C)
    3774                            .dwattr $C$DW$T$924, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3775                            .dwattr $C$DW$T$924, DW_AT_decl_line(0x31f)
    3776                            .dwattr $C$DW$T$924, DW_AT_decl_column(0x03)
    3777                    
    3778                    
    3779                    $C$DW$T$67      .dwtag  DW_TAG_structure_type
    3780                            .dwattr $C$DW$T$67, DW_AT_byte_size(0x08)
    3781                    $C$DW$361       .dwtag  DW_TAG_member
    3782                            .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$27)
    3783                            .dwattr $C$DW$361, DW_AT_name("key_index")
    3784                            .dwattr $C$DW$361, DW_AT_TI_symbol_name("key_index")
    3785                            .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3786                            .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3787                            .dwattr $C$DW$361, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3788                            .dwattr $C$DW$361, DW_AT_decl_line(0x323)
    3789                            .dwattr $C$DW$361, DW_AT_decl_column(0x1b)
    3790                    
    3791                    $C$DW$362       .dwtag  DW_TAG_member
    3792                            .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$27)
    3793                            .dwattr $C$DW$362, DW_AT_name("key_device_index")
    3794                            .dwattr $C$DW$362, DW_AT_TI_symbol_name("key_device_index")
    3795                            .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   70

    3796                            .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3797                            .dwattr $C$DW$362, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3798                            .dwattr $C$DW$362, DW_AT_decl_line(0x324)
    3799                            .dwattr $C$DW$362, DW_AT_decl_column(0x1b)
    3800                    
    3801                    $C$DW$363       .dwtag  DW_TAG_member
    3802                            .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$53)
    3803                            .dwattr $C$DW$363, DW_AT_name("macKeyDeviceEntry")
    3804                            .dwattr $C$DW$363, DW_AT_TI_symbol_name("macKeyDeviceEntry")
    3805                            .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3806                            .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3807                            .dwattr $C$DW$363, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3808                            .dwattr $C$DW$363, DW_AT_decl_line(0x325)
    3809                            .dwattr $C$DW$363, DW_AT_decl_column(0x1b)
    3810                    
    3811                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3812                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x322)
    3813                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x01)
    3814                            .dwendtag $C$DW$T$67
    3815                    
    3816                    $C$DW$T$925     .dwtag  DW_TAG_typedef
    3817                            .dwattr $C$DW$T$925, DW_AT_name("macSecurityPibKeyDeviceEntry_t")
    3818                            .dwattr $C$DW$T$925, DW_AT_type(*$C$DW$T$67)
    3819                            .dwattr $C$DW$T$925, DW_AT_language(DW_LANG_C)
    3820                            .dwattr $C$DW$T$925, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3821                            .dwattr $C$DW$T$925, DW_AT_decl_line(0x326)
    3822                            .dwattr $C$DW$T$925, DW_AT_decl_column(0x03)
    3823                    
    3824                    
    3825                    $C$DW$T$68      .dwtag  DW_TAG_structure_type
    3826                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x06)
    3827                    $C$DW$364       .dwtag  DW_TAG_member
    3828                            .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$27)
    3829                            .dwattr $C$DW$364, DW_AT_name("key_index")
    3830                            .dwattr $C$DW$364, DW_AT_TI_symbol_name("key_index")
    3831                            .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3832                            .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3833                            .dwattr $C$DW$364, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3834                            .dwattr $C$DW$364, DW_AT_decl_line(0x32a)
    3835                            .dwattr $C$DW$364, DW_AT_decl_column(0x1b)
    3836                    
    3837                    $C$DW$365       .dwtag  DW_TAG_member
    3838                            .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$25)
    3839                            .dwattr $C$DW$365, DW_AT_name("key_key_usage_index")
    3840                            .dwattr $C$DW$365, DW_AT_TI_symbol_name("key_key_usage_index")
    3841                            .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3842                            .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3843                            .dwattr $C$DW$365, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3844                            .dwattr $C$DW$365, DW_AT_decl_line(0x32b)
    3845                            .dwattr $C$DW$365, DW_AT_decl_column(0x1b)
    3846                    
    3847                    $C$DW$366       .dwtag  DW_TAG_member
    3848                            .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$55)
    3849                            .dwattr $C$DW$366, DW_AT_name("macKeyUsageEntry")
    3850                            .dwattr $C$DW$366, DW_AT_TI_symbol_name("macKeyUsageEntry")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   71

    3851                            .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3852                            .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3853                            .dwattr $C$DW$366, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3854                            .dwattr $C$DW$366, DW_AT_decl_line(0x32c)
    3855                            .dwattr $C$DW$366, DW_AT_decl_column(0x1b)
    3856                    
    3857                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3858                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x329)
    3859                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x01)
    3860                            .dwendtag $C$DW$T$68
    3861                    
    3862                    $C$DW$T$926     .dwtag  DW_TAG_typedef
    3863                            .dwattr $C$DW$T$926, DW_AT_name("macSecurityPibKeyUsageEntry_t")
    3864                            .dwattr $C$DW$T$926, DW_AT_type(*$C$DW$T$68)
    3865                            .dwattr $C$DW$T$926, DW_AT_language(DW_LANG_C)
    3866                            .dwattr $C$DW$T$926, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3867                            .dwattr $C$DW$T$926, DW_AT_decl_line(0x32d)
    3868                            .dwattr $C$DW$T$926, DW_AT_decl_column(0x03)
    3869                    
    3870                    
    3871                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
    3872                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x18)
    3873                    $C$DW$367       .dwtag  DW_TAG_member
    3874                            .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$27)
    3875                            .dwattr $C$DW$367, DW_AT_name("key_index")
    3876                            .dwattr $C$DW$367, DW_AT_TI_symbol_name("key_index")
    3877                            .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3878                            .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3879                            .dwattr $C$DW$367, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3880                            .dwattr $C$DW$367, DW_AT_decl_line(0x331)
    3881                            .dwattr $C$DW$367, DW_AT_decl_column(0x1b)
    3882                    
    3883                    $C$DW$368       .dwtag  DW_TAG_member
    3884                            .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$57)
    3885                            .dwattr $C$DW$368, DW_AT_name("keyEntry")
    3886                            .dwattr $C$DW$368, DW_AT_TI_symbol_name("keyEntry")
    3887                            .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3888                            .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3889                            .dwattr $C$DW$368, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3890                            .dwattr $C$DW$368, DW_AT_decl_line(0x332)
    3891                            .dwattr $C$DW$368, DW_AT_decl_column(0x1b)
    3892                    
    3893                    $C$DW$369       .dwtag  DW_TAG_member
    3894                            .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$41)
    3895                            .dwattr $C$DW$369, DW_AT_name("frameCounter")
    3896                            .dwattr $C$DW$369, DW_AT_TI_symbol_name("frameCounter")
    3897                            .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3898                            .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3899                            .dwattr $C$DW$369, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3900                            .dwattr $C$DW$369, DW_AT_decl_line(0x333)
    3901                            .dwattr $C$DW$369, DW_AT_decl_column(0x1b)
    3902                    
    3903                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3904                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x330)
    3905                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x01)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   72

    3906                            .dwendtag $C$DW$T$69
    3907                    
    3908                    $C$DW$T$927     .dwtag  DW_TAG_typedef
    3909                            .dwattr $C$DW$T$927, DW_AT_name("macSecurityPibKeyEntry_t")
    3910                            .dwattr $C$DW$T$927, DW_AT_type(*$C$DW$T$69)
    3911                            .dwattr $C$DW$T$927, DW_AT_language(DW_LANG_C)
    3912                            .dwattr $C$DW$T$927, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3913                            .dwattr $C$DW$T$927, DW_AT_decl_line(0x334)
    3914                            .dwattr $C$DW$T$927, DW_AT_decl_column(0x03)
    3915                    
    3916                    
    3917                    $C$DW$T$71      .dwtag  DW_TAG_structure_type
    3918                            .dwattr $C$DW$T$71, DW_AT_byte_size(0x18)
    3919                    $C$DW$370       .dwtag  DW_TAG_member
    3920                            .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$27)
    3921                            .dwattr $C$DW$370, DW_AT_name("device_index")
    3922                            .dwattr $C$DW$370, DW_AT_TI_symbol_name("device_index")
    3923                            .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3924                            .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3925                            .dwattr $C$DW$370, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3926                            .dwattr $C$DW$370, DW_AT_decl_line(0x338)
    3927                            .dwattr $C$DW$370, DW_AT_decl_column(0x1b)
    3928                    
    3929                    $C$DW$371       .dwtag  DW_TAG_member
    3930                            .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$70)
    3931                            .dwattr $C$DW$371, DW_AT_name("macDeviceEntry")
    3932                            .dwattr $C$DW$371, DW_AT_TI_symbol_name("macDeviceEntry")
    3933                            .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3934                            .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3935                            .dwattr $C$DW$371, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3936                            .dwattr $C$DW$371, DW_AT_decl_line(0x339)
    3937                            .dwattr $C$DW$371, DW_AT_decl_column(0x1b)
    3938                    
    3939                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3940                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x337)
    3941                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x01)
    3942                            .dwendtag $C$DW$T$71
    3943                    
    3944                    $C$DW$T$928     .dwtag  DW_TAG_typedef
    3945                            .dwattr $C$DW$T$928, DW_AT_name("macSecurityPibDeviceEntry_t")
    3946                            .dwattr $C$DW$T$928, DW_AT_type(*$C$DW$T$71)
    3947                            .dwattr $C$DW$T$928, DW_AT_language(DW_LANG_C)
    3948                            .dwattr $C$DW$T$928, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3949                            .dwattr $C$DW$T$928, DW_AT_decl_line(0x33a)
    3950                            .dwattr $C$DW$T$928, DW_AT_decl_column(0x03)
    3951                    
    3952                    
    3953                    $C$DW$T$73      .dwtag  DW_TAG_structure_type
    3954                            .dwattr $C$DW$T$73, DW_AT_byte_size(0x05)
    3955                    $C$DW$372       .dwtag  DW_TAG_member
    3956                            .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$25)
    3957                            .dwattr $C$DW$372, DW_AT_name("security_level_index")
    3958                            .dwattr $C$DW$372, DW_AT_TI_symbol_name("security_level_index")
    3959                            .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3960                            .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   73

    3961                            .dwattr $C$DW$372, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3962                            .dwattr $C$DW$372, DW_AT_decl_line(0x33e)
    3963                            .dwattr $C$DW$372, DW_AT_decl_column(0x1f)
    3964                    
    3965                    $C$DW$373       .dwtag  DW_TAG_member
    3966                            .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$72)
    3967                            .dwattr $C$DW$373, DW_AT_name("macSecurityLevelEntry")
    3968                            .dwattr $C$DW$373, DW_AT_TI_symbol_name("macSecurityLevelEntry")
    3969                            .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3970                            .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3971                            .dwattr $C$DW$373, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3972                            .dwattr $C$DW$373, DW_AT_decl_line(0x33f)
    3973                            .dwattr $C$DW$373, DW_AT_decl_column(0x1f)
    3974                    
    3975                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3976                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x33d)
    3977                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x01)
    3978                            .dwendtag $C$DW$T$73
    3979                    
    3980                    $C$DW$T$929     .dwtag  DW_TAG_typedef
    3981                            .dwattr $C$DW$T$929, DW_AT_name("macSecurityPibSecurityLevelEntry_t")
    3982                            .dwattr $C$DW$T$929, DW_AT_type(*$C$DW$T$73)
    3983                            .dwattr $C$DW$T$929, DW_AT_language(DW_LANG_C)
    3984                            .dwattr $C$DW$T$929, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3985                            .dwattr $C$DW$T$929, DW_AT_decl_line(0x340)
    3986                            .dwattr $C$DW$T$929, DW_AT_decl_column(0x03)
    3987                    
    3988                    
    3989                    $C$DW$T$81      .dwtag  DW_TAG_structure_type
    3990                            .dwattr $C$DW$T$81, DW_AT_byte_size(0x78)
    3991                    $C$DW$374       .dwtag  DW_TAG_member
    3992                            .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$41)
    3993                            .dwattr $C$DW$374, DW_AT_name("timestamp")
    3994                            .dwattr $C$DW$374, DW_AT_TI_symbol_name("timestamp")
    3995                            .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3996                            .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3997                            .dwattr $C$DW$374, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3998                            .dwattr $C$DW$374, DW_AT_decl_line(0x356)
    3999                            .dwattr $C$DW$374, DW_AT_decl_column(0x19)
    4000                    
    4001                    $C$DW$375       .dwtag  DW_TAG_member
    4002                            .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$27)
    4003                            .dwattr $C$DW$375, DW_AT_name("timestamp2")
    4004                            .dwattr $C$DW$375, DW_AT_TI_symbol_name("timestamp2")
    4005                            .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4006                            .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4007                            .dwattr $C$DW$375, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4008                            .dwattr $C$DW$375, DW_AT_decl_line(0x357)
    4009                            .dwattr $C$DW$375, DW_AT_decl_column(0x19)
    4010                    
    4011                    $C$DW$376       .dwtag  DW_TAG_member
    4012                            .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$27)
    4013                            .dwattr $C$DW$376, DW_AT_name("timeToLive")
    4014                            .dwattr $C$DW$376, DW_AT_TI_symbol_name("timeToLive")
    4015                            .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CDB0CAA9-14B3-431F-BE0E-4E87F94F367C} PAGE   74

    4016                            .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4017                            .dwattr $C$DW$376, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4018                            .dwattr $C$DW$376, DW_AT_decl_line(0x358)
    4019                            .dwattr $C$DW$376, DW_AT_decl_column(0x19)
    4020                    
