TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Nov 28 13:22:08 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/OSAL/osal_timers.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Adrian\workspace_v8\collector_cc1350lp\collector_cc
      13                    $C$DW$1 .dwtag  DW_TAG_variable

    1929                    
    1930                    $C$DW$T$191     .dwtag  DW_TAG_typedef
    1931                            .dwattr $C$DW$T$191, DW_AT_name("tFlashStateCommandsType")
    1932                            .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$190)
    1933                            .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    1934                            .dwattr $C$DW$T$191, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    1935                            .dwattr $C$DW$T$191, DW_AT_decl_line(0xb0)
    1936                            .dwattr $C$DW$T$191, DW_AT_decl_column(0x03)
    1937                    
    1938                    
    1939                    $C$DW$T$192     .dwtag  DW_TAG_enumeration_type
    1940                            .dwattr $C$DW$T$192, DW_AT_byte_size(0x01)
    1941                    $C$DW$118       .dwtag  DW_TAG_enumerator
    1942                            .dwattr $C$DW$118, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    1943                            .dwattr $C$DW$118, DW_AT_const_value(0xe0)
    1944                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1945                            .dwattr $C$DW$118, DW_AT_decl_line(0x3de)
    1946                            .dwattr $C$DW$118, DW_AT_decl_column(0x04)
    1947                    
    1948                    $C$DW$119       .dwtag  DW_TAG_enumerator
    1949                            .dwattr $C$DW$119, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    1950                            .dwattr $C$DW$119, DW_AT_const_value(0xe1)
    1951                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1952                            .dwattr $C$DW$119, DW_AT_decl_line(0x3e0)
    1953                            .dwattr $C$DW$119, DW_AT_decl_column(0x04)
    1954                    
    1955                    $C$DW$120       .dwtag  DW_TAG_enumerator
    1956                            .dwattr $C$DW$120, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    1957                            .dwattr $C$DW$120, DW_AT_const_value(0xe2)
    1958                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1959                            .dwattr $C$DW$120, DW_AT_decl_line(0x3e2)
    1960                            .dwattr $C$DW$120, DW_AT_decl_column(0x04)
    1961                    
    1962                    $C$DW$121       .dwtag  DW_TAG_enumerator
    1963                            .dwattr $C$DW$121, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    1964                            .dwattr $C$DW$121, DW_AT_const_value(0xe3)
    1965                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1966                            .dwattr $C$DW$121, DW_AT_decl_line(0x3e4)
    1967                            .dwattr $C$DW$121, DW_AT_decl_column(0x04)
    1968                    
    1969                    $C$DW$122       .dwtag  DW_TAG_enumerator
    1970                            .dwattr $C$DW$122, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   37

    1971                            .dwattr $C$DW$122, DW_AT_const_value(0xe4)
    1972                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1973                            .dwattr $C$DW$122, DW_AT_decl_line(0x3e6)
    1974                            .dwattr $C$DW$122, DW_AT_decl_column(0x04)
    1975                    
    1976                    $C$DW$123       .dwtag  DW_TAG_enumerator
    1977                            .dwattr $C$DW$123, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    1978                            .dwattr $C$DW$123, DW_AT_const_value(0xe5)
    1979                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1980                            .dwattr $C$DW$123, DW_AT_decl_line(0x3e8)
    1981                            .dwattr $C$DW$123, DW_AT_decl_column(0x04)
    1982                    
    1983                            .dwattr $C$DW$T$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1984                            .dwattr $C$DW$T$192, DW_AT_decl_line(0x3dc)
    1985                            .dwattr $C$DW$T$192, DW_AT_decl_column(0x01)
    1986                            .dwendtag $C$DW$T$192
    1987                    
    1988                    $C$DW$T$193     .dwtag  DW_TAG_typedef
    1989                            .dwattr $C$DW$T$193, DW_AT_name("ICall_RemotiCmdEvent_t")
    1990                            .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$192)
    1991                            .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    1992                            .dwattr $C$DW$T$193, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1993                            .dwattr $C$DW$T$193, DW_AT_decl_line(0x3e9)
    1994                            .dwattr $C$DW$T$193, DW_AT_decl_column(0x02)
    1995                    
    1996                    
    1997                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1998                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    1999                    $C$DW$124       .dwtag  DW_TAG_member
    2000                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$3)
    2001                            .dwattr $C$DW$124, DW_AT_name("next")
    2002                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("next")
    2003                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2004                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2005                            .dwattr $C$DW$124, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2006                            .dwattr $C$DW$124, DW_AT_decl_line(0x4d)
    2007                            .dwattr $C$DW$124, DW_AT_decl_column(0x0b)
    2008                    
    2009                    $C$DW$125       .dwtag  DW_TAG_member
    2010                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$21)
    2011                            .dwattr $C$DW$125, DW_AT_name("timeout")
    2012                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("timeout")
    2013                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2014                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2015                            .dwattr $C$DW$125, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2016                            .dwattr $C$DW$125, DW_AT_decl_line(0x4e)
    2017                            .dwattr $C$DW$125, DW_AT_decl_column(0x0e)
    2018                    
    2019                    $C$DW$126       .dwtag  DW_TAG_member
    2020                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$22)
    2021                            .dwattr $C$DW$126, DW_AT_name("event_flag")
    2022                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("event_flag")
    2023                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2024                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2025                            .dwattr $C$DW$126, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   38

    2026                            .dwattr $C$DW$126, DW_AT_decl_line(0x4f)
    2027                            .dwattr $C$DW$126, DW_AT_decl_column(0x0a)
    2028                    
    2029                    $C$DW$127       .dwtag  DW_TAG_member
    2030                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$23)
    2031                            .dwattr $C$DW$127, DW_AT_name("task_id")
    2032                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("task_id")
    2033                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2034                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2035                            .dwattr $C$DW$127, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2036                            .dwattr $C$DW$127, DW_AT_decl_line(0x50)
    2037                            .dwattr $C$DW$127, DW_AT_decl_column(0x0a)
    2038                    
    2039                    $C$DW$128       .dwtag  DW_TAG_member
    2040                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$24)
    2041                            .dwattr $C$DW$128, DW_AT_name("reloadTimeout")
    2042                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("reloadTimeout")
    2043                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2044                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2045                            .dwattr $C$DW$128, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2046                            .dwattr $C$DW$128, DW_AT_decl_line(0x51)
    2047                            .dwattr $C$DW$128, DW_AT_decl_column(0x0a)
    2048                    
    2049                            .dwattr $C$DW$T$25, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2050                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x4c)
    2051                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    2052                            .dwendtag $C$DW$T$25
    2053                    
    2054                    $C$DW$T$107     .dwtag  DW_TAG_pointer_type
    2055                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$25)
    2056                            .dwattr $C$DW$T$107, DW_AT_address_class(0x20)
    2057                    
    2058                    $C$DW$T$200     .dwtag  DW_TAG_typedef
    2059                            .dwattr $C$DW$T$200, DW_AT_name("osalTimerRec_t")
    2060                            .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$25)
    2061                            .dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
    2062                            .dwattr $C$DW$T$200, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2063                            .dwattr $C$DW$T$200, DW_AT_decl_line(0x52)
    2064                            .dwattr $C$DW$T$200, DW_AT_decl_column(0x03)
    2065                    
    2066                    $C$DW$T$201     .dwtag  DW_TAG_pointer_type
    2067                            .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$200)
    2068                            .dwattr $C$DW$T$201, DW_AT_address_class(0x20)
    2069                    
    2070                    $C$DW$T$204     .dwtag  DW_TAG_const_type
    2071                            .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$201)
    2072                    
    2073                    
    2074                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2075                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
    2076                    $C$DW$129       .dwtag  DW_TAG_member
    2077                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$14)
    2078                            .dwattr $C$DW$129, DW_AT_name("__max_align1")
    2079                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("__max_align1")
    2080                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   39

    2081                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2082                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    2083                            .dwattr $C$DW$129, DW_AT_decl_line(0x70)
    2084                            .dwattr $C$DW$129, DW_AT_decl_column(0x0c)
    2085                    
    2086                    $C$DW$130       .dwtag  DW_TAG_member
    2087                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$18)
    2088                            .dwattr $C$DW$130, DW_AT_name("__max_align2")
    2089                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("__max_align2")
    2090                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2091                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2092                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    2093                            .dwattr $C$DW$130, DW_AT_decl_line(0x71)
    2094                            .dwattr $C$DW$130, DW_AT_decl_column(0x0e)
    2095                    
    2096                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    2097                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x6f)
    2098                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    2099                            .dwendtag $C$DW$T$26
    2100                    
    2101                    $C$DW$T$205     .dwtag  DW_TAG_typedef
    2102                            .dwattr $C$DW$T$205, DW_AT_name("__max_align_t")
    2103                            .dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$26)
    2104                            .dwattr $C$DW$T$205, DW_AT_language(DW_LANG_C)
    2105                            .dwattr $C$DW$T$205, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    2106                            .dwattr $C$DW$T$205, DW_AT_decl_line(0x72)
    2107                            .dwattr $C$DW$T$205, DW_AT_decl_column(0x03)
    2108                    
    2109                    
    2110                    $C$DW$T$71      .dwtag  DW_TAG_structure_type
    2111                            .dwattr $C$DW$T$71, DW_AT_byte_size(0x4c)
    2112                    $C$DW$131       .dwtag  DW_TAG_member
    2113                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$34)
    2114                            .dwattr $C$DW$131, DW_AT_name("Crc32")
    2115                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("Crc32")
    2116                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2117                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2118                            .dwattr $C$DW$131, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2119                            .dwattr $C$DW$131, DW_AT_decl_line(0x76)
    2120                            .dwattr $C$DW$131, DW_AT_decl_column(0x25)
    2121                    
    2122                    $C$DW$132       .dwtag  DW_TAG_member
    2123                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$37)
    2124                            .dwattr $C$DW$132, DW_AT_name("FlashGetSize")
    2125                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("FlashGetSize")
    2126                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2127                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2128                            .dwattr $C$DW$132, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2129                            .dwattr $C$DW$132, DW_AT_decl_line(0x77)
    2130                            .dwattr $C$DW$132, DW_AT_decl_column(0x25)
    2131                    
    2132                    $C$DW$133       .dwtag  DW_TAG_member
    2133                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$38)
    2134                            .dwattr $C$DW$133, DW_AT_name("GetChipId")
    2135                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("GetChipId")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   40

    2136                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2137                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2138                            .dwattr $C$DW$133, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2139                            .dwattr $C$DW$133, DW_AT_decl_line(0x78)
    2140                            .dwattr $C$DW$133, DW_AT_decl_column(0x25)
    2141                    
    2142                    $C$DW$134       .dwtag  DW_TAG_member
    2143                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$41)
    2144                            .dwattr $C$DW$134, DW_AT_name("ReservedLocation1")
    2145                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("ReservedLocation1")
    2146                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2147                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2148                            .dwattr $C$DW$134, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2149                            .dwattr $C$DW$134, DW_AT_decl_line(0x79)
    2150                            .dwattr $C$DW$134, DW_AT_decl_column(0x25)
    2151                    
    2152                    $C$DW$135       .dwtag  DW_TAG_member
    2153                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$42)
    2154                            .dwattr $C$DW$135, DW_AT_name("ReservedLocation2")
    2155                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("ReservedLocation2")
    2156                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2157                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2158                            .dwattr $C$DW$135, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2159                            .dwattr $C$DW$135, DW_AT_decl_line(0x7a)
    2160                            .dwattr $C$DW$135, DW_AT_decl_column(0x25)
    2161                    
    2162                    $C$DW$136       .dwtag  DW_TAG_member
    2163                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$43)
    2164                            .dwattr $C$DW$136, DW_AT_name("ReservedLocation3")
    2165                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("ReservedLocation3")
    2166                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2167                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2168                            .dwattr $C$DW$136, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2169                            .dwattr $C$DW$136, DW_AT_decl_line(0x7b)
    2170                            .dwattr $C$DW$136, DW_AT_decl_column(0x25)
    2171                    
    2172                    $C$DW$137       .dwtag  DW_TAG_member
    2173                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$46)
    2174                            .dwattr $C$DW$137, DW_AT_name("ResetDevice")
    2175                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("ResetDevice")
    2176                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2177                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2178                            .dwattr $C$DW$137, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2179                            .dwattr $C$DW$137, DW_AT_decl_line(0x7c)
    2180                            .dwattr $C$DW$137, DW_AT_decl_column(0x25)
    2181                    
    2182                    $C$DW$138       .dwtag  DW_TAG_member
    2183                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$52)
    2184                            .dwattr $C$DW$138, DW_AT_name("Fletcher32")
    2185                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("Fletcher32")
    2186                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2187                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2188                            .dwattr $C$DW$138, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2189                            .dwattr $C$DW$138, DW_AT_decl_line(0x7d)
    2190                            .dwattr $C$DW$138, DW_AT_decl_column(0x25)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   41

    2191                    
    2192                    $C$DW$139       .dwtag  DW_TAG_member
    2193                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$56)
    2194                            .dwattr $C$DW$139, DW_AT_name("MinValue")
    2195                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("MinValue")
    2196                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2197                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2198                            .dwattr $C$DW$139, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2199                            .dwattr $C$DW$139, DW_AT_decl_line(0x7e)
    2200                            .dwattr $C$DW$139, DW_AT_decl_column(0x25)
    2201                    
    2202                    $C$DW$140       .dwtag  DW_TAG_member
    2203                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$57)
    2204                            .dwattr $C$DW$140, DW_AT_name("MaxValue")
    2205                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("MaxValue")
    2206                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2207                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2208                            .dwattr $C$DW$140, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2209                            .dwattr $C$DW$140, DW_AT_decl_line(0x7f)
    2210                            .dwattr $C$DW$140, DW_AT_decl_column(0x25)
    2211                    
    2212                    $C$DW$141       .dwtag  DW_TAG_member
    2213                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$58)
    2214                            .dwattr $C$DW$141, DW_AT_name("MeanValue")
    2215                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("MeanValue")
    2216                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2217                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2218                            .dwattr $C$DW$141, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2219                            .dwattr $C$DW$141, DW_AT_decl_line(0x80)
    2220                            .dwattr $C$DW$141, DW_AT_decl_column(0x25)
    2221                    
    2222                    $C$DW$142       .dwtag  DW_TAG_member
    2223                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$59)
    2224                            .dwattr $C$DW$142, DW_AT_name("StandDeviationValue")
    2225                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("StandDeviationValue")
    2226                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2227                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2228                            .dwattr $C$DW$142, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2229                            .dwattr $C$DW$142, DW_AT_decl_line(0x81)
    2230                            .dwattr $C$DW$142, DW_AT_decl_column(0x25)
    2231                    
    2232                    $C$DW$143       .dwtag  DW_TAG_member
    2233                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$62)
    2234                            .dwattr $C$DW$143, DW_AT_name("ReservedLocation4")
    2235                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("ReservedLocation4")
    2236                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2237                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2238                            .dwattr $C$DW$143, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2239                            .dwattr $C$DW$143, DW_AT_decl_line(0x82)
    2240                            .dwattr $C$DW$143, DW_AT_decl_column(0x25)
    2241                    
    2242                    $C$DW$144       .dwtag  DW_TAG_member
    2243                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$63)
    2244                            .dwattr $C$DW$144, DW_AT_name("ReservedLocation5")
    2245                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("ReservedLocation5")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   42

    2246                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2247                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2248                            .dwattr $C$DW$144, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2249                            .dwattr $C$DW$144, DW_AT_decl_line(0x83)
    2250                            .dwattr $C$DW$144, DW_AT_decl_column(0x25)
    2251                    
    2252                    $C$DW$145       .dwtag  DW_TAG_member
    2253                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$64)
    2254                            .dwattr $C$DW$145, DW_AT_name("HFSourceSafeSwitch")
    2255                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    2256                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2257                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2258                            .dwattr $C$DW$145, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2259                            .dwattr $C$DW$145, DW_AT_decl_line(0x84)
    2260                            .dwattr $C$DW$145, DW_AT_decl_column(0x25)
    2261                    
    2262                    $C$DW$146       .dwtag  DW_TAG_member
    2263                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$67)
    2264                            .dwattr $C$DW$146, DW_AT_name("SelectCompAInput")
    2265                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("SelectCompAInput")
    2266                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2267                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2268                            .dwattr $C$DW$146, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2269                            .dwattr $C$DW$146, DW_AT_decl_line(0x85)
    2270                            .dwattr $C$DW$146, DW_AT_decl_column(0x25)
    2271                    
    2272                    $C$DW$147       .dwtag  DW_TAG_member
    2273                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$68)
    2274                            .dwattr $C$DW$147, DW_AT_name("SelectCompARef")
    2275                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("SelectCompARef")
    2276                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2277                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2278                            .dwattr $C$DW$147, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2279                            .dwattr $C$DW$147, DW_AT_decl_line(0x86)
    2280                            .dwattr $C$DW$147, DW_AT_decl_column(0x25)
    2281                    
    2282                    $C$DW$148       .dwtag  DW_TAG_member
    2283                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$69)
    2284                            .dwattr $C$DW$148, DW_AT_name("SelectADCCompBInput")
    2285                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("SelectADCCompBInput")
    2286                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2287                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2288                            .dwattr $C$DW$148, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2289                            .dwattr $C$DW$148, DW_AT_decl_line(0x87)
    2290                            .dwattr $C$DW$148, DW_AT_decl_column(0x25)
    2291                    
    2292                    $C$DW$149       .dwtag  DW_TAG_member
    2293                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$70)
    2294                            .dwattr $C$DW$149, DW_AT_name("SelectCompBRef")
    2295                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("SelectCompBRef")
    2296                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2297                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2298                            .dwattr $C$DW$149, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2299                            .dwattr $C$DW$149, DW_AT_decl_line(0x88)
    2300                            .dwattr $C$DW$149, DW_AT_decl_column(0x25)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   43

    2301                    
    2302                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    2303                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x75)
    2304                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x01)
    2305                            .dwendtag $C$DW$T$71
    2306                    
    2307                    $C$DW$T$206     .dwtag  DW_TAG_typedef
    2308                            .dwattr $C$DW$T$206, DW_AT_name("HARD_API_T")
    2309                            .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$71)
    2310                            .dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
    2311                            .dwattr $C$DW$T$206, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    2312                            .dwattr $C$DW$T$206, DW_AT_decl_line(0x89)
    2313                            .dwattr $C$DW$T$206, DW_AT_decl_column(0x03)
    2314                    
    2315                    
    2316                    $C$DW$T$72      .dwtag  DW_TAG_structure_type
    2317                            .dwattr $C$DW$T$72, DW_AT_byte_size(0x08)
    2318                    $C$DW$150       .dwtag  DW_TAG_member
    2319                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$10)
    2320                            .dwattr $C$DW$150, DW_AT_name("quot")
    2321                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("quot")
    2322                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2323                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2324                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    2325                            .dwattr $C$DW$150, DW_AT_decl_line(0x49)
    2326                            .dwattr $C$DW$150, DW_AT_decl_column(0x16)
    2327                    
    2328                    $C$DW$151       .dwtag  DW_TAG_member
    2329                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$10)
    2330                            .dwattr $C$DW$151, DW_AT_name("rem")
    2331                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("rem")
    2332                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2333                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2334                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    2335                            .dwattr $C$DW$151, DW_AT_decl_line(0x49)
    2336                            .dwattr $C$DW$151, DW_AT_decl_column(0x1c)
    2337                    
    2338                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    2339                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x49)
    2340                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x10)
    2341                            .dwendtag $C$DW$T$72
    2342                    
    2343                    $C$DW$T$207     .dwtag  DW_TAG_typedef
    2344                            .dwattr $C$DW$T$207, DW_AT_name("div_t")
    2345                            .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$72)
    2346                            .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
    2347                            .dwattr $C$DW$T$207, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    2348                            .dwattr $C$DW$T$207, DW_AT_decl_line(0x49)
    2349                            .dwattr $C$DW$T$207, DW_AT_decl_column(0x23)
    2350                    
    2351                    
    2352                    $C$DW$T$73      .dwtag  DW_TAG_structure_type
    2353                            .dwattr $C$DW$T$73, DW_AT_byte_size(0x08)
    2354                    $C$DW$152       .dwtag  DW_TAG_member
    2355                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$10)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   44

    2356                            .dwattr $C$DW$152, DW_AT_name("quot")
    2357                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("quot")
    2358                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2359                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2360                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    2361                            .dwattr $C$DW$152, DW_AT_decl_line(0x4e)
    2362                            .dwattr $C$DW$152, DW_AT_decl_column(0x16)
    2363                    
    2364                    $C$DW$153       .dwtag  DW_TAG_member
    2365                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$10)
    2366                            .dwattr $C$DW$153, DW_AT_name("rem")
    2367                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("rem")
    2368                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2369                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2370                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    2371                            .dwattr $C$DW$153, DW_AT_decl_line(0x4e)
    2372                            .dwattr $C$DW$153, DW_AT_decl_column(0x1c)
    2373                    
    2374                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    2375                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x4e)
    2376                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x10)
    2377                            .dwendtag $C$DW$T$73
    2378                    
    2379                    $C$DW$T$208     .dwtag  DW_TAG_typedef
    2380                            .dwattr $C$DW$T$208, DW_AT_name("ldiv_t")
    2381                            .dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$73)
    2382                            .dwattr $C$DW$T$208, DW_AT_language(DW_LANG_C)
    2383                            .dwattr $C$DW$T$208, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    2384                            .dwattr $C$DW$T$208, DW_AT_decl_line(0x4e)
    2385                            .dwattr $C$DW$T$208, DW_AT_decl_column(0x23)
    2386                    
    2387                    
    2388                    $C$DW$T$74      .dwtag  DW_TAG_structure_type
    2389                            .dwattr $C$DW$T$74, DW_AT_byte_size(0x10)
    2390                    $C$DW$154       .dwtag  DW_TAG_member
    2391                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$14)
    2392                            .dwattr $C$DW$154, DW_AT_name("quot")
    2393                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("quot")
    2394                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2395                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2396                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    2397                            .dwattr $C$DW$154, DW_AT_decl_line(0x56)
    2398                            .dwattr $C$DW$154, DW_AT_decl_column(0x1c)
    2399                    
    2400                    $C$DW$155       .dwtag  DW_TAG_member
    2401                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$14)
    2402                            .dwattr $C$DW$155, DW_AT_name("rem")
    2403                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("rem")
    2404                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2405                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2406                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    2407                            .dwattr $C$DW$155, DW_AT_decl_line(0x56)
    2408                            .dwattr $C$DW$155, DW_AT_decl_column(0x22)
    2409                    
    2410                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   45

    2411                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x56)
    2412                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x10)
    2413                            .dwendtag $C$DW$T$74
    2414                    
    2415                    $C$DW$T$209     .dwtag  DW_TAG_typedef
    2416                            .dwattr $C$DW$T$209, DW_AT_name("lldiv_t")
    2417                            .dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$74)
    2418                            .dwattr $C$DW$T$209, DW_AT_language(DW_LANG_C)
    2419                            .dwattr $C$DW$T$209, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    2420                            .dwattr $C$DW$T$209, DW_AT_decl_line(0x56)
    2421                            .dwattr $C$DW$T$209, DW_AT_decl_column(0x29)
    2422                    
    2423                    
    2424                    $C$DW$T$79      .dwtag  DW_TAG_structure_type
    2425                            .dwattr $C$DW$T$79, DW_AT_byte_size(0x08)
    2426                    $C$DW$156       .dwtag  DW_TAG_member
    2427                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$77)
    2428                            .dwattr $C$DW$156, DW_AT_name("pointerStack")
    2429                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("pointerStack")
    2430                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2431                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2432                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2433                            .dwattr $C$DW$156, DW_AT_decl_line(0x3f5)
    2434                            .dwattr $C$DW$156, DW_AT_decl_column(0x16)
    2435                    
    2436                    $C$DW$157       .dwtag  DW_TAG_member
    2437                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$78)
    2438                            .dwattr $C$DW$157, DW_AT_name("directAPI")
    2439                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("directAPI")
    2440                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2441                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2442                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2443                            .dwattr $C$DW$157, DW_AT_decl_line(0x3f6)
    2444                            .dwattr $C$DW$157, DW_AT_decl_column(0x15)
    2445                    
    2446                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2447                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x3f4)
    2448                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x01)
    2449                            .dwendtag $C$DW$T$79
    2450                    
    2451                    $C$DW$T$81      .dwtag  DW_TAG_typedef
    2452                            .dwattr $C$DW$T$81, DW_AT_name("icall_directAPIMsg_t")
    2453                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$79)
    2454                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    2455                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2456                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x3f7)
    2457                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x03)
    2458                    
    2459                    
    2460                    $C$DW$T$82      .dwtag  DW_TAG_structure_type
    2461                            .dwattr $C$DW$T$82, DW_AT_byte_size(0x14)
    2462                    $C$DW$158       .dwtag  DW_TAG_member
    2463                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$80)
    2464                            .dwattr $C$DW$158, DW_AT_name("hdr")
    2465                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("hdr")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   46

    2466                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2467                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2468                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2469                            .dwattr $C$DW$158, DW_AT_decl_line(0x3fb)
    2470                            .dwattr $C$DW$158, DW_AT_decl_column(0x10)
    2471                    
    2472                    $C$DW$159       .dwtag  DW_TAG_member
    2473                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$81)
    2474                            .dwattr $C$DW$159, DW_AT_name("msg")
    2475                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("msg")
    2476                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2477                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2478                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2479                            .dwattr $C$DW$159, DW_AT_decl_line(0x3fc)
    2480                            .dwattr $C$DW$159, DW_AT_decl_column(0x1a)
    2481                    
    2482                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2483                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x3fa)
    2484                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x01)
    2485                            .dwendtag $C$DW$T$82
    2486                    
    2487                    $C$DW$T$210     .dwtag  DW_TAG_typedef
    2488                            .dwattr $C$DW$T$210, DW_AT_name("icallLiteMsg_t")
    2489                            .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$82)
    2490                            .dwattr $C$DW$T$210, DW_AT_language(DW_LANG_C)
    2491                            .dwattr $C$DW$T$210, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2492                            .dwattr $C$DW$T$210, DW_AT_decl_line(0x3fd)
    2493                            .dwattr $C$DW$T$210, DW_AT_decl_column(0x03)
    2494                    
    2495                    
    2496                    $C$DW$T$85      .dwtag  DW_TAG_structure_type
    2497                            .dwattr $C$DW$T$85, DW_AT_byte_size(0x0c)
    2498                    $C$DW$160       .dwtag  DW_TAG_member
    2499                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$83)
    2500                            .dwattr $C$DW$160, DW_AT_name("bufferHead")
    2501                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("bufferHead")
    2502                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2503                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2504                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2505                            .dwattr $C$DW$160, DW_AT_decl_line(0x80)
    2506                            .dwattr $C$DW$160, DW_AT_decl_column(0x13)
    2507                    
    2508                    $C$DW$161       .dwtag  DW_TAG_member
    2509                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$83)
    2510                            .dwattr $C$DW$161, DW_AT_name("bufferTail")
    2511                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("bufferTail")
    2512                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2513                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2514                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2515                            .dwattr $C$DW$161, DW_AT_decl_line(0x81)
    2516                            .dwattr $C$DW$161, DW_AT_decl_column(0x13)
    2517                    
    2518                    $C$DW$162       .dwtag  DW_TAG_member
    2519                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$22)
    2520                            .dwattr $C$DW$162, DW_AT_name("maxBufSize")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   47

    2521                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("maxBufSize")
    2522                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2523                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2524                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2525                            .dwattr $C$DW$162, DW_AT_decl_line(0x82)
    2526                            .dwattr $C$DW$162, DW_AT_decl_column(0x0a)
    2527                    
    2528                    $C$DW$163       .dwtag  DW_TAG_member
    2529                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$84)
    2530                            .dwattr $C$DW$163, DW_AT_name("pBuffer")
    2531                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("pBuffer")
    2532                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2533                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2534                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2535                            .dwattr $C$DW$163, DW_AT_decl_line(0x83)
    2536                            .dwattr $C$DW$163, DW_AT_decl_column(0x0a)
    2537                    
    2538                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2539                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x7e)
    2540                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x01)
    2541                            .dwendtag $C$DW$T$85
    2542                    
    2543                    $C$DW$T$87      .dwtag  DW_TAG_typedef
    2544                            .dwattr $C$DW$T$87, DW_AT_name("halUARTBufControl_t")
    2545                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$85)
    2546                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2547                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2548                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x84)
    2549                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
    2550                    
    2551                    
    2552                    $C$DW$T$91      .dwtag  DW_TAG_structure_type
    2553                            .dwattr $C$DW$T$91, DW_AT_byte_size(0x2c)
    2554                    $C$DW$164       .dwtag  DW_TAG_member
    2555                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$86)
    2556                            .dwattr $C$DW$164, DW_AT_name("configured")
    2557                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("configured")
    2558                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2559                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2560                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2561                            .dwattr $C$DW$164, DW_AT_decl_line(0x88)
    2562                            .dwattr $C$DW$164, DW_AT_decl_column(0x17)
    2563                    
    2564                    $C$DW$165       .dwtag  DW_TAG_member
    2565                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$23)
    2566                            .dwattr $C$DW$165, DW_AT_name("baudRate")
    2567                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("baudRate")
    2568                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2569                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2570                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2571                            .dwattr $C$DW$165, DW_AT_decl_line(0x89)
    2572                            .dwattr $C$DW$165, DW_AT_decl_column(0x17)
    2573                    
    2574                    $C$DW$166       .dwtag  DW_TAG_member
    2575                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$86)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   48

    2576                            .dwattr $C$DW$166, DW_AT_name("flowControl")
    2577                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("flowControl")
    2578                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2579                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2580                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2581                            .dwattr $C$DW$166, DW_AT_decl_line(0x8a)
    2582                            .dwattr $C$DW$166, DW_AT_decl_column(0x17)
    2583                    
    2584                    $C$DW$167       .dwtag  DW_TAG_member
    2585                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$22)
    2586                            .dwattr $C$DW$167, DW_AT_name("flowControlThreshold")
    2587                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("flowControlThreshold")
    2588                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2589                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2590                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2591                            .dwattr $C$DW$167, DW_AT_decl_line(0x8b)
    2592                            .dwattr $C$DW$167, DW_AT_decl_column(0x17)
    2593                    
    2594                    $C$DW$168       .dwtag  DW_TAG_member
    2595                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$23)
    2596                            .dwattr $C$DW$168, DW_AT_name("idleTimeout")
    2597                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("idleTimeout")
    2598                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2599                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2600                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2601                            .dwattr $C$DW$168, DW_AT_decl_line(0x8c)
    2602                            .dwattr $C$DW$168, DW_AT_decl_column(0x17)
    2603                    
    2604                    $C$DW$169       .dwtag  DW_TAG_member
    2605                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$87)
    2606                            .dwattr $C$DW$169, DW_AT_name("rx")
    2607                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("rx")
    2608                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2609                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2610                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2611                            .dwattr $C$DW$169, DW_AT_decl_line(0x8d)
    2612                            .dwattr $C$DW$169, DW_AT_decl_column(0x17)
    2613                    
    2614                    $C$DW$170       .dwtag  DW_TAG_member
    2615                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$87)
    2616                            .dwattr $C$DW$170, DW_AT_name("tx")
    2617                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("tx")
    2618                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2619                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2620                            .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2621                            .dwattr $C$DW$170, DW_AT_decl_line(0x8e)
    2622                            .dwattr $C$DW$170, DW_AT_decl_column(0x17)
    2623                    
    2624                    $C$DW$171       .dwtag  DW_TAG_member
    2625                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$86)
    2626                            .dwattr $C$DW$171, DW_AT_name("intEnable")
    2627                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("intEnable")
    2628                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2629                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2630                            .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   49

    2631                            .dwattr $C$DW$171, DW_AT_decl_line(0x8f)
    2632                            .dwattr $C$DW$171, DW_AT_decl_column(0x17)
    2633                    
    2634                    $C$DW$172       .dwtag  DW_TAG_member
    2635                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$24)
    2636                            .dwattr $C$DW$172, DW_AT_name("rxChRvdTime")
    2637                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("rxChRvdTime")
    2638                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2639                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2640                            .dwattr $C$DW$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2641                            .dwattr $C$DW$172, DW_AT_decl_line(0x90)
    2642                            .dwattr $C$DW$172, DW_AT_decl_column(0x17)
    2643                    
    2644                    $C$DW$173       .dwtag  DW_TAG_member
    2645                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$90)
    2646                            .dwattr $C$DW$173, DW_AT_name("callBackFunc")
    2647                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("callBackFunc")
    2648                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2649                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2650                            .dwattr $C$DW$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2651                            .dwattr $C$DW$173, DW_AT_decl_line(0x91)
    2652                            .dwattr $C$DW$173, DW_AT_decl_column(0x17)
    2653                    
    2654                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2655                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x87)
    2656                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x01)
    2657                            .dwendtag $C$DW$T$91
    2658                    
    2659                    $C$DW$T$211     .dwtag  DW_TAG_typedef
    2660                            .dwattr $C$DW$T$211, DW_AT_name("halUARTCfg_t")
    2661                            .dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$91)
    2662                            .dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
    2663                            .dwattr $C$DW$T$211, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2664                            .dwattr $C$DW$T$211, DW_AT_decl_line(0x92)
    2665                            .dwattr $C$DW$T$211, DW_AT_decl_column(0x02)
    2666                    
    2667                    
    2668                    $C$DW$T$92      .dwtag  DW_TAG_structure_type
    2669                            .dwattr $C$DW$T$92, DW_AT_byte_size(0x02)
    2670                    $C$DW$174       .dwtag  DW_TAG_member
    2671                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$23)
    2672                            .dwattr $C$DW$174, DW_AT_name("event")
    2673                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("event")
    2674                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2675                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2676                            .dwattr $C$DW$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2677                            .dwattr $C$DW$174, DW_AT_decl_line(0x79)
    2678                            .dwattr $C$DW$174, DW_AT_decl_column(0x0a)
    2679                    
    2680                    $C$DW$175       .dwtag  DW_TAG_member
    2681                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$23)
    2682                            .dwattr $C$DW$175, DW_AT_name("status")
    2683                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("status")
    2684                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2685                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   50

    2686                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2687                            .dwattr $C$DW$175, DW_AT_decl_line(0x7a)
    2688                            .dwattr $C$DW$175, DW_AT_decl_column(0x0a)
    2689                    
    2690                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2691                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x78)
    2692                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x01)
    2693                            .dwendtag $C$DW$T$92
    2694                    
    2695                    $C$DW$T$93      .dwtag  DW_TAG_typedef
    2696                            .dwattr $C$DW$T$93, DW_AT_name("osal_event_hdr_t")
    2697                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    2698                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    2699                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2700                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x7b)
    2701                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x03)
    2702                    
    2703                    
    2704                    $C$DW$T$94      .dwtag  DW_TAG_structure_type
    2705                            .dwattr $C$DW$T$94, DW_AT_byte_size(0x04)
    2706                    $C$DW$176       .dwtag  DW_TAG_member
    2707                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$93)
    2708                            .dwattr $C$DW$176, DW_AT_name("hdr")
    2709                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("hdr")
    2710                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2711                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2712                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    2713                            .dwattr $C$DW$176, DW_AT_decl_line(0xbc)
    2714                            .dwattr $C$DW$176, DW_AT_decl_column(0x14)
    2715                    
    2716                    $C$DW$177       .dwtag  DW_TAG_member
    2717                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$23)
    2718                            .dwattr $C$DW$177, DW_AT_name("state")
    2719                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("state")
    2720                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2721                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2722                            .dwattr $C$DW$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    2723                            .dwattr $C$DW$177, DW_AT_decl_line(0xbd)
    2724                            .dwattr $C$DW$177, DW_AT_decl_column(0x09)
    2725                    
    2726                    $C$DW$178       .dwtag  DW_TAG_member
    2727                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$23)
    2728                            .dwattr $C$DW$178, DW_AT_name("keys")
    2729                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("keys")
    2730                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2731                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2732                            .dwattr $C$DW$178, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    2733                            .dwattr $C$DW$178, DW_AT_decl_line(0xbe)
    2734                            .dwattr $C$DW$178, DW_AT_decl_column(0x09)
    2735                    
    2736                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC13
    2737                            .dwattr $C$DW$T$94, DW_AT_decl_line(0xbb)
    2738                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x01)
    2739                            .dwendtag $C$DW$T$94
    2740                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   51

    2741                    $C$DW$T$212     .dwtag  DW_TAG_typedef
    2742                            .dwattr $C$DW$T$212, DW_AT_name("keyChange_t")
    2743                            .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$94)
    2744                            .dwattr $C$DW$T$212, DW_AT_language(DW_LANG_C)
    2745                            .dwattr $C$DW$T$212, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    2746                            .dwattr $C$DW$T$212, DW_AT_decl_line(0xbf)
    2747                            .dwattr $C$DW$T$212, DW_AT_decl_column(0x03)
    2748                    
    2749                    
    2750                    $C$DW$T$97      .dwtag  DW_TAG_union_type
    2751                            .dwattr $C$DW$T$97, DW_AT_byte_size(0x04)
    2752                    $C$DW$179       .dwtag  DW_TAG_member
    2753                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$24)
    2754                            .dwattr $C$DW$179, DW_AT_name("time32")
    2755                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("time32")
    2756                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2757                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2758                            .dwattr $C$DW$179, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2759                            .dwattr $C$DW$179, DW_AT_decl_line(0x46)
    2760                            .dwattr $C$DW$179, DW_AT_decl_column(0x0a)
    2761                    
    2762                    $C$DW$180       .dwtag  DW_TAG_member
    2763                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$95)
    2764                            .dwattr $C$DW$180, DW_AT_name("time16")
    2765                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("time16")
    2766                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2767                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2768                            .dwattr $C$DW$180, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2769                            .dwattr $C$DW$180, DW_AT_decl_line(0x47)
    2770                            .dwattr $C$DW$180, DW_AT_decl_column(0x0a)
    2771                    
    2772                    $C$DW$181       .dwtag  DW_TAG_member
    2773                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$96)
    2774                            .dwattr $C$DW$181, DW_AT_name("time8")
    2775                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("time8")
    2776                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2777                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2778                            .dwattr $C$DW$181, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2779                            .dwattr $C$DW$181, DW_AT_decl_line(0x48)
    2780                            .dwattr $C$DW$181, DW_AT_decl_column(0x09)
    2781                    
    2782                            .dwattr $C$DW$T$97, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2783                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x45)
    2784                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x0f)
    2785                            .dwendtag $C$DW$T$97
    2786                    
    2787                    $C$DW$T$21      .dwtag  DW_TAG_typedef
    2788                            .dwattr $C$DW$T$21, DW_AT_name("osalTime_t")
    2789                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$97)
    2790                            .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    2791                            .dwattr $C$DW$T$21, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2792                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x49)
    2793                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x03)
    2794                    
    2795                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   52

    2796                    $C$DW$T$104     .dwtag  DW_TAG_union_type
    2797                            .dwattr $C$DW$T$104, DW_AT_byte_size(0x02)
    2798                    $C$DW$182       .dwtag  DW_TAG_member
    2799                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$100)
    2800                            .dwattr $C$DW$182, DW_AT_name("entityId")
    2801                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("entityId")
    2802                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2803                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2804                            .dwattr $C$DW$182, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2805                            .dwattr $C$DW$182, DW_AT_decl_line(0x1fe)
    2806                            .dwattr $C$DW$182, DW_AT_decl_column(0x14)
    2807                    
    2808                    $C$DW$183       .dwtag  DW_TAG_member
    2809                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$103)
    2810                            .dwattr $C$DW$183, DW_AT_name("servId")
    2811                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("servId")
    2812                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2813                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2814                            .dwattr $C$DW$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2815                            .dwattr $C$DW$183, DW_AT_decl_line(0x200)
    2816                            .dwattr $C$DW$183, DW_AT_decl_column(0x17)
    2817                    
    2818                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2819                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x1fc)
    2820                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x03)
    2821                            .dwendtag $C$DW$T$104
    2822                    
    2823                    
    2824                    $C$DW$T$105     .dwtag  DW_TAG_union_type
    2825                            .dwattr $C$DW$T$105, DW_AT_byte_size(0x02)
    2826                    $C$DW$184       .dwtag  DW_TAG_member
    2827                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$103)
    2828                            .dwattr $C$DW$184, DW_AT_name("servId")
    2829                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("servId")
    2830                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2831                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2832                            .dwattr $C$DW$184, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2833                            .dwattr $C$DW$184, DW_AT_decl_line(0x211)
    2834                            .dwattr $C$DW$184, DW_AT_decl_column(0x17)
    2835                    
    2836                    $C$DW$185       .dwtag  DW_TAG_member
    2837                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$100)
    2838                            .dwattr $C$DW$185, DW_AT_name("entityId")
    2839                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("entityId")
    2840                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2841                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2842                            .dwattr $C$DW$185, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2843                            .dwattr $C$DW$185, DW_AT_decl_line(0x213)
    2844                            .dwattr $C$DW$185, DW_AT_decl_column(0x14)
    2845                    
    2846                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2847                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x20f)
    2848                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x03)
    2849                            .dwendtag $C$DW$T$105
    2850                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   53

    2851                    
    2852                    $C$DW$T$106     .dwtag  DW_TAG_union_type
    2853                            .dwattr $C$DW$T$106, DW_AT_byte_size(0x02)
    2854                    $C$DW$186       .dwtag  DW_TAG_member
    2855                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$86)
    2856                            .dwattr $C$DW$186, DW_AT_name("paramCTS")
    2857                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("paramCTS")
    2858                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2859                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2860                            .dwattr $C$DW$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2861                            .dwattr $C$DW$186, DW_AT_decl_line(0x96)
    2862                            .dwattr $C$DW$186, DW_AT_decl_column(0x08)
    2863                    
    2864                    $C$DW$187       .dwtag  DW_TAG_member
    2865                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$86)
    2866                            .dwattr $C$DW$187, DW_AT_name("paramRTS")
    2867                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("paramRTS")
    2868                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2869                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2870                            .dwattr $C$DW$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2871                            .dwattr $C$DW$187, DW_AT_decl_line(0x97)
    2872                            .dwattr $C$DW$187, DW_AT_decl_column(0x08)
    2873                    
    2874                    $C$DW$188       .dwtag  DW_TAG_member
    2875                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$86)
    2876                            .dwattr $C$DW$188, DW_AT_name("paramDSR")
    2877                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("paramDSR")
    2878                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2879                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2880                            .dwattr $C$DW$188, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2881                            .dwattr $C$DW$188, DW_AT_decl_line(0x98)
    2882                            .dwattr $C$DW$188, DW_AT_decl_column(0x08)
    2883                    
    2884                    $C$DW$189       .dwtag  DW_TAG_member
    2885                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$86)
    2886                            .dwattr $C$DW$189, DW_AT_name("paramDTR")
    2887                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("paramDTR")
    2888                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2889                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2890                            .dwattr $C$DW$189, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2891                            .dwattr $C$DW$189, DW_AT_decl_line(0x99)
    2892                            .dwattr $C$DW$189, DW_AT_decl_column(0x08)
    2893                    
    2894                    $C$DW$190       .dwtag  DW_TAG_member
    2895                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$86)
    2896                            .dwattr $C$DW$190, DW_AT_name("paramCD")
    2897                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("paramCD")
    2898                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2899                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2900                            .dwattr $C$DW$190, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2901                            .dwattr $C$DW$190, DW_AT_decl_line(0x9a)
    2902                            .dwattr $C$DW$190, DW_AT_decl_column(0x08)
    2903                    
    2904                    $C$DW$191       .dwtag  DW_TAG_member
    2905                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$86)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   54

    2906                            .dwattr $C$DW$191, DW_AT_name("paramRI")
    2907                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("paramRI")
    2908                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2909                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2910                            .dwattr $C$DW$191, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2911                            .dwattr $C$DW$191, DW_AT_decl_line(0x9b)
    2912                            .dwattr $C$DW$191, DW_AT_decl_column(0x08)
    2913                    
    2914                    $C$DW$192       .dwtag  DW_TAG_member
    2915                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$22)
    2916                            .dwattr $C$DW$192, DW_AT_name("baudRate")
    2917                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("baudRate")
    2918                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2919                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2920                            .dwattr $C$DW$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2921                            .dwattr $C$DW$192, DW_AT_decl_line(0x9c)
    2922                            .dwattr $C$DW$192, DW_AT_decl_column(0x0a)
    2923                    
    2924                    $C$DW$193       .dwtag  DW_TAG_member
    2925                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$86)
    2926                            .dwattr $C$DW$193, DW_AT_name("flowControl")
    2927                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("flowControl")
    2928                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2929                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2930                            .dwattr $C$DW$193, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2931                            .dwattr $C$DW$193, DW_AT_decl_line(0x9d)
    2932                            .dwattr $C$DW$193, DW_AT_decl_column(0x08)
    2933                    
    2934                    $C$DW$194       .dwtag  DW_TAG_member
    2935                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$86)
    2936                            .dwattr $C$DW$194, DW_AT_name("flushControl")
    2937                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("flushControl")
    2938                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2939                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2940                            .dwattr $C$DW$194, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2941                            .dwattr $C$DW$194, DW_AT_decl_line(0x9e)
    2942                            .dwattr $C$DW$194, DW_AT_decl_column(0x08)
    2943                    
    2944                            .dwattr $C$DW$T$106, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2945                            .dwattr $C$DW$T$106, DW_AT_decl_line(0x95)
    2946                            .dwattr $C$DW$T$106, DW_AT_decl_column(0x01)
    2947                            .dwendtag $C$DW$T$106
    2948                    
    2949                    $C$DW$T$214     .dwtag  DW_TAG_typedef
    2950                            .dwattr $C$DW$T$214, DW_AT_name("halUARTIoctl_t")
    2951                            .dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$106)
    2952                            .dwattr $C$DW$T$214, DW_AT_language(DW_LANG_C)
    2953                            .dwattr $C$DW$T$214, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2954                            .dwattr $C$DW$T$214, DW_AT_decl_line(0x9f)
    2955                            .dwattr $C$DW$T$214, DW_AT_decl_column(0x02)
    2956                    
    2957                    
    2958                    $C$DW$T$108     .dwtag  DW_TAG_structure_type
    2959                            .dwattr $C$DW$T$108, DW_AT_name(".ggroup1")
    2960                            .dwattr $C$DW$T$108, DW_AT_byte_size(0x08)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   55

    2961                    $C$DW$195       .dwtag  DW_TAG_member
    2962                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$107)
    2963                            .dwattr $C$DW$195, DW_AT_name("timerHead")
    2964                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("timerHead")
    2965                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2966                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2967                    
    2968                    $C$DW$196       .dwtag  DW_TAG_member
    2969                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$11)
    2970                            .dwattr $C$DW$196, DW_AT_name("osal_systemClock")
    2971                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("osal_systemClock")
    2972                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2973                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2974                    
    2975                            .dwendtag $C$DW$T$108
    2976                    
    2977                    
    2978                    $C$DW$T$109     .dwtag  DW_TAG_structure_type
    2979                            .dwattr $C$DW$T$109, DW_AT_name("_ICall_LiteCmdStatus_")
    2980                            .dwattr $C$DW$T$109, DW_AT_byte_size(0x01)
    2981                    $C$DW$197       .dwtag  DW_TAG_member
    2982                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$99)
    2983                            .dwattr $C$DW$197, DW_AT_name("cmdId")
    2984                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("cmdId")
    2985                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2986                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2987                            .dwattr $C$DW$197, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2988                            .dwattr $C$DW$197, DW_AT_decl_line(0x3f0)
    2989                            .dwattr $C$DW$197, DW_AT_decl_column(0x11)
    2990                    
    2991                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2992                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x3ee)
    2993                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x10)
    2994                            .dwendtag $C$DW$T$109
    2995                    
    2996                    $C$DW$T$216     .dwtag  DW_TAG_typedef
    2997                            .dwattr $C$DW$T$216, DW_AT_name("ICall_LiteCmdStatus")
    2998                            .dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$109)
    2999                            .dwattr $C$DW$T$216, DW_AT_language(DW_LANG_C)
    3000                            .dwattr $C$DW$T$216, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3001                            .dwattr $C$DW$T$216, DW_AT_decl_line(0x3f1)
    3002                            .dwattr $C$DW$T$216, DW_AT_decl_column(0x03)
    3003                    
    3004                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3005                            .dwattr $C$DW$T$2, DW_AT_name("void")
    3006                    
    3007                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3008                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3009                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3010                    
    3011                    $C$DW$T$217     .dwtag  DW_TAG_typedef
    3012                            .dwattr $C$DW$T$217, DW_AT_name("ICall_Semaphore")
    3013                            .dwattr $C$DW$T$217, DW_AT_type(*$C$DW$T$3)
    3014                            .dwattr $C$DW$T$217, DW_AT_language(DW_LANG_C)
    3015                            .dwattr $C$DW$T$217, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   56

    3016                            .dwattr $C$DW$T$217, DW_AT_decl_line(0x1ac)
    3017                            .dwattr $C$DW$T$217, DW_AT_decl_column(0x0f)
    3018                    
    3019                    $C$DW$T$125     .dwtag  DW_TAG_typedef
    3020                            .dwattr $C$DW$T$125, DW_AT_name("ICall_SyncHandle")
    3021                            .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$3)
    3022                            .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    3023                            .dwattr $C$DW$T$125, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3024                            .dwattr $C$DW$T$125, DW_AT_decl_line(0x1aa)
    3025                            .dwattr $C$DW$T$125, DW_AT_decl_column(0x0f)
    3026                    
    3027                    $C$DW$T$172     .dwtag  DW_TAG_typedef
    3028                            .dwattr $C$DW$T$172, DW_AT_name("ICall_TimerID")
    3029                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$3)
    3030                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    3031                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3032                            .dwattr $C$DW$T$172, DW_AT_decl_line(0x1b7)
    3033                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x0f)
    3034                    
    3035                    $C$DW$T$221     .dwtag  DW_TAG_typedef
    3036                            .dwattr $C$DW$T$221, DW_AT_name("osal_msg_q_t")
    3037                            .dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$3)
    3038                            .dwattr $C$DW$T$221, DW_AT_language(DW_LANG_C)
    3039                            .dwattr $C$DW$T$221, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3040                            .dwattr $C$DW$T$221, DW_AT_decl_line(0x7d)
    3041                            .dwattr $C$DW$T$221, DW_AT_decl_column(0x10)
    3042                    
    3043                    
    3044                    $C$DW$T$44      .dwtag  DW_TAG_subroutine_type
    3045                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3046                            .dwendtag $C$DW$T$44
    3047                    
    3048                    $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    3049                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    3050                            .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    3051                    
    3052                    $C$DW$T$188     .dwtag  DW_TAG_typedef
    3053                            .dwattr $C$DW$T$188, DW_AT_name("APPASRTINTF_callAssrtHndler")
    3054                            .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$45)
    3055                            .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    3056                            .dwattr $C$DW$T$188, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3057                            .dwattr $C$DW$T$188, DW_AT_decl_line(0x43)
    3058                            .dwattr $C$DW$T$188, DW_AT_decl_column(0x10)
    3059                    
    3060                    $C$DW$T$64      .dwtag  DW_TAG_typedef
    3061                            .dwattr $C$DW$T$64, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
    3062                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$45)
    3063                            .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3064                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    3065                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x5f)
    3066                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x19)
    3067                    
    3068                    $C$DW$T$46      .dwtag  DW_TAG_typedef
    3069                            .dwattr $C$DW$T$46, DW_AT_name("FPTR_RESETDEV_T")
    3070                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{F07B9D19-9E85-49D0-8C28-F47CDB008C41} PAGE   57

    3071                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    3072                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    3073                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x4d)
    3074                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x19)
    3075                    
    3076                    $C$DW$T$222     .dwtag  DW_TAG_typedef
    3077                            .dwattr $C$DW$T$222, DW_AT_name("FPTR_VOID_VOID_T")
    3078                            .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$45)
    3079                            .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    3080                            .dwattr $C$DW$T$222, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    3081                            .dwattr $C$DW$T$222, DW_AT_decl_line(0x33)
    3082                            .dwattr $C$DW$T$222, DW_AT_decl_column(0x11)
    3083                    
    3084                    $C$DW$T$223     .dwtag  DW_TAG_typedef
    3085                            .dwattr $C$DW$T$223, DW_AT_name("__TI_atexit_fn")
    3086                            .dwattr $C$DW$T$223, DW_AT_type(*$C$DW$T$45)
    3087                            .dwattr $C$DW$T$223, DW_AT_language(DW_LANG_C)
    3088                            .dwattr $C$DW$T$223, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    3089                            .dwattr $C$DW$T$223, DW_AT_decl_line(0xb2)
    3090                            .dwattr $C$DW$T$223, DW_AT_decl_column(0x14)
    3091                    
    3092                    
    3093                    $C$DW$T$60      .dwtag  DW_TAG_subroutine_type
    3094                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    3095                    $C$DW$198       .dwtag  DW_TAG_formal_parameter
    3096                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$28)
    3097                    
    3098                            .dwendtag $C$DW$T$60
    3099                    
    3100                    $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    3101                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    3102                            .dwattr $C$DW$T$61, DW_AT_address_class(0x20)
    3103                    
    3104                    $C$DW$T$62      .dwtag  DW_TAG_typedef
    3105                            .dwattr $C$DW$T$62, DW_AT_name("FPTR_RESERVED4_T")
    3106                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    3107                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3108                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    3109                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x61)
    3110                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x19)
    3111                    
    3112                    $C$DW$T$63      .dwtag  DW_TAG_typedef
    3113                            .dwattr $C$DW$T$63, DW_AT_name("FPTR_RESERVED5_T")
    3114                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$61)
    3115                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
