TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Nov 28 13:34:31 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/ICall/icall_cc2650.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\sensor_cc1350lp
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    1659                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
    1660                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
    1661                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
    1662                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
    1663                    
    1664                    ;******************************************************************************
    1665                    ;* TYPE INFORMATION                                                           *
    1666                    ;******************************************************************************
    1667                    
    1668                    $C$DW$T$169     .dwtag  DW_TAG_enumeration_type
    1669                            .dwattr $C$DW$T$169, DW_AT_byte_size(0x01)
    1670                    $C$DW$111       .dwtag  DW_TAG_enumerator
    1671                            .dwattr $C$DW$111, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    1672                            .dwattr $C$DW$111, DW_AT_const_value(0xe0)
    1673                            .dwattr $C$DW$111, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1674                            .dwattr $C$DW$111, DW_AT_decl_line(0x3de)
    1675                            .dwattr $C$DW$111, DW_AT_decl_column(0x04)
    1676                    
    1677                    $C$DW$112       .dwtag  DW_TAG_enumerator
    1678                            .dwattr $C$DW$112, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    1679                            .dwattr $C$DW$112, DW_AT_const_value(0xe1)
    1680                            .dwattr $C$DW$112, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1681                            .dwattr $C$DW$112, DW_AT_decl_line(0x3e0)
    1682                            .dwattr $C$DW$112, DW_AT_decl_column(0x04)
    1683                    
    1684                    $C$DW$113       .dwtag  DW_TAG_enumerator
    1685                            .dwattr $C$DW$113, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    1686                            .dwattr $C$DW$113, DW_AT_const_value(0xe2)
    1687                            .dwattr $C$DW$113, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1688                            .dwattr $C$DW$113, DW_AT_decl_line(0x3e2)
    1689                            .dwattr $C$DW$113, DW_AT_decl_column(0x04)
    1690                    
    1691                    $C$DW$114       .dwtag  DW_TAG_enumerator
    1692                            .dwattr $C$DW$114, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    1693                            .dwattr $C$DW$114, DW_AT_const_value(0xe3)
    1694                            .dwattr $C$DW$114, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1695                            .dwattr $C$DW$114, DW_AT_decl_line(0x3e4)
    1696                            .dwattr $C$DW$114, DW_AT_decl_column(0x04)
    1697                    
    1698                    $C$DW$115       .dwtag  DW_TAG_enumerator
    1699                            .dwattr $C$DW$115, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    1700                            .dwattr $C$DW$115, DW_AT_const_value(0xe4)
    1701                            .dwattr $C$DW$115, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1702                            .dwattr $C$DW$115, DW_AT_decl_line(0x3e6)
    1703                            .dwattr $C$DW$115, DW_AT_decl_column(0x04)
    1704                    
    1705                    $C$DW$116       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   32

    1706                            .dwattr $C$DW$116, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    1707                            .dwattr $C$DW$116, DW_AT_const_value(0xe5)
    1708                            .dwattr $C$DW$116, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1709                            .dwattr $C$DW$116, DW_AT_decl_line(0x3e8)
    1710                            .dwattr $C$DW$116, DW_AT_decl_column(0x04)
    1711                    
    1712                            .dwattr $C$DW$T$169, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154st
    1713                            .dwattr $C$DW$T$169, DW_AT_decl_line(0x3dc)
    1714                            .dwattr $C$DW$T$169, DW_AT_decl_column(0x01)
    1715                            .dwendtag $C$DW$T$169
    1716                    
    1717                    $C$DW$T$170     .dwtag  DW_TAG_typedef
    1718                            .dwattr $C$DW$T$170, DW_AT_name("ICall_RemotiCmdEvent_t")
    1719                            .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$169)
    1720                            .dwattr $C$DW$T$170, DW_AT_language(DW_LANG_C)
    1721                            .dwattr $C$DW$T$170, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154st
    1722                            .dwattr $C$DW$T$170, DW_AT_decl_line(0x3e9)
    1723                            .dwattr $C$DW$T$170, DW_AT_decl_column(0x02)
    1724                    
    1725                    
    1726                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1727                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    1728                    $C$DW$117       .dwtag  DW_TAG_member
    1729                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$14)
    1730                            .dwattr $C$DW$117, DW_AT_name("__max_align1")
    1731                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("__max_align1")
    1732                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1733                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1734                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    1735                            .dwattr $C$DW$117, DW_AT_decl_line(0x70)
    1736                            .dwattr $C$DW$117, DW_AT_decl_column(0x0c)
    1737                    
    1738                    $C$DW$118       .dwtag  DW_TAG_member
    1739                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$18)
    1740                            .dwattr $C$DW$118, DW_AT_name("__max_align2")
    1741                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("__max_align2")
    1742                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1743                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1744                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    1745                            .dwattr $C$DW$118, DW_AT_decl_line(0x71)
    1746                            .dwattr $C$DW$118, DW_AT_decl_column(0x0e)
    1747                    
    1748                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    1749                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x6f)
    1750                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    1751                            .dwendtag $C$DW$T$21
    1752                    
    1753                    $C$DW$T$171     .dwtag  DW_TAG_typedef
    1754                            .dwattr $C$DW$T$171, DW_AT_name("__max_align_t")
    1755                            .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$21)
    1756                            .dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
    1757                            .dwattr $C$DW$T$171, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1758                            .dwattr $C$DW$T$171, DW_AT_decl_line(0x72)
    1759                            .dwattr $C$DW$T$171, DW_AT_decl_column(0x03)
    1760                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   33

    1761                    
    1762                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1763                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    1764                    $C$DW$119       .dwtag  DW_TAG_member
    1765                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$10)
    1766                            .dwattr $C$DW$119, DW_AT_name("quot")
    1767                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("quot")
    1768                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1769                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1770                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    1771                            .dwattr $C$DW$119, DW_AT_decl_line(0x49)
    1772                            .dwattr $C$DW$119, DW_AT_decl_column(0x16)
    1773                    
    1774                    $C$DW$120       .dwtag  DW_TAG_member
    1775                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$10)
    1776                            .dwattr $C$DW$120, DW_AT_name("rem")
    1777                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("rem")
    1778                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1779                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1780                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    1781                            .dwattr $C$DW$120, DW_AT_decl_line(0x49)
    1782                            .dwattr $C$DW$120, DW_AT_decl_column(0x1c)
    1783                    
    1784                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    1785                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x49)
    1786                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    1787                            .dwendtag $C$DW$T$22
    1788                    
    1789                    $C$DW$T$172     .dwtag  DW_TAG_typedef
    1790                            .dwattr $C$DW$T$172, DW_AT_name("div_t")
    1791                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$22)
    1792                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    1793                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1794                            .dwattr $C$DW$T$172, DW_AT_decl_line(0x49)
    1795                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x23)
    1796                    
    1797                    
    1798                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1799                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
    1800                    $C$DW$121       .dwtag  DW_TAG_member
    1801                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$10)
    1802                            .dwattr $C$DW$121, DW_AT_name("quot")
    1803                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("quot")
    1804                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1805                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1806                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    1807                            .dwattr $C$DW$121, DW_AT_decl_line(0x4e)
    1808                            .dwattr $C$DW$121, DW_AT_decl_column(0x16)
    1809                    
    1810                    $C$DW$122       .dwtag  DW_TAG_member
    1811                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$10)
    1812                            .dwattr $C$DW$122, DW_AT_name("rem")
    1813                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("rem")
    1814                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1815                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   34

    1816                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    1817                            .dwattr $C$DW$122, DW_AT_decl_line(0x4e)
    1818                            .dwattr $C$DW$122, DW_AT_decl_column(0x1c)
    1819                    
    1820                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    1821                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x4e)
    1822                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    1823                            .dwendtag $C$DW$T$23
    1824                    
    1825                    $C$DW$T$173     .dwtag  DW_TAG_typedef
    1826                            .dwattr $C$DW$T$173, DW_AT_name("ldiv_t")
    1827                            .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$23)
    1828                            .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
    1829                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1830                            .dwattr $C$DW$T$173, DW_AT_decl_line(0x4e)
    1831                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x23)
    1832                    
    1833                    
    1834                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1835                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    1836                    $C$DW$123       .dwtag  DW_TAG_member
    1837                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$14)
    1838                            .dwattr $C$DW$123, DW_AT_name("quot")
    1839                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("quot")
    1840                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1841                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1842                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    1843                            .dwattr $C$DW$123, DW_AT_decl_line(0x56)
    1844                            .dwattr $C$DW$123, DW_AT_decl_column(0x1c)
    1845                    
    1846                    $C$DW$124       .dwtag  DW_TAG_member
    1847                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$14)
    1848                            .dwattr $C$DW$124, DW_AT_name("rem")
    1849                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("rem")
    1850                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1851                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1852                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    1853                            .dwattr $C$DW$124, DW_AT_decl_line(0x56)
    1854                            .dwattr $C$DW$124, DW_AT_decl_column(0x22)
    1855                    
    1856                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    1857                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x56)
    1858                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    1859                            .dwendtag $C$DW$T$24
    1860                    
    1861                    $C$DW$T$174     .dwtag  DW_TAG_typedef
    1862                            .dwattr $C$DW$T$174, DW_AT_name("lldiv_t")
    1863                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$24)
    1864                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    1865                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1866                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x56)
    1867                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x29)
    1868                    
    1869                    
    1870                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   35

    1871                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    1872                    $C$DW$125       .dwtag  DW_TAG_member
    1873                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$28)
    1874                            .dwattr $C$DW$125, DW_AT_name("pointerStack")
    1875                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("pointerStack")
    1876                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1877                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1878                            .dwattr $C$DW$125, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1879                            .dwattr $C$DW$125, DW_AT_decl_line(0x3f5)
    1880                            .dwattr $C$DW$125, DW_AT_decl_column(0x16)
    1881                    
    1882                    $C$DW$126       .dwtag  DW_TAG_member
    1883                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$29)
    1884                            .dwattr $C$DW$126, DW_AT_name("directAPI")
    1885                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("directAPI")
    1886                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1887                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1888                            .dwattr $C$DW$126, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1889                            .dwattr $C$DW$126, DW_AT_decl_line(0x3f6)
    1890                            .dwattr $C$DW$126, DW_AT_decl_column(0x15)
    1891                    
    1892                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154sta
    1893                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x3f4)
    1894                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    1895                            .dwendtag $C$DW$T$30
    1896                    
    1897                    $C$DW$T$32      .dwtag  DW_TAG_typedef
    1898                            .dwattr $C$DW$T$32, DW_AT_name("icall_directAPIMsg_t")
    1899                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$30)
    1900                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1901                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154sta
    1902                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x3f7)
    1903                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    1904                    
    1905                    
    1906                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1907                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x14)
    1908                    $C$DW$127       .dwtag  DW_TAG_member
    1909                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$31)
    1910                            .dwattr $C$DW$127, DW_AT_name("hdr")
    1911                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("hdr")
    1912                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1913                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1914                            .dwattr $C$DW$127, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1915                            .dwattr $C$DW$127, DW_AT_decl_line(0x3fb)
    1916                            .dwattr $C$DW$127, DW_AT_decl_column(0x10)
    1917                    
    1918                    $C$DW$128       .dwtag  DW_TAG_member
    1919                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$32)
    1920                            .dwattr $C$DW$128, DW_AT_name("msg")
    1921                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("msg")
    1922                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1923                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1924                            .dwattr $C$DW$128, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1925                            .dwattr $C$DW$128, DW_AT_decl_line(0x3fc)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   36

    1926                            .dwattr $C$DW$128, DW_AT_decl_column(0x1a)
    1927                    
    1928                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154sta
    1929                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x3fa)
    1930                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    1931                            .dwendtag $C$DW$T$33
    1932                    
    1933                    $C$DW$T$175     .dwtag  DW_TAG_typedef
    1934                            .dwattr $C$DW$T$175, DW_AT_name("icallLiteMsg_t")
    1935                            .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$33)
    1936                            .dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
    1937                            .dwattr $C$DW$T$175, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154st
    1938                            .dwattr $C$DW$T$175, DW_AT_decl_line(0x3fd)
    1939                            .dwattr $C$DW$T$175, DW_AT_decl_column(0x03)
    1940                    
    1941                    
    1942                    $C$DW$T$42      .dwtag  DW_TAG_union_type
    1943                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    1944                    $C$DW$129       .dwtag  DW_TAG_member
    1945                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$37)
    1946                            .dwattr $C$DW$129, DW_AT_name("entityId")
    1947                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("entityId")
    1948                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1949                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1950                            .dwattr $C$DW$129, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1951                            .dwattr $C$DW$129, DW_AT_decl_line(0x1fe)
    1952                            .dwattr $C$DW$129, DW_AT_decl_column(0x14)
    1953                    
    1954                    $C$DW$130       .dwtag  DW_TAG_member
    1955                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$41)
    1956                            .dwattr $C$DW$130, DW_AT_name("servId")
    1957                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("servId")
    1958                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1959                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1960                            .dwattr $C$DW$130, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1961                            .dwattr $C$DW$130, DW_AT_decl_line(0x200)
    1962                            .dwattr $C$DW$130, DW_AT_decl_column(0x17)
    1963                    
    1964                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154sta
    1965                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x1fc)
    1966                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
    1967                            .dwendtag $C$DW$T$42
    1968                    
    1969                    
    1970                    $C$DW$T$43      .dwtag  DW_TAG_union_type
    1971                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    1972                    $C$DW$131       .dwtag  DW_TAG_member
    1973                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$41)
    1974                            .dwattr $C$DW$131, DW_AT_name("servId")
    1975                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("servId")
    1976                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1977                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1978                            .dwattr $C$DW$131, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1979                            .dwattr $C$DW$131, DW_AT_decl_line(0x211)
    1980                            .dwattr $C$DW$131, DW_AT_decl_column(0x17)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   37

    1981                    
    1982                    $C$DW$132       .dwtag  DW_TAG_member
    1983                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$37)
    1984                            .dwattr $C$DW$132, DW_AT_name("entityId")
    1985                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("entityId")
    1986                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1987                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1988                            .dwattr $C$DW$132, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1989                            .dwattr $C$DW$132, DW_AT_decl_line(0x213)
    1990                            .dwattr $C$DW$132, DW_AT_decl_column(0x14)
    1991                    
    1992                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154sta
    1993                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x20f)
    1994                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    1995                            .dwendtag $C$DW$T$43
    1996                    
    1997                    
    1998                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1999                            .dwattr $C$DW$T$44, DW_AT_name(".ggroup1")
    2000                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    2001                    $C$DW$133       .dwtag  DW_TAG_member
    2002                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$6)
    2003                            .dwattr $C$DW$133, DW_AT_name("ICallPlatform_pwrActivityCount")
    2004                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("ICallPlatform_pwrActivityCount")
    2005                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2006                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2007                    
    2008                    $C$DW$134       .dwtag  DW_TAG_member
    2009                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    2010                            .dwattr $C$DW$134, DW_AT_name("ICallPlatform_pwrCfgACAction")
    2011                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("ICallPlatform_pwrCfgACAction")
    2012                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2013                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2014                    
    2015                            .dwendtag $C$DW$T$44
    2016                    
    2017                    
    2018                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2019                            .dwattr $C$DW$T$46, DW_AT_name("ClockP_FreqHz")
    2020                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x08)
    2021                    $C$DW$135       .dwtag  DW_TAG_member
    2022                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$45)
    2023                            .dwattr $C$DW$135, DW_AT_name("hi")
    2024                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("hi")
    2025                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2026                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2027                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2028                            .dwattr $C$DW$135, DW_AT_decl_line(0x5c)
    2029                            .dwattr $C$DW$135, DW_AT_decl_column(0x0e)
    2030                    
    2031                    $C$DW$136       .dwtag  DW_TAG_member
    2032                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$45)
    2033                            .dwattr $C$DW$136, DW_AT_name("lo")
    2034                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("lo")
    2035                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   38

    2036                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2037                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2038                            .dwattr $C$DW$136, DW_AT_decl_line(0x5d)
    2039                            .dwattr $C$DW$136, DW_AT_decl_column(0x0e)
    2040                    
    2041                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2042                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x5b)
    2043                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x10)
    2044                            .dwendtag $C$DW$T$46
    2045                    
    2046                    $C$DW$T$177     .dwtag  DW_TAG_typedef
    2047                            .dwattr $C$DW$T$177, DW_AT_name("ClockP_FreqHz")
    2048                            .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$46)
    2049                            .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    2050                            .dwattr $C$DW$T$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2051                            .dwattr $C$DW$T$177, DW_AT_decl_line(0x5e)
    2052                            .dwattr $C$DW$T$177, DW_AT_decl_column(0x03)
    2053                    
    2054                    
    2055                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2056                            .dwattr $C$DW$T$50, DW_AT_name("ClockP_Params")
    2057                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x0c)
    2058                    $C$DW$137       .dwtag  DW_TAG_member
    2059                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$47)
    2060                            .dwattr $C$DW$137, DW_AT_name("startFlag")
    2061                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("startFlag")
    2062                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2063                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2064                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2065                            .dwattr $C$DW$137, DW_AT_decl_line(0x8d)
    2066                            .dwattr $C$DW$137, DW_AT_decl_column(0x0f)
    2067                    
    2068                    $C$DW$138       .dwtag  DW_TAG_member
    2069                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$45)
    2070                            .dwattr $C$DW$138, DW_AT_name("period")
    2071                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("period")
    2072                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2073                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2074                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2075                            .dwattr $C$DW$138, DW_AT_decl_line(0x8e)
    2076                            .dwattr $C$DW$138, DW_AT_decl_column(0x0f)
    2077                    
    2078                    $C$DW$139       .dwtag  DW_TAG_member
    2079                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$49)
    2080                            .dwattr $C$DW$139, DW_AT_name("arg")
    2081                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("arg")
    2082                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2083                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2084                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2085                            .dwattr $C$DW$139, DW_AT_decl_line(0x8f)
    2086                            .dwattr $C$DW$139, DW_AT_decl_column(0x0f)
    2087                    
    2088                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2089                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x8c)
    2090                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   39

    2091                            .dwendtag $C$DW$T$50
    2092                    
    2093                    $C$DW$T$178     .dwtag  DW_TAG_typedef
    2094                            .dwattr $C$DW$T$178, DW_AT_name("ClockP_Params")
    2095                            .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$50)
    2096                            .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    2097                            .dwattr $C$DW$T$178, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2098                            .dwattr $C$DW$T$178, DW_AT_decl_line(0x90)
    2099                            .dwattr $C$DW$T$178, DW_AT_decl_column(0x03)
    2100                    
    2101                    
    2102                    $C$DW$T$179     .dwtag  DW_TAG_enumeration_type
    2103                            .dwattr $C$DW$T$179, DW_AT_name("ClockP_Status")
    2104                            .dwattr $C$DW$T$179, DW_AT_byte_size(0x01)
    2105                    $C$DW$140       .dwtag  DW_TAG_enumerator
    2106                            .dwattr $C$DW$140, DW_AT_name("ClockP_OK")
    2107                            .dwattr $C$DW$140, DW_AT_const_value(0x00)
    2108                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2109                            .dwattr $C$DW$140, DW_AT_decl_line(0x64)
    2110                            .dwattr $C$DW$140, DW_AT_decl_column(0x05)
    2111                    
    2112                    $C$DW$141       .dwtag  DW_TAG_enumerator
    2113                            .dwattr $C$DW$141, DW_AT_name("ClockP_FAILURE")
    2114                            .dwattr $C$DW$141, DW_AT_const_value(-1)
    2115                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2116                            .dwattr $C$DW$141, DW_AT_decl_line(0x65)
    2117                            .dwattr $C$DW$141, DW_AT_decl_column(0x05)
    2118                    
    2119                            .dwattr $C$DW$T$179, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2120                            .dwattr $C$DW$T$179, DW_AT_decl_line(0x63)
    2121                            .dwattr $C$DW$T$179, DW_AT_decl_column(0x0e)
    2122                            .dwendtag $C$DW$T$179
    2123                    
    2124                    $C$DW$T$180     .dwtag  DW_TAG_typedef
    2125                            .dwattr $C$DW$T$180, DW_AT_name("ClockP_Status")
    2126                            .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$179)
    2127                            .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    2128                            .dwattr $C$DW$T$180, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2129                            .dwattr $C$DW$T$180, DW_AT_decl_line(0x66)
    2130                            .dwattr $C$DW$T$180, DW_AT_decl_column(0x03)
    2131                    
    2132                    
    2133                    $C$DW$T$53      .dwtag  DW_TAG_union_type
    2134                            .dwattr $C$DW$T$53, DW_AT_name("ClockP_Struct")
    2135                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x24)
    2136                    $C$DW$142       .dwtag  DW_TAG_member
    2137                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$45)
    2138                            .dwattr $C$DW$142, DW_AT_name("dummy")
    2139                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("dummy")
    2140                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2141                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2142                            .dwattr $C$DW$142, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2143                            .dwattr $C$DW$142, DW_AT_decl_line(0x54)
    2144                            .dwattr $C$DW$142, DW_AT_decl_column(0x0e)
    2145                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   40

    2146                    $C$DW$143       .dwtag  DW_TAG_member
    2147                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$52)
    2148                            .dwattr $C$DW$143, DW_AT_name("data")
    2149                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("data")
    2150                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2151                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2152                            .dwattr $C$DW$143, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2153                            .dwattr $C$DW$143, DW_AT_decl_line(0x55)
    2154                            .dwattr $C$DW$143, DW_AT_decl_column(0x0e)
    2155                    
    2156                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2157                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x53)
    2158                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x0f)
    2159                            .dwendtag $C$DW$T$53
    2160                    
    2161                    $C$DW$T$71      .dwtag  DW_TAG_typedef
    2162                            .dwattr $C$DW$T$71, DW_AT_name("ClockP_Struct")
    2163                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$53)
    2164                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    2165                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2166                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x56)
    2167                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    2168                    
    2169                    
    2170                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    2171                            .dwattr $C$DW$T$54, DW_AT_name("HwiP_Params")
    2172                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x0c)
    2173                    $C$DW$144       .dwtag  DW_TAG_member
    2174                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$49)
    2175                            .dwattr $C$DW$144, DW_AT_name("arg")
    2176                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("arg")
    2177                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2178                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2179                            .dwattr $C$DW$144, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2180                            .dwattr $C$DW$144, DW_AT_decl_line(0x72)
    2181                            .dwattr $C$DW$144, DW_AT_decl_column(0x10)
    2182                    
    2183                    $C$DW$145       .dwtag  DW_TAG_member
    2184                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$45)
    2185                            .dwattr $C$DW$145, DW_AT_name("priority")
    2186                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("priority")
    2187                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2188                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2189                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2190                            .dwattr $C$DW$145, DW_AT_decl_line(0x73)
    2191                            .dwattr $C$DW$145, DW_AT_decl_column(0x10)
    2192                    
    2193                    $C$DW$146       .dwtag  DW_TAG_member
    2194                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$47)
    2195                            .dwattr $C$DW$146, DW_AT_name("enableInt")
    2196                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("enableInt")
    2197                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2198                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2199                            .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2200                            .dwattr $C$DW$146, DW_AT_decl_line(0x74)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   41

    2201                            .dwattr $C$DW$146, DW_AT_decl_column(0x10)
    2202                    
    2203                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2204                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x71)
    2205                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x10)
    2206                            .dwendtag $C$DW$T$54
    2207                    
    2208                    $C$DW$T$181     .dwtag  DW_TAG_typedef
    2209                            .dwattr $C$DW$T$181, DW_AT_name("HwiP_Params")
    2210                            .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$54)
    2211                            .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    2212                            .dwattr $C$DW$T$181, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2213                            .dwattr $C$DW$T$181, DW_AT_decl_line(0x75)
    2214                            .dwattr $C$DW$T$181, DW_AT_decl_column(0x03)
    2215                    
    2216                    
    2217                    $C$DW$T$182     .dwtag  DW_TAG_enumeration_type
    2218                            .dwattr $C$DW$T$182, DW_AT_name("HwiP_Status")
    2219                            .dwattr $C$DW$T$182, DW_AT_byte_size(0x01)
    2220                    $C$DW$147       .dwtag  DW_TAG_enumerator
    2221                            .dwattr $C$DW$147, DW_AT_name("HwiP_OK")
    2222                            .dwattr $C$DW$147, DW_AT_const_value(0x00)
    2223                            .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2224                            .dwattr $C$DW$147, DW_AT_decl_line(0x5c)
    2225                            .dwattr $C$DW$147, DW_AT_decl_column(0x05)
    2226                    
    2227                    $C$DW$148       .dwtag  DW_TAG_enumerator
    2228                            .dwattr $C$DW$148, DW_AT_name("HwiP_FAILURE")
    2229                            .dwattr $C$DW$148, DW_AT_const_value(-1)
    2230                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2231                            .dwattr $C$DW$148, DW_AT_decl_line(0x5d)
    2232                            .dwattr $C$DW$148, DW_AT_decl_column(0x05)
    2233                    
    2234                            .dwattr $C$DW$T$182, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2235                            .dwattr $C$DW$T$182, DW_AT_decl_line(0x5b)
    2236                            .dwattr $C$DW$T$182, DW_AT_decl_column(0x0e)
    2237                            .dwendtag $C$DW$T$182
    2238                    
    2239                    $C$DW$T$183     .dwtag  DW_TAG_typedef
    2240                            .dwattr $C$DW$T$183, DW_AT_name("HwiP_Status")
    2241                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$182)
    2242                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    2243                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2244                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x5e)
    2245                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x03)
    2246                    
    2247                    
    2248                    $C$DW$T$56      .dwtag  DW_TAG_union_type
    2249                            .dwattr $C$DW$T$56, DW_AT_name("HwiP_Struct")
    2250                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x1c)
    2251                    $C$DW$149       .dwtag  DW_TAG_member
    2252                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$45)
    2253                            .dwattr $C$DW$149, DW_AT_name("dummy")
    2254                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("dummy")
    2255                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   42

    2256                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2257                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2258                            .dwattr $C$DW$149, DW_AT_decl_line(0x4d)
    2259                            .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    2260                    
    2261                    $C$DW$150       .dwtag  DW_TAG_member
    2262                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$55)
    2263                            .dwattr $C$DW$150, DW_AT_name("data")
    2264                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("data")
    2265                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2266                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2267                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2268                            .dwattr $C$DW$150, DW_AT_decl_line(0x4e)
    2269                            .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    2270                    
    2271                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2272                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x4c)
    2273                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x0f)
    2274                            .dwendtag $C$DW$T$56
    2275                    
    2276                    $C$DW$T$72      .dwtag  DW_TAG_typedef
    2277                            .dwattr $C$DW$T$72, DW_AT_name("HwiP_Struct")
    2278                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$56)
    2279                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2280                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2281                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x4f)
    2282                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    2283                    
    2284                    
    2285                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    2286                            .dwattr $C$DW$T$58, DW_AT_name("List_Elem")
    2287                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x08)
    2288                    $C$DW$151       .dwtag  DW_TAG_member
    2289                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$57)
    2290                            .dwattr $C$DW$151, DW_AT_name("next")
    2291                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("next")
    2292                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2293                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2294                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/u
    2295                            .dwattr $C$DW$151, DW_AT_decl_line(0x7f)
    2296                            .dwattr $C$DW$151, DW_AT_decl_column(0x17)
    2297                    
    2298                    $C$DW$152       .dwtag  DW_TAG_member
    2299                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$57)
    2300                            .dwattr $C$DW$152, DW_AT_name("prev")
    2301                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("prev")
    2302                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2303                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2304                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/u
    2305                            .dwattr $C$DW$152, DW_AT_decl_line(0x80)
    2306                            .dwattr $C$DW$152, DW_AT_decl_column(0x17)
    2307                    
    2308                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2309                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x7e)
    2310                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x10)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   43

    2311                            .dwendtag $C$DW$T$58
    2312                    
    2313                    $C$DW$T$59      .dwtag  DW_TAG_typedef
    2314                            .dwattr $C$DW$T$59, DW_AT_name("List_Elem")
    2315                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2316                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2317                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2318                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x81)
    2319                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x03)
    2320                    
    2321                    $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    2322                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2323                            .dwattr $C$DW$T$60, DW_AT_address_class(0x20)
    2324                    
    2325                    $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    2326                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$58)
    2327                            .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
    2328                    
    2329                    
    2330                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    2331                            .dwattr $C$DW$T$61, DW_AT_name("List_List")
    2332                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x08)
    2333                    $C$DW$153       .dwtag  DW_TAG_member
    2334                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$60)
    2335                            .dwattr $C$DW$153, DW_AT_name("head")
    2336                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("head")
    2337                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2338                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2339                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/u
    2340                            .dwattr $C$DW$153, DW_AT_decl_line(0x84)
    2341                            .dwattr $C$DW$153, DW_AT_decl_column(0x10)
    2342                    
    2343                    $C$DW$154       .dwtag  DW_TAG_member
    2344                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$60)
    2345                            .dwattr $C$DW$154, DW_AT_name("tail")
    2346                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("tail")
    2347                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2348                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2349                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/u
    2350                            .dwattr $C$DW$154, DW_AT_decl_line(0x85)
    2351                            .dwattr $C$DW$154, DW_AT_decl_column(0x10)
    2352                    
    2353                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2354                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x83)
    2355                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x10)
    2356                            .dwendtag $C$DW$T$61
    2357                    
    2358                    $C$DW$T$70      .dwtag  DW_TAG_typedef
    2359                            .dwattr $C$DW$T$70, DW_AT_name("List_List")
    2360                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$61)
    2361                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2362                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2363                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x86)
    2364                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    2365                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   44

    2366                    
    2367                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
    2368                            .dwattr $C$DW$T$69, DW_AT_name("PowerCC26XX_Config")
    2369                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x18)
    2370                    $C$DW$155       .dwtag  DW_TAG_member
    2371                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$64)
    2372                            .dwattr $C$DW$155, DW_AT_name("policyInitFxn")
    2373                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("policyInitFxn")
    2374                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2375                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2376                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2377                            .dwattr $C$DW$155, DW_AT_decl_line(0x150)
    2378                            .dwattr $C$DW$155, DW_AT_decl_column(0x19)
    2379                    
    2380                    $C$DW$156       .dwtag  DW_TAG_member
    2381                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$65)
    2382                            .dwattr $C$DW$156, DW_AT_name("policyFxn")
    2383                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("policyFxn")
    2384                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2385                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2386                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2387                            .dwattr $C$DW$156, DW_AT_decl_line(0x166)
    2388                            .dwattr $C$DW$156, DW_AT_decl_column(0x15)
    2389                    
    2390                    $C$DW$157       .dwtag  DW_TAG_member
    2391                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$67)
    2392                            .dwattr $C$DW$157, DW_AT_name("calibrateFxn")
    2393                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("calibrateFxn")
    2394                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2395                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2396                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2397                            .dwattr $C$DW$157, DW_AT_decl_line(0x172)
    2398                            .dwattr $C$DW$157, DW_AT_decl_column(0x0c)
    2399                    
    2400                    $C$DW$158       .dwtag  DW_TAG_member
    2401                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$45)
    2402                            .dwattr $C$DW$158, DW_AT_name("maxStandbyDuration")
    2403                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("maxStandbyDuration")
    2404                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2405                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2406                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2407                            .dwattr $C$DW$158, DW_AT_decl_line(0x18d)
    2408                            .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    2409                    
    2410                    $C$DW$159       .dwtag  DW_TAG_member
    2411                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$68)
    2412                            .dwattr $C$DW$159, DW_AT_name("vddrRechargeMargin")
    2413                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("vddrRechargeMargin")
    2414                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2415                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2416                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2417                            .dwattr $C$DW$159, DW_AT_decl_line(0x19e)
    2418                            .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    2419                    
    2420                    $C$DW$160       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   45

    2421                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$47)
    2422                            .dwattr $C$DW$160, DW_AT_name("enableMaxStandbyDuration")
    2423                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("enableMaxStandbyDuration")
    2424                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2425                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2426                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2427                            .dwattr $C$DW$160, DW_AT_decl_line(0x1ab)
    2428                            .dwattr $C$DW$160, DW_AT_decl_column(0x0a)
    2429                    
    2430                    $C$DW$161       .dwtag  DW_TAG_member
    2431                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$47)
    2432                            .dwattr $C$DW$161, DW_AT_name("enablePolicy")
    2433                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("enablePolicy")
    2434                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2435                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2436                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2437                            .dwattr $C$DW$161, DW_AT_decl_line(0x1b8)
    2438                            .dwattr $C$DW$161, DW_AT_decl_column(0x0a)
    2439                    
    2440                    $C$DW$162       .dwtag  DW_TAG_member
    2441                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$47)
    2442                            .dwattr $C$DW$162, DW_AT_name("calibrateRCOSC_LF")
    2443                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("calibrateRCOSC_LF")
    2444                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2445                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2446                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2447                            .dwattr $C$DW$162, DW_AT_decl_line(0x1c1)
    2448                            .dwattr $C$DW$162, DW_AT_decl_column(0x0a)
    2449                    
    2450                    $C$DW$163       .dwtag  DW_TAG_member
    2451                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$47)
    2452                            .dwattr $C$DW$163, DW_AT_name("calibrateRCOSC_HF")
    2453                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("calibrateRCOSC_HF")
    2454                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2455                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2456                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2457                            .dwattr $C$DW$163, DW_AT_decl_line(0x1ca)
    2458                            .dwattr $C$DW$163, DW_AT_decl_column(0x0a)
    2459                    
    2460                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2461                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x149)
    2462                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x10)
    2463                            .dwendtag $C$DW$T$69
    2464                    
    2465                    $C$DW$T$184     .dwtag  DW_TAG_typedef
    2466                            .dwattr $C$DW$T$184, DW_AT_name("PowerCC26XX_Config")
    2467                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$69)
    2468                            .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    2469                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2470                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x1cb)
    2471                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x03)
    2472                    
    2473                    
    2474                    $C$DW$T$81      .dwtag  DW_TAG_structure_type
    2475                            .dwattr $C$DW$T$81, DW_AT_name("PowerCC26XX_ModuleState")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   46

    2476                            .dwattr $C$DW$T$81, DW_AT_byte_size(0x114)
    2477                    $C$DW$164       .dwtag  DW_TAG_member
    2478                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$70)
    2479                            .dwattr $C$DW$164, DW_AT_name("notifyList")
    2480                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("notifyList")
    2481                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2482                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2483                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2484                            .dwattr $C$DW$164, DW_AT_decl_line(0x1d4)
    2485                            .dwattr $C$DW$164, DW_AT_decl_column(0x0f)
    2486                    
    2487                    $C$DW$165       .dwtag  DW_TAG_member
    2488                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$45)
    2489                            .dwattr $C$DW$165, DW_AT_name("constraintMask")
    2490                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("constraintMask")
    2491                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2492                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2493                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2494                            .dwattr $C$DW$165, DW_AT_decl_line(0x1d5)
    2495                            .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    2496                    
    2497                    $C$DW$166       .dwtag  DW_TAG_member
    2498                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$71)
    2499                            .dwattr $C$DW$166, DW_AT_name("clockObj")
    2500                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("clockObj")
    2501                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2502                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2503                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2504                            .dwattr $C$DW$166, DW_AT_decl_line(0x1d6)
    2505                            .dwattr $C$DW$166, DW_AT_decl_column(0x13)
    2506                    
    2507                    $C$DW$167       .dwtag  DW_TAG_member
    2508                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$71)
    2509                            .dwattr $C$DW$167, DW_AT_name("xoscClockObj")
    2510                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("xoscClockObj")
    2511                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2512                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2513                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2514                            .dwattr $C$DW$167, DW_AT_decl_line(0x1d7)
    2515                            .dwattr $C$DW$167, DW_AT_decl_column(0x13)
    2516                    
    2517                    $C$DW$168       .dwtag  DW_TAG_member
    2518                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$71)
    2519                            .dwattr $C$DW$168, DW_AT_name("lfClockObj")
    2520                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("lfClockObj")
    2521                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2522                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2523                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2524                            .dwattr $C$DW$168, DW_AT_decl_line(0x1d8)
    2525                            .dwattr $C$DW$168, DW_AT_decl_column(0x13)
    2526                    
    2527                    $C$DW$169       .dwtag  DW_TAG_member
    2528                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$71)
    2529                            .dwattr $C$DW$169, DW_AT_name("calClockStruct")
    2530                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("calClockStruct")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   47

    2531                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2532                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2533                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2534                            .dwattr $C$DW$169, DW_AT_decl_line(0x1d9)
    2535                            .dwattr $C$DW$169, DW_AT_decl_column(0x13)
    2536                    
    2537                    $C$DW$170       .dwtag  DW_TAG_member
    2538                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$72)
    2539                            .dwattr $C$DW$170, DW_AT_name("hwiStruct")
    2540                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("hwiStruct")
    2541                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2542                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2543                            .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2544                            .dwattr $C$DW$170, DW_AT_decl_line(0x1da)
    2545                            .dwattr $C$DW$170, DW_AT_decl_column(0x11)
    2546                    
    2547                    $C$DW$171       .dwtag  DW_TAG_member
    2548                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$74)
    2549                            .dwattr $C$DW$171, DW_AT_name("nDeltaFreqCurr")
    2550                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("nDeltaFreqCurr")
    2551                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    2552                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2553                            .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2554                            .dwattr $C$DW$171, DW_AT_decl_line(0x1db)
    2555                            .dwattr $C$DW$171, DW_AT_decl_column(0x0d)
    2556                    
    2557                    $C$DW$172       .dwtag  DW_TAG_member
    2558                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$74)
    2559                            .dwattr $C$DW$172, DW_AT_name("nCtrimCurr")
    2560                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("nCtrimCurr")
    2561                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2562                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2563                            .dwattr $C$DW$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2564                            .dwattr $C$DW$172, DW_AT_decl_line(0x1dc)
    2565                            .dwattr $C$DW$172, DW_AT_decl_column(0x0d)
    2566                    
    2567                    $C$DW$173       .dwtag  DW_TAG_member
    2568                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$74)
    2569                            .dwattr $C$DW$173, DW_AT_name("nCtrimFractCurr")
    2570                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("nCtrimFractCurr")
    2571                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    2572                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2573                            .dwattr $C$DW$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2574                            .dwattr $C$DW$173, DW_AT_decl_line(0x1dd)
    2575                            .dwattr $C$DW$173, DW_AT_decl_column(0x0d)
    2576                    
    2577                    $C$DW$174       .dwtag  DW_TAG_member
    2578                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$74)
    2579                            .dwattr $C$DW$174, DW_AT_name("nCtrimNew")
    2580                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("nCtrimNew")
    2581                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    2582                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2583                            .dwattr $C$DW$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2584                            .dwattr $C$DW$174, DW_AT_decl_line(0x1de)
    2585                            .dwattr $C$DW$174, DW_AT_decl_column(0x0d)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   48

    2586                    
    2587                    $C$DW$175       .dwtag  DW_TAG_member
    2588                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$74)
    2589                            .dwattr $C$DW$175, DW_AT_name("nCtrimFractNew")
    2590                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("nCtrimFractNew")
    2591                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    2592                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2593                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2594                            .dwattr $C$DW$175, DW_AT_decl_line(0x1df)
    2595                            .dwattr $C$DW$175, DW_AT_decl_column(0x0d)
    2596                    
    2597                    $C$DW$176       .dwtag  DW_TAG_member
    2598                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$74)
    2599                            .dwattr $C$DW$176, DW_AT_name("nRtrimNew")
    2600                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("nRtrimNew")
    2601                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    2602                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2603                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2604                            .dwattr $C$DW$176, DW_AT_decl_line(0x1e0)
    2605                            .dwattr $C$DW$176, DW_AT_decl_column(0x0d)
    2606                    
    2607                    $C$DW$177       .dwtag  DW_TAG_member
    2608                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$74)
    2609                            .dwattr $C$DW$177, DW_AT_name("nRtrimCurr")
    2610                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("nRtrimCurr")
    2611                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    2612                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2613                            .dwattr $C$DW$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2614                            .dwattr $C$DW$177, DW_AT_decl_line(0x1e1)
    2615                            .dwattr $C$DW$177, DW_AT_decl_column(0x0d)
    2616                    
    2617                    $C$DW$178       .dwtag  DW_TAG_member
    2618                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$74)
    2619                            .dwattr $C$DW$178, DW_AT_name("nDeltaFreqNew")
    2620                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("nDeltaFreqNew")
    2621                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    2622                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2623                            .dwattr $C$DW$178, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2624                            .dwattr $C$DW$178, DW_AT_decl_line(0x1e2)
    2625                            .dwattr $C$DW$178, DW_AT_decl_column(0x0d)
    2626                    
    2627                    $C$DW$179       .dwtag  DW_TAG_member
    2628                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$47)
    2629                            .dwattr $C$DW$179, DW_AT_name("bRefine")
    2630                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("bRefine")
    2631                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    2632                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2633                            .dwattr $C$DW$179, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2634                            .dwattr $C$DW$179, DW_AT_decl_line(0x1e3)
    2635                            .dwattr $C$DW$179, DW_AT_decl_column(0x0a)
    2636                    
    2637                    $C$DW$180       .dwtag  DW_TAG_member
    2638                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$45)
    2639                            .dwattr $C$DW$180, DW_AT_name("state")
    2640                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("state")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   49

    2641                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    2642                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2643                            .dwattr $C$DW$180, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2644                            .dwattr $C$DW$180, DW_AT_decl_line(0x1e4)
    2645                            .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    2646                    
    2647                    $C$DW$181       .dwtag  DW_TAG_member
    2648                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$47)
    2649                            .dwattr $C$DW$181, DW_AT_name("xoscPending")
    2650                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("xoscPending")
    2651                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    2652                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2653                            .dwattr $C$DW$181, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2654                            .dwattr $C$DW$181, DW_AT_decl_line(0x1e5)
    2655                            .dwattr $C$DW$181, DW_AT_decl_column(0x0a)
    2656                    
    2657                    $C$DW$182       .dwtag  DW_TAG_member
    2658                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$47)
    2659                            .dwattr $C$DW$182, DW_AT_name("calLF")
    2660                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("calLF")
    2661                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xe1]
    2662                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2663                            .dwattr $C$DW$182, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2664                            .dwattr $C$DW$182, DW_AT_decl_line(0x1e6)
    2665                            .dwattr $C$DW$182, DW_AT_decl_column(0x0a)
    2666                    
    2667                    $C$DW$183       .dwtag  DW_TAG_member
    2668                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$75)
    2669                            .dwattr $C$DW$183, DW_AT_name("hwiState")
    2670                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("hwiState")
    2671                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    2672                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2673                            .dwattr $C$DW$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2674                            .dwattr $C$DW$183, DW_AT_decl_line(0x1e7)
    2675                            .dwattr $C$DW$183, DW_AT_decl_column(0x0d)
    2676                    
    2677                    $C$DW$184       .dwtag  DW_TAG_member
    2678                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$47)
    2679                            .dwattr $C$DW$184, DW_AT_name("busyCal")
    2680                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("busyCal")
    2681                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xe3]
    2682                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2683                            .dwattr $C$DW$184, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2684                            .dwattr $C$DW$184, DW_AT_decl_line(0x1e8)
    2685                            .dwattr $C$DW$184, DW_AT_decl_column(0x0a)
    2686                    
    2687                    $C$DW$185       .dwtag  DW_TAG_member
    2688                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$75)
    2689                            .dwattr $C$DW$185, DW_AT_name("calStep")
    2690                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("calStep")
    2691                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    2692                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2693                            .dwattr $C$DW$185, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2694                            .dwattr $C$DW$185, DW_AT_decl_line(0x1e9)
    2695                            .dwattr $C$DW$185, DW_AT_decl_column(0x0d)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   50

    2696                    
    2697                    $C$DW$186       .dwtag  DW_TAG_member
    2698                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$47)
    2699                            .dwattr $C$DW$186, DW_AT_name("firstLF")
    2700                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("firstLF")
    2701                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xe5]
    2702                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2703                            .dwattr $C$DW$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2704                            .dwattr $C$DW$186, DW_AT_decl_line(0x1ea)
    2705                            .dwattr $C$DW$186, DW_AT_decl_column(0x0a)
    2706                    
    2707                    $C$DW$187       .dwtag  DW_TAG_member
    2708                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$47)
    2709                            .dwattr $C$DW$187, DW_AT_name("enablePolicy")
    2710                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("enablePolicy")
    2711                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    2712                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2713                            .dwattr $C$DW$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2714                            .dwattr $C$DW$187, DW_AT_decl_line(0x1eb)
    2715                            .dwattr $C$DW$187, DW_AT_decl_column(0x0a)
    2716                    
    2717                    $C$DW$188       .dwtag  DW_TAG_member
    2718                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$47)
    2719                            .dwattr $C$DW$188, DW_AT_name("initialized")
    2720                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("initialized")
    2721                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xe7]
    2722                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2723                            .dwattr $C$DW$188, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2724                            .dwattr $C$DW$188, DW_AT_decl_line(0x1ec)
    2725                            .dwattr $C$DW$188, DW_AT_decl_column(0x0a)
    2726                    
    2727                    $C$DW$189       .dwtag  DW_TAG_member
    2728                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$76)
    2729                            .dwattr $C$DW$189, DW_AT_name("constraintCounts")
    2730                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("constraintCounts")
    2731                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    2732                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2733                            .dwattr $C$DW$189, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2734                            .dwattr $C$DW$189, DW_AT_decl_line(0x1f0)
    2735                            .dwattr $C$DW$189, DW_AT_decl_column(0x0d)
    2736                    
    2737                    $C$DW$190       .dwtag  DW_TAG_member
    2738                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$77)
    2739                            .dwattr $C$DW$190, DW_AT_name("resourceCounts")
    2740                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("resourceCounts")
    2741                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    2742                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2743                            .dwattr $C$DW$190, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2744                            .dwattr $C$DW$190, DW_AT_decl_line(0x1f2)
    2745                            .dwattr $C$DW$190, DW_AT_decl_column(0x0d)
    2746                    
    2747                    $C$DW$191       .dwtag  DW_TAG_member
    2748                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$80)
    2749                            .dwattr $C$DW$191, DW_AT_name("resourceHandlers")
    2750                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("resourceHandlers")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   51

    2751                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    2752                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2753                            .dwattr $C$DW$191, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2754                            .dwattr $C$DW$191, DW_AT_decl_line(0x1f4)
    2755                            .dwattr $C$DW$191, DW_AT_decl_column(0x14)
    2756                    
    2757                    $C$DW$192       .dwtag  DW_TAG_member
    2758                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$65)
    2759                            .dwattr $C$DW$192, DW_AT_name("policyFxn")
    2760                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("policyFxn")
    2761                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    2762                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2763                            .dwattr $C$DW$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2764                            .dwattr $C$DW$192, DW_AT_decl_line(0x1f6)
    2765                            .dwattr $C$DW$192, DW_AT_decl_column(0x15)
    2766                    
    2767                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2768                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x1d3)
    2769                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x10)
    2770                            .dwendtag $C$DW$T$81
    2771                    
    2772                    $C$DW$T$185     .dwtag  DW_TAG_typedef
    2773                            .dwattr $C$DW$T$185, DW_AT_name("PowerCC26XX_ModuleState")
    2774                            .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$81)
    2775                            .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    2776                            .dwattr $C$DW$T$185, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2777                            .dwattr $C$DW$T$185, DW_AT_decl_line(0x1f7)
    2778                            .dwattr $C$DW$T$185, DW_AT_decl_column(0x03)
    2779                    
    2780                    
    2781                    $C$DW$T$82      .dwtag  DW_TAG_structure_type
    2782                            .dwattr $C$DW$T$82, DW_AT_name("PowerCC26XX_ResourceRecord")
    2783                            .dwattr $C$DW$T$82, DW_AT_byte_size(0x04)
    2784                    $C$DW$193       .dwtag  DW_TAG_member
    2785                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$75)
    2786                            .dwattr $C$DW$193, DW_AT_name("flags")
    2787                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("flags")
    2788                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2789                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2790                            .dwattr $C$DW$193, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2791                            .dwattr $C$DW$193, DW_AT_decl_line(0x143)
    2792                            .dwattr $C$DW$193, DW_AT_decl_column(0x0d)
    2793                    
    2794                    $C$DW$194       .dwtag  DW_TAG_member
    2795                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$68)
    2796                            .dwattr $C$DW$194, DW_AT_name("driverlibID")
    2797                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("driverlibID")
    2798                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2799                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2800                            .dwattr $C$DW$194, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2801                            .dwattr $C$DW$194, DW_AT_decl_line(0x144)
    2802                            .dwattr $C$DW$194, DW_AT_decl_column(0x0e)
    2803                    
    2804                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2805                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x142)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{03DED902-DB3B-484E-BC30-0E8987C42099} PAGE   52

    2806                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x10)
    2807                            .dwendtag $C$DW$T$82
    2808                    
    2809                    $C$DW$T$186     .dwtag  DW_TAG_typedef
    2810                            .dwattr $C$DW$T$186, DW_AT_name("PowerCC26XX_ResourceRecord")
    2811                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$82)
    2812                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    2813                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2814                            .dwattr $C$DW$T$186, DW_AT_decl_line(0x145)
    2815                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x03)
    2816                    
    2817                    
    2818                    $C$DW$T$90      .dwtag  DW_TAG_structure_type
    2819                            .dwattr $C$DW$T$90, DW_AT_name("Power_NotifyObj_")
    2820                            .dwattr $C$DW$T$90, DW_AT_byte_size(0x14)
    2821                    $C$DW$195       .dwtag  DW_TAG_member
    2822                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$59)
    2823                            .dwattr $C$DW$195, DW_AT_name("link")
    2824                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("link")
    2825                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2826                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2827                            .dwattr $C$DW$195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    2828                            .dwattr $C$DW$195, DW_AT_decl_line(0x7a)
    2829                            .dwattr $C$DW$195, DW_AT_decl_column(0x0f)
    2830                    
    2831                    $C$DW$196       .dwtag  DW_TAG_member
    2832                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$84)
    2833                            .dwattr $C$DW$196, DW_AT_name("eventTypes")
    2834                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("eventTypes")
    2835                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2836                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
