TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Nov 28 13:34:36 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/OSAL/osal_pwrmgr.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\sensor_cc1350lp
      13                    $C$DW$1 .dwtag  DW_TAG_variable
      14                            .dwattr $C$DW$1, DW_AT_name("ICall_dispatcher")

     601                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$185)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   12

     602                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
     603                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
     604                            .dwattr $C$DW$T$186, DW_AT_decl_line(0xb0)
     605                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x03)
     606                    
     607                    
     608                    $C$DW$T$187     .dwtag  DW_TAG_enumeration_type
     609                            .dwattr $C$DW$T$187, DW_AT_byte_size(0x01)
     610                    $C$DW$39        .dwtag  DW_TAG_enumerator
     611                            .dwattr $C$DW$39, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
     612                            .dwattr $C$DW$39, DW_AT_const_value(0xe0)
     613                            .dwattr $C$DW$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
     614                            .dwattr $C$DW$39, DW_AT_decl_line(0x3de)
     615                            .dwattr $C$DW$39, DW_AT_decl_column(0x04)
     616                    
     617                    $C$DW$40        .dwtag  DW_TAG_enumerator
     618                            .dwattr $C$DW$40, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
     619                            .dwattr $C$DW$40, DW_AT_const_value(0xe1)
     620                            .dwattr $C$DW$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
     621                            .dwattr $C$DW$40, DW_AT_decl_line(0x3e0)
     622                            .dwattr $C$DW$40, DW_AT_decl_column(0x04)
     623                    
     624                    $C$DW$41        .dwtag  DW_TAG_enumerator
     625                            .dwattr $C$DW$41, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
     626                            .dwattr $C$DW$41, DW_AT_const_value(0xe2)
     627                            .dwattr $C$DW$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
     628                            .dwattr $C$DW$41, DW_AT_decl_line(0x3e2)
     629                            .dwattr $C$DW$41, DW_AT_decl_column(0x04)
     630                    
     631                    $C$DW$42        .dwtag  DW_TAG_enumerator
     632                            .dwattr $C$DW$42, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
     633                            .dwattr $C$DW$42, DW_AT_const_value(0xe3)
     634                            .dwattr $C$DW$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
     635                            .dwattr $C$DW$42, DW_AT_decl_line(0x3e4)
     636                            .dwattr $C$DW$42, DW_AT_decl_column(0x04)
     637                    
     638                    $C$DW$43        .dwtag  DW_TAG_enumerator
     639                            .dwattr $C$DW$43, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
     640                            .dwattr $C$DW$43, DW_AT_const_value(0xe4)
     641                            .dwattr $C$DW$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
     642                            .dwattr $C$DW$43, DW_AT_decl_line(0x3e6)
     643                            .dwattr $C$DW$43, DW_AT_decl_column(0x04)
     644                    
     645                    $C$DW$44        .dwtag  DW_TAG_enumerator
     646                            .dwattr $C$DW$44, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
     647                            .dwattr $C$DW$44, DW_AT_const_value(0xe5)
     648                            .dwattr $C$DW$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
     649                            .dwattr $C$DW$44, DW_AT_decl_line(0x3e8)
     650                            .dwattr $C$DW$44, DW_AT_decl_column(0x04)
     651                    
     652                            .dwattr $C$DW$T$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
     653                            .dwattr $C$DW$T$187, DW_AT_decl_line(0x3dc)
     654                            .dwattr $C$DW$T$187, DW_AT_decl_column(0x01)
     655                            .dwendtag $C$DW$T$187
     656                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   13

     657                    $C$DW$T$188     .dwtag  DW_TAG_typedef
     658                            .dwattr $C$DW$T$188, DW_AT_name("ICall_RemotiCmdEvent_t")
     659                            .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$187)
     660                            .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
     661                            .dwattr $C$DW$T$188, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
     662                            .dwattr $C$DW$T$188, DW_AT_decl_line(0x3e9)
     663                            .dwattr $C$DW$T$188, DW_AT_decl_column(0x02)
     664                    
     665                    
     666                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
     667                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     668                    $C$DW$45        .dwtag  DW_TAG_member
     669                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$21)
     670                            .dwattr $C$DW$45, DW_AT_name("pwrmgr_task_state")
     671                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("pwrmgr_task_state")
     672                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     673                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     674                            .dwattr $C$DW$45, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
     675                            .dwattr $C$DW$45, DW_AT_decl_line(0x48)
     676                            .dwattr $C$DW$45, DW_AT_decl_column(0x0a)
     677                    
     678                            .dwattr $C$DW$T$22, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
     679                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x47)
     680                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
     681                            .dwendtag $C$DW$T$22
     682                    
     683                    $C$DW$T$190     .dwtag  DW_TAG_typedef
     684                            .dwattr $C$DW$T$190, DW_AT_name("pwrmgr_attribute_t")
     685                            .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$22)
     686                            .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
     687                            .dwattr $C$DW$T$190, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
     688                            .dwattr $C$DW$T$190, DW_AT_decl_line(0x4e)
     689                            .dwattr $C$DW$T$190, DW_AT_decl_column(0x03)
     690                    
     691                    
     692                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
     693                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x10)
     694                    $C$DW$46        .dwtag  DW_TAG_member
     695                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$14)
     696                            .dwattr $C$DW$46, DW_AT_name("__max_align1")
     697                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("__max_align1")
     698                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     699                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     700                            .dwattr $C$DW$46, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/sy
     701                            .dwattr $C$DW$46, DW_AT_decl_line(0x70)
     702                            .dwattr $C$DW$46, DW_AT_decl_column(0x0c)
     703                    
     704                    $C$DW$47        .dwtag  DW_TAG_member
     705                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$18)
     706                            .dwattr $C$DW$47, DW_AT_name("__max_align2")
     707                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("__max_align2")
     708                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     709                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     710                            .dwattr $C$DW$47, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/sy
     711                            .dwattr $C$DW$47, DW_AT_decl_line(0x71)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   14

     712                            .dwattr $C$DW$47, DW_AT_decl_column(0x0e)
     713                    
     714                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
     715                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x6f)
     716                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
     717                            .dwendtag $C$DW$T$23
     718                    
     719                    $C$DW$T$191     .dwtag  DW_TAG_typedef
     720                            .dwattr $C$DW$T$191, DW_AT_name("__max_align_t")
     721                            .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$23)
     722                            .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
     723                            .dwattr $C$DW$T$191, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
     724                            .dwattr $C$DW$T$191, DW_AT_decl_line(0x72)
     725                            .dwattr $C$DW$T$191, DW_AT_decl_column(0x03)
     726                    
     727                    
     728                    $C$DW$T$68      .dwtag  DW_TAG_structure_type
     729                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x4c)
     730                    $C$DW$48        .dwtag  DW_TAG_member
     731                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$31)
     732                            .dwattr $C$DW$48, DW_AT_name("Crc32")
     733                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("Crc32")
     734                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     735                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     736                            .dwattr $C$DW$48, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     737                            .dwattr $C$DW$48, DW_AT_decl_line(0x76)
     738                            .dwattr $C$DW$48, DW_AT_decl_column(0x25)
     739                    
     740                    $C$DW$49        .dwtag  DW_TAG_member
     741                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$34)
     742                            .dwattr $C$DW$49, DW_AT_name("FlashGetSize")
     743                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("FlashGetSize")
     744                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     745                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     746                            .dwattr $C$DW$49, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     747                            .dwattr $C$DW$49, DW_AT_decl_line(0x77)
     748                            .dwattr $C$DW$49, DW_AT_decl_column(0x25)
     749                    
     750                    $C$DW$50        .dwtag  DW_TAG_member
     751                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$35)
     752                            .dwattr $C$DW$50, DW_AT_name("GetChipId")
     753                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("GetChipId")
     754                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     755                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     756                            .dwattr $C$DW$50, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     757                            .dwattr $C$DW$50, DW_AT_decl_line(0x78)
     758                            .dwattr $C$DW$50, DW_AT_decl_column(0x25)
     759                    
     760                    $C$DW$51        .dwtag  DW_TAG_member
     761                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$38)
     762                            .dwattr $C$DW$51, DW_AT_name("ReservedLocation1")
     763                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("ReservedLocation1")
     764                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     765                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     766                            .dwattr $C$DW$51, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   15

     767                            .dwattr $C$DW$51, DW_AT_decl_line(0x79)
     768                            .dwattr $C$DW$51, DW_AT_decl_column(0x25)
     769                    
     770                    $C$DW$52        .dwtag  DW_TAG_member
     771                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$39)
     772                            .dwattr $C$DW$52, DW_AT_name("ReservedLocation2")
     773                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("ReservedLocation2")
     774                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     775                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     776                            .dwattr $C$DW$52, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     777                            .dwattr $C$DW$52, DW_AT_decl_line(0x7a)
     778                            .dwattr $C$DW$52, DW_AT_decl_column(0x25)
     779                    
     780                    $C$DW$53        .dwtag  DW_TAG_member
     781                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$40)
     782                            .dwattr $C$DW$53, DW_AT_name("ReservedLocation3")
     783                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("ReservedLocation3")
     784                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     785                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     786                            .dwattr $C$DW$53, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     787                            .dwattr $C$DW$53, DW_AT_decl_line(0x7b)
     788                            .dwattr $C$DW$53, DW_AT_decl_column(0x25)
     789                    
     790                    $C$DW$54        .dwtag  DW_TAG_member
     791                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$43)
     792                            .dwattr $C$DW$54, DW_AT_name("ResetDevice")
     793                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("ResetDevice")
     794                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     795                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     796                            .dwattr $C$DW$54, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     797                            .dwattr $C$DW$54, DW_AT_decl_line(0x7c)
     798                            .dwattr $C$DW$54, DW_AT_decl_column(0x25)
     799                    
     800                    $C$DW$55        .dwtag  DW_TAG_member
     801                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$49)
     802                            .dwattr $C$DW$55, DW_AT_name("Fletcher32")
     803                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("Fletcher32")
     804                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     805                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     806                            .dwattr $C$DW$55, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     807                            .dwattr $C$DW$55, DW_AT_decl_line(0x7d)
     808                            .dwattr $C$DW$55, DW_AT_decl_column(0x25)
     809                    
     810                    $C$DW$56        .dwtag  DW_TAG_member
     811                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$53)
     812                            .dwattr $C$DW$56, DW_AT_name("MinValue")
     813                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("MinValue")
     814                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     815                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     816                            .dwattr $C$DW$56, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     817                            .dwattr $C$DW$56, DW_AT_decl_line(0x7e)
     818                            .dwattr $C$DW$56, DW_AT_decl_column(0x25)
     819                    
     820                    $C$DW$57        .dwtag  DW_TAG_member
     821                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$54)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   16

     822                            .dwattr $C$DW$57, DW_AT_name("MaxValue")
     823                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("MaxValue")
     824                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     825                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     826                            .dwattr $C$DW$57, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     827                            .dwattr $C$DW$57, DW_AT_decl_line(0x7f)
     828                            .dwattr $C$DW$57, DW_AT_decl_column(0x25)
     829                    
     830                    $C$DW$58        .dwtag  DW_TAG_member
     831                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$55)
     832                            .dwattr $C$DW$58, DW_AT_name("MeanValue")
     833                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("MeanValue")
     834                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     835                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     836                            .dwattr $C$DW$58, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     837                            .dwattr $C$DW$58, DW_AT_decl_line(0x80)
     838                            .dwattr $C$DW$58, DW_AT_decl_column(0x25)
     839                    
     840                    $C$DW$59        .dwtag  DW_TAG_member
     841                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$56)
     842                            .dwattr $C$DW$59, DW_AT_name("StandDeviationValue")
     843                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("StandDeviationValue")
     844                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     845                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     846                            .dwattr $C$DW$59, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     847                            .dwattr $C$DW$59, DW_AT_decl_line(0x81)
     848                            .dwattr $C$DW$59, DW_AT_decl_column(0x25)
     849                    
     850                    $C$DW$60        .dwtag  DW_TAG_member
     851                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$59)
     852                            .dwattr $C$DW$60, DW_AT_name("ReservedLocation4")
     853                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("ReservedLocation4")
     854                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     855                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     856                            .dwattr $C$DW$60, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     857                            .dwattr $C$DW$60, DW_AT_decl_line(0x82)
     858                            .dwattr $C$DW$60, DW_AT_decl_column(0x25)
     859                    
     860                    $C$DW$61        .dwtag  DW_TAG_member
     861                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$60)
     862                            .dwattr $C$DW$61, DW_AT_name("ReservedLocation5")
     863                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("ReservedLocation5")
     864                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     865                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     866                            .dwattr $C$DW$61, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     867                            .dwattr $C$DW$61, DW_AT_decl_line(0x83)
     868                            .dwattr $C$DW$61, DW_AT_decl_column(0x25)
     869                    
     870                    $C$DW$62        .dwtag  DW_TAG_member
     871                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$61)
     872                            .dwattr $C$DW$62, DW_AT_name("HFSourceSafeSwitch")
     873                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
     874                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     875                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     876                            .dwattr $C$DW$62, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   17

     877                            .dwattr $C$DW$62, DW_AT_decl_line(0x84)
     878                            .dwattr $C$DW$62, DW_AT_decl_column(0x25)
     879                    
     880                    $C$DW$63        .dwtag  DW_TAG_member
     881                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$64)
     882                            .dwattr $C$DW$63, DW_AT_name("SelectCompAInput")
     883                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("SelectCompAInput")
     884                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     885                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     886                            .dwattr $C$DW$63, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     887                            .dwattr $C$DW$63, DW_AT_decl_line(0x85)
     888                            .dwattr $C$DW$63, DW_AT_decl_column(0x25)
     889                    
     890                    $C$DW$64        .dwtag  DW_TAG_member
     891                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$65)
     892                            .dwattr $C$DW$64, DW_AT_name("SelectCompARef")
     893                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("SelectCompARef")
     894                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     895                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     896                            .dwattr $C$DW$64, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     897                            .dwattr $C$DW$64, DW_AT_decl_line(0x86)
     898                            .dwattr $C$DW$64, DW_AT_decl_column(0x25)
     899                    
     900                    $C$DW$65        .dwtag  DW_TAG_member
     901                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$66)
     902                            .dwattr $C$DW$65, DW_AT_name("SelectADCCompBInput")
     903                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("SelectADCCompBInput")
     904                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     905                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     906                            .dwattr $C$DW$65, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     907                            .dwattr $C$DW$65, DW_AT_decl_line(0x87)
     908                            .dwattr $C$DW$65, DW_AT_decl_column(0x25)
     909                    
     910                    $C$DW$66        .dwtag  DW_TAG_member
     911                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$67)
     912                            .dwattr $C$DW$66, DW_AT_name("SelectCompBRef")
     913                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("SelectCompBRef")
     914                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     915                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     916                            .dwattr $C$DW$66, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     917                            .dwattr $C$DW$66, DW_AT_decl_line(0x88)
     918                            .dwattr $C$DW$66, DW_AT_decl_column(0x25)
     919                    
     920                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
     921                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x75)
     922                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x01)
     923                            .dwendtag $C$DW$T$68
     924                    
     925                    $C$DW$T$192     .dwtag  DW_TAG_typedef
     926                            .dwattr $C$DW$T$192, DW_AT_name("HARD_API_T")
     927                            .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$68)
     928                            .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
     929                            .dwattr $C$DW$T$192, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
     930                            .dwattr $C$DW$T$192, DW_AT_decl_line(0x89)
     931                            .dwattr $C$DW$T$192, DW_AT_decl_column(0x03)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   18

     932                    
     933                    
     934                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
     935                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x08)
     936                    $C$DW$67        .dwtag  DW_TAG_member
     937                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$10)
     938                            .dwattr $C$DW$67, DW_AT_name("quot")
     939                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("quot")
     940                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     941                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     942                            .dwattr $C$DW$67, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/st
     943                            .dwattr $C$DW$67, DW_AT_decl_line(0x49)
     944                            .dwattr $C$DW$67, DW_AT_decl_column(0x16)
     945                    
     946                    $C$DW$68        .dwtag  DW_TAG_member
     947                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$10)
     948                            .dwattr $C$DW$68, DW_AT_name("rem")
     949                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("rem")
     950                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     951                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     952                            .dwattr $C$DW$68, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/st
     953                            .dwattr $C$DW$68, DW_AT_decl_line(0x49)
     954                            .dwattr $C$DW$68, DW_AT_decl_column(0x1c)
     955                    
     956                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
     957                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x49)
     958                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x10)
     959                            .dwendtag $C$DW$T$69
     960                    
     961                    $C$DW$T$193     .dwtag  DW_TAG_typedef
     962                            .dwattr $C$DW$T$193, DW_AT_name("div_t")
     963                            .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$69)
     964                            .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
     965                            .dwattr $C$DW$T$193, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
     966                            .dwattr $C$DW$T$193, DW_AT_decl_line(0x49)
     967                            .dwattr $C$DW$T$193, DW_AT_decl_column(0x23)
     968                    
     969                    
     970                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
     971                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x08)
     972                    $C$DW$69        .dwtag  DW_TAG_member
     973                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$10)
     974                            .dwattr $C$DW$69, DW_AT_name("quot")
     975                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("quot")
     976                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     977                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     978                            .dwattr $C$DW$69, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/st
     979                            .dwattr $C$DW$69, DW_AT_decl_line(0x4e)
     980                            .dwattr $C$DW$69, DW_AT_decl_column(0x16)
     981                    
     982                    $C$DW$70        .dwtag  DW_TAG_member
     983                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$10)
     984                            .dwattr $C$DW$70, DW_AT_name("rem")
     985                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("rem")
     986                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   19

     987                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     988                            .dwattr $C$DW$70, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/st
     989                            .dwattr $C$DW$70, DW_AT_decl_line(0x4e)
     990                            .dwattr $C$DW$70, DW_AT_decl_column(0x1c)
     991                    
     992                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
     993                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x4e)
     994                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x10)
     995                            .dwendtag $C$DW$T$70
     996                    
     997                    $C$DW$T$194     .dwtag  DW_TAG_typedef
     998                            .dwattr $C$DW$T$194, DW_AT_name("ldiv_t")
     999                            .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$70)
    1000                            .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    1001                            .dwattr $C$DW$T$194, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1002                            .dwattr $C$DW$T$194, DW_AT_decl_line(0x4e)
    1003                            .dwattr $C$DW$T$194, DW_AT_decl_column(0x23)
    1004                    
    1005                    
    1006                    $C$DW$T$71      .dwtag  DW_TAG_structure_type
    1007                            .dwattr $C$DW$T$71, DW_AT_byte_size(0x10)
    1008                    $C$DW$71        .dwtag  DW_TAG_member
    1009                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$14)
    1010                            .dwattr $C$DW$71, DW_AT_name("quot")
    1011                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("quot")
    1012                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1013                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1014                            .dwattr $C$DW$71, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/st
    1015                            .dwattr $C$DW$71, DW_AT_decl_line(0x56)
    1016                            .dwattr $C$DW$71, DW_AT_decl_column(0x1c)
    1017                    
    1018                    $C$DW$72        .dwtag  DW_TAG_member
    1019                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$14)
    1020                            .dwattr $C$DW$72, DW_AT_name("rem")
    1021                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("rem")
    1022                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1023                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1024                            .dwattr $C$DW$72, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/st
    1025                            .dwattr $C$DW$72, DW_AT_decl_line(0x56)
    1026                            .dwattr $C$DW$72, DW_AT_decl_column(0x22)
    1027                    
    1028                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    1029                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x56)
    1030                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x10)
    1031                            .dwendtag $C$DW$T$71
    1032                    
    1033                    $C$DW$T$195     .dwtag  DW_TAG_typedef
    1034                            .dwattr $C$DW$T$195, DW_AT_name("lldiv_t")
    1035                            .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$71)
    1036                            .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
    1037                            .dwattr $C$DW$T$195, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1038                            .dwattr $C$DW$T$195, DW_AT_decl_line(0x56)
    1039                            .dwattr $C$DW$T$195, DW_AT_decl_column(0x29)
    1040                    
    1041                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   20

    1042                    $C$DW$T$76      .dwtag  DW_TAG_structure_type
    1043                            .dwattr $C$DW$T$76, DW_AT_byte_size(0x08)
    1044                    $C$DW$73        .dwtag  DW_TAG_member
    1045                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$74)
    1046                            .dwattr $C$DW$73, DW_AT_name("pointerStack")
    1047                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("pointerStack")
    1048                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1049                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1050                            .dwattr $C$DW$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1051                            .dwattr $C$DW$73, DW_AT_decl_line(0x3f5)
    1052                            .dwattr $C$DW$73, DW_AT_decl_column(0x16)
    1053                    
    1054                    $C$DW$74        .dwtag  DW_TAG_member
    1055                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$75)
    1056                            .dwattr $C$DW$74, DW_AT_name("directAPI")
    1057                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("directAPI")
    1058                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1059                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1060                            .dwattr $C$DW$74, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1061                            .dwattr $C$DW$74, DW_AT_decl_line(0x3f6)
    1062                            .dwattr $C$DW$74, DW_AT_decl_column(0x15)
    1063                    
    1064                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1065                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x3f4)
    1066                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x01)
    1067                            .dwendtag $C$DW$T$76
    1068                    
    1069                    $C$DW$T$78      .dwtag  DW_TAG_typedef
    1070                            .dwattr $C$DW$T$78, DW_AT_name("icall_directAPIMsg_t")
    1071                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$76)
    1072                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1073                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1074                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x3f7)
    1075                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    1076                    
    1077                    
    1078                    $C$DW$T$79      .dwtag  DW_TAG_structure_type
    1079                            .dwattr $C$DW$T$79, DW_AT_byte_size(0x14)
    1080                    $C$DW$75        .dwtag  DW_TAG_member
    1081                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$77)
    1082                            .dwattr $C$DW$75, DW_AT_name("hdr")
    1083                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("hdr")
    1084                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1085                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1086                            .dwattr $C$DW$75, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1087                            .dwattr $C$DW$75, DW_AT_decl_line(0x3fb)
    1088                            .dwattr $C$DW$75, DW_AT_decl_column(0x10)
    1089                    
    1090                    $C$DW$76        .dwtag  DW_TAG_member
    1091                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$78)
    1092                            .dwattr $C$DW$76, DW_AT_name("msg")
    1093                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("msg")
    1094                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1095                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1096                            .dwattr $C$DW$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   21

    1097                            .dwattr $C$DW$76, DW_AT_decl_line(0x3fc)
    1098                            .dwattr $C$DW$76, DW_AT_decl_column(0x1a)
    1099                    
    1100                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1101                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x3fa)
    1102                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x01)
    1103                            .dwendtag $C$DW$T$79
    1104                    
    1105                    $C$DW$T$196     .dwtag  DW_TAG_typedef
    1106                            .dwattr $C$DW$T$196, DW_AT_name("icallLiteMsg_t")
    1107                            .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$79)
    1108                            .dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)
    1109                            .dwattr $C$DW$T$196, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1110                            .dwattr $C$DW$T$196, DW_AT_decl_line(0x3fd)
    1111                            .dwattr $C$DW$T$196, DW_AT_decl_column(0x03)
    1112                    
    1113                    
    1114                    $C$DW$T$83      .dwtag  DW_TAG_structure_type
    1115                            .dwattr $C$DW$T$83, DW_AT_byte_size(0x0c)
    1116                    $C$DW$77        .dwtag  DW_TAG_member
    1117                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$80)
    1118                            .dwattr $C$DW$77, DW_AT_name("bufferHead")
    1119                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("bufferHead")
    1120                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1121                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1122                            .dwattr $C$DW$77, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1123                            .dwattr $C$DW$77, DW_AT_decl_line(0x80)
    1124                            .dwattr $C$DW$77, DW_AT_decl_column(0x13)
    1125                    
    1126                    $C$DW$78        .dwtag  DW_TAG_member
    1127                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$80)
    1128                            .dwattr $C$DW$78, DW_AT_name("bufferTail")
    1129                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("bufferTail")
    1130                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1131                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1132                            .dwattr $C$DW$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1133                            .dwattr $C$DW$78, DW_AT_decl_line(0x81)
    1134                            .dwattr $C$DW$78, DW_AT_decl_column(0x13)
    1135                    
    1136                    $C$DW$79        .dwtag  DW_TAG_member
    1137                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$21)
    1138                            .dwattr $C$DW$79, DW_AT_name("maxBufSize")
    1139                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("maxBufSize")
    1140                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1141                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1142                            .dwattr $C$DW$79, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1143                            .dwattr $C$DW$79, DW_AT_decl_line(0x82)
    1144                            .dwattr $C$DW$79, DW_AT_decl_column(0x0a)
    1145                    
    1146                    $C$DW$80        .dwtag  DW_TAG_member
    1147                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$82)
    1148                            .dwattr $C$DW$80, DW_AT_name("pBuffer")
    1149                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("pBuffer")
    1150                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1151                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   22

    1152                            .dwattr $C$DW$80, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1153                            .dwattr $C$DW$80, DW_AT_decl_line(0x83)
    1154                            .dwattr $C$DW$80, DW_AT_decl_column(0x0a)
    1155                    
    1156                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1157                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x7e)
    1158                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x01)
    1159                            .dwendtag $C$DW$T$83
    1160                    
    1161                    $C$DW$T$85      .dwtag  DW_TAG_typedef
    1162                            .dwattr $C$DW$T$85, DW_AT_name("halUARTBufControl_t")
    1163                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$83)
    1164                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1165                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1166                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x84)
    1167                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x03)
    1168                    
    1169                    
    1170                    $C$DW$T$90      .dwtag  DW_TAG_structure_type
    1171                            .dwattr $C$DW$T$90, DW_AT_byte_size(0x2c)
    1172                    $C$DW$81        .dwtag  DW_TAG_member
    1173                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$84)
    1174                            .dwattr $C$DW$81, DW_AT_name("configured")
    1175                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("configured")
    1176                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1177                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1178                            .dwattr $C$DW$81, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1179                            .dwattr $C$DW$81, DW_AT_decl_line(0x88)
    1180                            .dwattr $C$DW$81, DW_AT_decl_column(0x17)
    1181                    
    1182                    $C$DW$82        .dwtag  DW_TAG_member
    1183                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$81)
    1184                            .dwattr $C$DW$82, DW_AT_name("baudRate")
    1185                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("baudRate")
    1186                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1187                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1188                            .dwattr $C$DW$82, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1189                            .dwattr $C$DW$82, DW_AT_decl_line(0x89)
    1190                            .dwattr $C$DW$82, DW_AT_decl_column(0x17)
    1191                    
    1192                    $C$DW$83        .dwtag  DW_TAG_member
    1193                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$84)
    1194                            .dwattr $C$DW$83, DW_AT_name("flowControl")
    1195                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("flowControl")
    1196                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1197                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1198                            .dwattr $C$DW$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1199                            .dwattr $C$DW$83, DW_AT_decl_line(0x8a)
    1200                            .dwattr $C$DW$83, DW_AT_decl_column(0x17)
    1201                    
    1202                    $C$DW$84        .dwtag  DW_TAG_member
    1203                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    1204                            .dwattr $C$DW$84, DW_AT_name("flowControlThreshold")
    1205                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("flowControlThreshold")
    1206                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   23

    1207                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1208                            .dwattr $C$DW$84, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1209                            .dwattr $C$DW$84, DW_AT_decl_line(0x8b)
    1210                            .dwattr $C$DW$84, DW_AT_decl_column(0x17)
    1211                    
    1212                    $C$DW$85        .dwtag  DW_TAG_member
    1213                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$81)
    1214                            .dwattr $C$DW$85, DW_AT_name("idleTimeout")
    1215                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("idleTimeout")
    1216                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1217                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1218                            .dwattr $C$DW$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1219                            .dwattr $C$DW$85, DW_AT_decl_line(0x8c)
    1220                            .dwattr $C$DW$85, DW_AT_decl_column(0x17)
    1221                    
    1222                    $C$DW$86        .dwtag  DW_TAG_member
    1223                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$85)
    1224                            .dwattr $C$DW$86, DW_AT_name("rx")
    1225                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("rx")
    1226                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1227                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1228                            .dwattr $C$DW$86, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1229                            .dwattr $C$DW$86, DW_AT_decl_line(0x8d)
    1230                            .dwattr $C$DW$86, DW_AT_decl_column(0x17)
    1231                    
    1232                    $C$DW$87        .dwtag  DW_TAG_member
    1233                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$85)
    1234                            .dwattr $C$DW$87, DW_AT_name("tx")
    1235                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("tx")
    1236                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1237                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1238                            .dwattr $C$DW$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1239                            .dwattr $C$DW$87, DW_AT_decl_line(0x8e)
    1240                            .dwattr $C$DW$87, DW_AT_decl_column(0x17)
    1241                    
    1242                    $C$DW$88        .dwtag  DW_TAG_member
    1243                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$84)
    1244                            .dwattr $C$DW$88, DW_AT_name("intEnable")
    1245                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("intEnable")
    1246                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1247                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1248                            .dwattr $C$DW$88, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1249                            .dwattr $C$DW$88, DW_AT_decl_line(0x8f)
    1250                            .dwattr $C$DW$88, DW_AT_decl_column(0x17)
    1251                    
    1252                    $C$DW$89        .dwtag  DW_TAG_member
    1253                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$86)
    1254                            .dwattr $C$DW$89, DW_AT_name("rxChRvdTime")
    1255                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("rxChRvdTime")
    1256                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1257                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1258                            .dwattr $C$DW$89, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1259                            .dwattr $C$DW$89, DW_AT_decl_line(0x90)
    1260                            .dwattr $C$DW$89, DW_AT_decl_column(0x17)
    1261                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   24

    1262                    $C$DW$90        .dwtag  DW_TAG_member
    1263                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$89)
    1264                            .dwattr $C$DW$90, DW_AT_name("callBackFunc")
    1265                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("callBackFunc")
    1266                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1267                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1268                            .dwattr $C$DW$90, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1269                            .dwattr $C$DW$90, DW_AT_decl_line(0x91)
    1270                            .dwattr $C$DW$90, DW_AT_decl_column(0x17)
    1271                    
    1272                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1273                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x87)
    1274                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x01)
    1275                            .dwendtag $C$DW$T$90
    1276                    
    1277                    $C$DW$T$197     .dwtag  DW_TAG_typedef
    1278                            .dwattr $C$DW$T$197, DW_AT_name("halUARTCfg_t")
    1279                            .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$90)
    1280                            .dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
    1281                            .dwattr $C$DW$T$197, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1282                            .dwattr $C$DW$T$197, DW_AT_decl_line(0x92)
    1283                            .dwattr $C$DW$T$197, DW_AT_decl_column(0x02)
    1284                    
    1285                    
    1286                    $C$DW$T$91      .dwtag  DW_TAG_structure_type
    1287                            .dwattr $C$DW$T$91, DW_AT_byte_size(0x02)
    1288                    $C$DW$91        .dwtag  DW_TAG_member
    1289                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$81)
    1290                            .dwattr $C$DW$91, DW_AT_name("event")
    1291                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("event")
    1292                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1293                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1294                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1295                            .dwattr $C$DW$91, DW_AT_decl_line(0x79)
    1296                            .dwattr $C$DW$91, DW_AT_decl_column(0x0a)
    1297                    
    1298                    $C$DW$92        .dwtag  DW_TAG_member
    1299                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$81)
    1300                            .dwattr $C$DW$92, DW_AT_name("status")
    1301                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("status")
    1302                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1303                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1304                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1305                            .dwattr $C$DW$92, DW_AT_decl_line(0x7a)
    1306                            .dwattr $C$DW$92, DW_AT_decl_column(0x0a)
    1307                    
    1308                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1309                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x78)
    1310                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x01)
    1311                            .dwendtag $C$DW$T$91
    1312                    
    1313                    $C$DW$T$92      .dwtag  DW_TAG_typedef
    1314                            .dwattr $C$DW$T$92, DW_AT_name("osal_event_hdr_t")
    1315                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    1316                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   25

    1317                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1318                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x7b)
    1319                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x03)
    1320                    
    1321                    
    1322                    $C$DW$T$93      .dwtag  DW_TAG_structure_type
    1323                            .dwattr $C$DW$T$93, DW_AT_byte_size(0x04)
    1324                    $C$DW$93        .dwtag  DW_TAG_member
    1325                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$92)
    1326                            .dwattr $C$DW$93, DW_AT_name("hdr")
    1327                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("hdr")
    1328                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1329                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1330                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1350
    1331                            .dwattr $C$DW$93, DW_AT_decl_line(0xbc)
    1332                            .dwattr $C$DW$93, DW_AT_decl_column(0x14)
    1333                    
    1334                    $C$DW$94        .dwtag  DW_TAG_member
    1335                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$81)
    1336                            .dwattr $C$DW$94, DW_AT_name("state")
    1337                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("state")
    1338                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1339                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1340                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1350
    1341                            .dwattr $C$DW$94, DW_AT_decl_line(0xbd)
    1342                            .dwattr $C$DW$94, DW_AT_decl_column(0x09)
    1343                    
    1344                    $C$DW$95        .dwtag  DW_TAG_member
    1345                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$81)
    1346                            .dwattr $C$DW$95, DW_AT_name("keys")
    1347                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("keys")
    1348                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1349                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1350                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1350
    1351                            .dwattr $C$DW$95, DW_AT_decl_line(0xbe)
    1352                            .dwattr $C$DW$95, DW_AT_decl_column(0x09)
    1353                    
    1354                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC13
    1355                            .dwattr $C$DW$T$93, DW_AT_decl_line(0xbb)
    1356                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x01)
    1357                            .dwendtag $C$DW$T$93
    1358                    
    1359                    $C$DW$T$198     .dwtag  DW_TAG_typedef
    1360                            .dwattr $C$DW$T$198, DW_AT_name("keyChange_t")
    1361                            .dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$93)
    1362                            .dwattr $C$DW$T$198, DW_AT_language(DW_LANG_C)
    1363                            .dwattr $C$DW$T$198, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    1364                            .dwattr $C$DW$T$198, DW_AT_decl_line(0xbf)
    1365                            .dwattr $C$DW$T$198, DW_AT_decl_column(0x03)
    1366                    
    1367                    
    1368                    $C$DW$T$100     .dwtag  DW_TAG_union_type
    1369                            .dwattr $C$DW$T$100, DW_AT_byte_size(0x02)
    1370                    $C$DW$96        .dwtag  DW_TAG_member
    1371                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$96)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   26

    1372                            .dwattr $C$DW$96, DW_AT_name("entityId")
    1373                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("entityId")
    1374                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1375                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1376                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1377                            .dwattr $C$DW$96, DW_AT_decl_line(0x1fe)
    1378                            .dwattr $C$DW$96, DW_AT_decl_column(0x14)
    1379                    
    1380                    $C$DW$97        .dwtag  DW_TAG_member
    1381                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$99)
    1382                            .dwattr $C$DW$97, DW_AT_name("servId")
    1383                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("servId")
    1384                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1385                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1386                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1387                            .dwattr $C$DW$97, DW_AT_decl_line(0x200)
    1388                            .dwattr $C$DW$97, DW_AT_decl_column(0x17)
    1389                    
    1390                            .dwattr $C$DW$T$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1391                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x1fc)
    1392                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x03)
    1393                            .dwendtag $C$DW$T$100
    1394                    
    1395                    
    1396                    $C$DW$T$101     .dwtag  DW_TAG_union_type
    1397                            .dwattr $C$DW$T$101, DW_AT_byte_size(0x02)
    1398                    $C$DW$98        .dwtag  DW_TAG_member
    1399                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$99)
    1400                            .dwattr $C$DW$98, DW_AT_name("servId")
    1401                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("servId")
    1402                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1403                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1404                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1405                            .dwattr $C$DW$98, DW_AT_decl_line(0x211)
    1406                            .dwattr $C$DW$98, DW_AT_decl_column(0x17)
    1407                    
    1408                    $C$DW$99        .dwtag  DW_TAG_member
    1409                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$96)
    1410                            .dwattr $C$DW$99, DW_AT_name("entityId")
    1411                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("entityId")
    1412                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1413                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1414                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1415                            .dwattr $C$DW$99, DW_AT_decl_line(0x213)
    1416                            .dwattr $C$DW$99, DW_AT_decl_column(0x14)
    1417                    
    1418                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1419                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x20f)
    1420                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x03)
    1421                            .dwendtag $C$DW$T$101
    1422                    
    1423                    
    1424                    $C$DW$T$102     .dwtag  DW_TAG_union_type
    1425                            .dwattr $C$DW$T$102, DW_AT_byte_size(0x02)
    1426                    $C$DW$100       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   27

    1427                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$84)
    1428                            .dwattr $C$DW$100, DW_AT_name("paramCTS")
    1429                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("paramCTS")
    1430                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1431                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1432                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1433                            .dwattr $C$DW$100, DW_AT_decl_line(0x96)
    1434                            .dwattr $C$DW$100, DW_AT_decl_column(0x08)
    1435                    
    1436                    $C$DW$101       .dwtag  DW_TAG_member
    1437                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$84)
    1438                            .dwattr $C$DW$101, DW_AT_name("paramRTS")
    1439                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("paramRTS")
    1440                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1441                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1442                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1443                            .dwattr $C$DW$101, DW_AT_decl_line(0x97)
    1444                            .dwattr $C$DW$101, DW_AT_decl_column(0x08)
    1445                    
    1446                    $C$DW$102       .dwtag  DW_TAG_member
    1447                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$84)
    1448                            .dwattr $C$DW$102, DW_AT_name("paramDSR")
    1449                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("paramDSR")
    1450                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1451                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1452                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1453                            .dwattr $C$DW$102, DW_AT_decl_line(0x98)
    1454                            .dwattr $C$DW$102, DW_AT_decl_column(0x08)
    1455                    
    1456                    $C$DW$103       .dwtag  DW_TAG_member
    1457                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$84)
    1458                            .dwattr $C$DW$103, DW_AT_name("paramDTR")
    1459                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("paramDTR")
    1460                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1461                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1462                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1463                            .dwattr $C$DW$103, DW_AT_decl_line(0x99)
    1464                            .dwattr $C$DW$103, DW_AT_decl_column(0x08)
    1465                    
    1466                    $C$DW$104       .dwtag  DW_TAG_member
    1467                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$84)
    1468                            .dwattr $C$DW$104, DW_AT_name("paramCD")
    1469                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("paramCD")
    1470                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1471                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1472                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1473                            .dwattr $C$DW$104, DW_AT_decl_line(0x9a)
    1474                            .dwattr $C$DW$104, DW_AT_decl_column(0x08)
    1475                    
    1476                    $C$DW$105       .dwtag  DW_TAG_member
    1477                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$84)
    1478                            .dwattr $C$DW$105, DW_AT_name("paramRI")
    1479                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("paramRI")
    1480                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1481                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   28

    1482                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1483                            .dwattr $C$DW$105, DW_AT_decl_line(0x9b)
    1484                            .dwattr $C$DW$105, DW_AT_decl_column(0x08)
    1485                    
    1486                    $C$DW$106       .dwtag  DW_TAG_member
    1487                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$21)
    1488                            .dwattr $C$DW$106, DW_AT_name("baudRate")
    1489                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("baudRate")
    1490                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1491                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1492                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1493                            .dwattr $C$DW$106, DW_AT_decl_line(0x9c)
    1494                            .dwattr $C$DW$106, DW_AT_decl_column(0x0a)
    1495                    
    1496                    $C$DW$107       .dwtag  DW_TAG_member
    1497                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$84)
    1498                            .dwattr $C$DW$107, DW_AT_name("flowControl")
    1499                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("flowControl")
    1500                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1501                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1502                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1503                            .dwattr $C$DW$107, DW_AT_decl_line(0x9d)
    1504                            .dwattr $C$DW$107, DW_AT_decl_column(0x08)
    1505                    
    1506                    $C$DW$108       .dwtag  DW_TAG_member
    1507                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$84)
    1508                            .dwattr $C$DW$108, DW_AT_name("flushControl")
    1509                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("flushControl")
    1510                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1511                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1512                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1513                            .dwattr $C$DW$108, DW_AT_decl_line(0x9e)
    1514                            .dwattr $C$DW$108, DW_AT_decl_column(0x08)
    1515                    
    1516                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1517                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x95)
    1518                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x01)
    1519                            .dwendtag $C$DW$T$102
    1520                    
    1521                    $C$DW$T$199     .dwtag  DW_TAG_typedef
    1522                            .dwattr $C$DW$T$199, DW_AT_name("halUARTIoctl_t")
    1523                            .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$102)
    1524                            .dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
    1525                            .dwattr $C$DW$T$199, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1526                            .dwattr $C$DW$T$199, DW_AT_decl_line(0x9f)
    1527                            .dwattr $C$DW$T$199, DW_AT_decl_column(0x02)
    1528                    
    1529                    
    1530                    $C$DW$T$103     .dwtag  DW_TAG_structure_type
    1531                            .dwattr $C$DW$T$103, DW_AT_name(".ggroup1")
    1532                            .dwattr $C$DW$T$103, DW_AT_byte_size(0x04)
    1533                    $C$DW$109       .dwtag  DW_TAG_member
    1534                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$6)
    1535                            .dwattr $C$DW$109, DW_AT_name("pwrmgr_initialized")
    1536                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("pwrmgr_initialized")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   29

    1537                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1538                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1539                    
    1540                    $C$DW$110       .dwtag  DW_TAG_member
    1541                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$22)
    1542                            .dwattr $C$DW$110, DW_AT_name("pwrmgr_attribute")
    1543                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("pwrmgr_attribute")
    1544                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1545                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1546                    
    1547                            .dwendtag $C$DW$T$103
    1548                    
    1549                    
    1550                    $C$DW$T$104     .dwtag  DW_TAG_structure_type
    1551                            .dwattr $C$DW$T$104, DW_AT_name("_ICall_LiteCmdStatus_")
    1552                            .dwattr $C$DW$T$104, DW_AT_byte_size(0x01)
    1553                    $C$DW$111       .dwtag  DW_TAG_member
    1554                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$95)
    1555                            .dwattr $C$DW$111, DW_AT_name("cmdId")
    1556                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("cmdId")
    1557                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1558                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1559                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1560                            .dwattr $C$DW$111, DW_AT_decl_line(0x3f0)
    1561                            .dwattr $C$DW$111, DW_AT_decl_column(0x11)
    1562                    
    1563                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1564                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x3ee)
    1565                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x10)
    1566                            .dwendtag $C$DW$T$104
    1567                    
    1568                    $C$DW$T$201     .dwtag  DW_TAG_typedef
    1569                            .dwattr $C$DW$T$201, DW_AT_name("ICall_LiteCmdStatus")
    1570                            .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$104)
    1571                            .dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
    1572                            .dwattr $C$DW$T$201, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1573                            .dwattr $C$DW$T$201, DW_AT_decl_line(0x3f1)
    1574                            .dwattr $C$DW$T$201, DW_AT_decl_column(0x03)
    1575                    
    1576                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1577                            .dwattr $C$DW$T$2, DW_AT_name("void")
    1578                    
    1579                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1580                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1581                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1582                    
    1583                    $C$DW$T$202     .dwtag  DW_TAG_typedef
    1584                            .dwattr $C$DW$T$202, DW_AT_name("ICall_Semaphore")
    1585                            .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$3)
    1586                            .dwattr $C$DW$T$202, DW_AT_language(DW_LANG_C)
    1587                            .dwattr $C$DW$T$202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1588                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x1ac)
    1589                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x0f)
    1590                    
    1591                    $C$DW$T$120     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   30

    1592                            .dwattr $C$DW$T$120, DW_AT_name("ICall_SyncHandle")
    1593                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$3)
    1594                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    1595                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1596                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x1aa)
    1597                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x0f)
    1598                    
    1599                    $C$DW$T$167     .dwtag  DW_TAG_typedef
    1600                            .dwattr $C$DW$T$167, DW_AT_name("ICall_TimerID")
    1601                            .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$3)
    1602                            .dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
    1603                            .dwattr $C$DW$T$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1604                            .dwattr $C$DW$T$167, DW_AT_decl_line(0x1b7)
    1605                            .dwattr $C$DW$T$167, DW_AT_decl_column(0x0f)
    1606                    
    1607                    $C$DW$T$203     .dwtag  DW_TAG_typedef
    1608                            .dwattr $C$DW$T$203, DW_AT_name("osal_msg_q_t")
    1609                            .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$3)
    1610                            .dwattr $C$DW$T$203, DW_AT_language(DW_LANG_C)
    1611                            .dwattr $C$DW$T$203, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1612                            .dwattr $C$DW$T$203, DW_AT_decl_line(0x7d)
    1613                            .dwattr $C$DW$T$203, DW_AT_decl_column(0x10)
    1614                    
    1615                    
    1616                    $C$DW$T$41      .dwtag  DW_TAG_subroutine_type
    1617                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1618                            .dwendtag $C$DW$T$41
    1619                    
    1620                    $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    1621                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1622                            .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    1623                    
    1624                    $C$DW$T$183     .dwtag  DW_TAG_typedef
    1625                            .dwattr $C$DW$T$183, DW_AT_name("APPASRTINTF_callAssrtHndler")
    1626                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$42)
    1627                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    1628                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1629                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x43)
    1630                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x10)
    1631                    
    1632                    $C$DW$T$61      .dwtag  DW_TAG_typedef
    1633                            .dwattr $C$DW$T$61, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
    1634                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$42)
    1635                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1636                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1637                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x5f)
    1638                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x19)
    1639                    
    1640                    $C$DW$T$43      .dwtag  DW_TAG_typedef
    1641                            .dwattr $C$DW$T$43, DW_AT_name("FPTR_RESETDEV_T")
    1642                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    1643                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1644                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1645                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x4d)
    1646                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x19)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   31

    1647                    
    1648                    $C$DW$T$204     .dwtag  DW_TAG_typedef
    1649                            .dwattr $C$DW$T$204, DW_AT_name("FPTR_VOID_VOID_T")
    1650                            .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$42)
    1651                            .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
    1652                            .dwattr $C$DW$T$204, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    1653                            .dwattr $C$DW$T$204, DW_AT_decl_line(0x33)
    1654                            .dwattr $C$DW$T$204, DW_AT_decl_column(0x11)
    1655                    
    1656                    $C$DW$T$205     .dwtag  DW_TAG_typedef
    1657                            .dwattr $C$DW$T$205, DW_AT_name("__TI_atexit_fn")
    1658                            .dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$42)
    1659                            .dwattr $C$DW$T$205, DW_AT_language(DW_LANG_C)
    1660                            .dwattr $C$DW$T$205, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1661                            .dwattr $C$DW$T$205, DW_AT_decl_line(0xb2)
    1662                            .dwattr $C$DW$T$205, DW_AT_decl_column(0x14)
    1663                    
    1664                    
    1665                    $C$DW$T$57      .dwtag  DW_TAG_subroutine_type
    1666                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    1667                    $C$DW$112       .dwtag  DW_TAG_formal_parameter
    1668                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$25)
    1669                    
    1670                            .dwendtag $C$DW$T$57
    1671                    
    1672                    $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    1673                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    1674                            .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    1675                    
    1676                    $C$DW$T$59      .dwtag  DW_TAG_typedef
    1677                            .dwattr $C$DW$T$59, DW_AT_name("FPTR_RESERVED4_T")
    1678                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    1679                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1680                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1681                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x61)
    1682                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x19)
    1683                    
    1684                    $C$DW$T$60      .dwtag  DW_TAG_typedef
    1685                            .dwattr $C$DW$T$60, DW_AT_name("FPTR_RESERVED5_T")
    1686                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$58)
    1687                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    1688                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1689                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x63)
    1690                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x19)
    1691                    
    1692                    
    1693                    $C$DW$T$62      .dwtag  DW_TAG_subroutine_type
    1694                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    1695                    $C$DW$113       .dwtag  DW_TAG_formal_parameter
    1696                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$27)
    1697                    
    1698                            .dwendtag $C$DW$T$62
    1699                    
    1700                    $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    1701                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   32

    1702                            .dwattr $C$DW$T$63, DW_AT_address_class(0x20)
    1703                    
    1704                    $C$DW$T$66      .dwtag  DW_TAG_typedef
    1705                            .dwattr $C$DW$T$66, DW_AT_name("FPTR_ADCCOMPBIN_T")
    1706                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$63)
    1707                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    1708                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1709                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x69)
    1710                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x19)
    1711                    
    1712                    $C$DW$T$64      .dwtag  DW_TAG_typedef
    1713                            .dwattr $C$DW$T$64, DW_AT_name("FPTR_COMPAIN_T")
    1714                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    1715                            .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    1716                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1717                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x65)
    1718                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x19)
    1719                    
    1720                    $C$DW$T$65      .dwtag  DW_TAG_typedef
    1721                            .dwattr $C$DW$T$65, DW_AT_name("FPTR_COMPAREF_T")
    1722                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$63)
    1723                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    1724                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1725                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x67)
    1726                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x19)
    1727                    
    1728                    $C$DW$T$67      .dwtag  DW_TAG_typedef
    1729                            .dwattr $C$DW$T$67, DW_AT_name("FPTR_COMPBREF_T")
    1730                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$63)
    1731                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    1732                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1733                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x6b)
    1734                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x19)
    1735                    
    1736                    $C$DW$T$206     .dwtag  DW_TAG_typedef
    1737                            .dwattr $C$DW$T$206, DW_AT_name("FPTR_VOID_UINT8_T")
    1738                            .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$63)
    1739                            .dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
    1740                            .dwattr $C$DW$T$206, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    1741                            .dwattr $C$DW$T$206, DW_AT_decl_line(0x34)
    1742                            .dwattr $C$DW$T$206, DW_AT_decl_column(0x11)
    1743                    
    1744                    
    1745                    $C$DW$T$87      .dwtag  DW_TAG_subroutine_type
    1746                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1747                    $C$DW$114       .dwtag  DW_TAG_formal_parameter
    1748                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$81)
    1749                    
    1750                    $C$DW$115       .dwtag  DW_TAG_formal_parameter
    1751                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$81)
    1752                    
    1753                            .dwendtag $C$DW$T$87
    1754                    
    1755                    $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    1756                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{6079A6DA-FD49-4140-A5D0-1ECA136867CD} PAGE   33

    1757                            .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
    1758                    
    1759                    $C$DW$T$207     .dwtag  DW_TAG_typedef
    1760                            .dwattr $C$DW$T$207, DW_AT_name("assertCback_t")
    1761                            .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$88)
    1762                            .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
    1763                            .dwattr $C$DW$T$207, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1764                            .dwattr $C$DW$T$207, DW_AT_decl_line(0xd3)
    1765                            .dwattr $C$DW$T$207, DW_AT_decl_column(0x10)
    1766                    
    1767                    $C$DW$T$89      .dwtag  DW_TAG_typedef
    1768                            .dwattr $C$DW$T$89, DW_AT_name("halUARTCBack_t")
    1769                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    1770                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1771                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1772                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x7b)
    1773                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x10)
    1774                    
    1775                    
    1776                    $C$DW$T$109     .dwtag  DW_TAG_subroutine_type
    1777                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    1778                    $C$DW$116       .dwtag  DW_TAG_formal_parameter
    1779                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$107)
    1780                    
    1781                            .dwendtag $C$DW$T$109
    1782                    
    1783                    $C$DW$T$110     .dwtag  DW_TAG_pointer_type
    1784                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    1785                            .dwattr $C$DW$T$110, DW_AT_address_class(0x20)
    1786                    
    1787                    
    1788                    $C$DW$T$145     .dwtag  DW_TAG_subroutine_type
    1789                            .dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
    1790                    $C$DW$117       .dwtag  DW_TAG_formal_parameter
    1791                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$143)
    1792                    
    1793                    $C$DW$118       .dwtag  DW_TAG_formal_parameter
    1794                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$144)
    1795                    
    1796                            .dwendtag $C$DW$T$145
    1797                    
    1798                    $C$DW$T$146     .dwtag  DW_TAG_pointer_type
