TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Nov 28 13:34:36 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/StartUp/osaltasks.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\sensor_cc1350lp
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    4267                            .dwattr $C$DW$433, DW_AT_const_value(0x08)
    4268                            .dwattr $C$DW$433, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4269                            .dwattr $C$DW$433, DW_AT_decl_line(0xa8)
    4270                            .dwattr $C$DW$433, DW_AT_decl_column(0x05)
    4271                    
    4272                    $C$DW$434       .dwtag  DW_TAG_enumerator
    4273                            .dwattr $C$DW$434, DW_AT_name("FAPI_VALIDATE_SECTOR")
    4274                            .dwattr $C$DW$434, DW_AT_const_value(0x0e)
    4275                            .dwattr $C$DW$434, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4276                            .dwattr $C$DW$434, DW_AT_decl_line(0xa9)
    4277                            .dwattr $C$DW$434, DW_AT_decl_column(0x05)
    4278                    
    4279                    $C$DW$435       .dwtag  DW_TAG_enumerator
    4280                            .dwattr $C$DW$435, DW_AT_name("FAPI_CLEAR_STATUS")
    4281                            .dwattr $C$DW$435, DW_AT_const_value(0x10)
    4282                            .dwattr $C$DW$435, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4283                            .dwattr $C$DW$435, DW_AT_decl_line(0xaa)
    4284                            .dwattr $C$DW$435, DW_AT_decl_column(0x05)
    4285                    
    4286                    $C$DW$436       .dwtag  DW_TAG_enumerator
    4287                            .dwattr $C$DW$436, DW_AT_name("FAPI_PROGRAM_RESUME")
    4288                            .dwattr $C$DW$436, DW_AT_const_value(0x14)
    4289                            .dwattr $C$DW$436, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4290                            .dwattr $C$DW$436, DW_AT_decl_line(0xab)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   79

    4291                            .dwattr $C$DW$436, DW_AT_decl_column(0x05)
    4292                    
    4293                    $C$DW$437       .dwtag  DW_TAG_enumerator
    4294                            .dwattr $C$DW$437, DW_AT_name("FAPI_ERASE_RESUME")
    4295                            .dwattr $C$DW$437, DW_AT_const_value(0x16)
    4296                            .dwattr $C$DW$437, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4297                            .dwattr $C$DW$437, DW_AT_decl_line(0xac)
    4298                            .dwattr $C$DW$437, DW_AT_decl_column(0x05)
    4299                    
    4300                    $C$DW$438       .dwtag  DW_TAG_enumerator
    4301                            .dwattr $C$DW$438, DW_AT_name("FAPI_CLEAR_MORE")
    4302                            .dwattr $C$DW$438, DW_AT_const_value(0x18)
    4303                            .dwattr $C$DW$438, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4304                            .dwattr $C$DW$438, DW_AT_decl_line(0xad)
    4305                            .dwattr $C$DW$438, DW_AT_decl_column(0x05)
    4306                    
    4307                    $C$DW$439       .dwtag  DW_TAG_enumerator
    4308                            .dwattr $C$DW$439, DW_AT_name("FAPI_PROGRAM_SECTOR")
    4309                            .dwattr $C$DW$439, DW_AT_const_value(0x20)
    4310                            .dwattr $C$DW$439, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4311                            .dwattr $C$DW$439, DW_AT_decl_line(0xae)
    4312                            .dwattr $C$DW$439, DW_AT_decl_column(0x05)
    4313                    
    4314                    $C$DW$440       .dwtag  DW_TAG_enumerator
    4315                            .dwattr $C$DW$440, DW_AT_name("FAPI_ERASE_OTP")
    4316                            .dwattr $C$DW$440, DW_AT_const_value(0x30)
    4317                            .dwattr $C$DW$440, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4318                            .dwattr $C$DW$440, DW_AT_decl_line(0xaf)
    4319                            .dwattr $C$DW$440, DW_AT_decl_column(0x05)
    4320                    
    4321                            .dwattr $C$DW$T$1084, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/device
    4322                            .dwattr $C$DW$T$1084, DW_AT_decl_line(0xa5)
    4323                            .dwattr $C$DW$T$1084, DW_AT_decl_column(0x01)
    4324                            .dwendtag $C$DW$T$1084
    4325                    
    4326                    $C$DW$T$1085    .dwtag  DW_TAG_typedef
    4327                            .dwattr $C$DW$T$1085, DW_AT_name("tFlashStateCommandsType")
    4328                            .dwattr $C$DW$T$1085, DW_AT_type(*$C$DW$T$1084)
    4329                            .dwattr $C$DW$T$1085, DW_AT_language(DW_LANG_C)
    4330                            .dwattr $C$DW$T$1085, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/device
    4331                            .dwattr $C$DW$T$1085, DW_AT_decl_line(0xb0)
    4332                            .dwattr $C$DW$T$1085, DW_AT_decl_column(0x03)
    4333                    
    4334                    
    4335                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4336                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    4337                    $C$DW$441       .dwtag  DW_TAG_member
    4338                            .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$22)
    4339                            .dwattr $C$DW$441, DW_AT_name("rfMode")
    4340                            .dwattr $C$DW$441, DW_AT_TI_symbol_name("rfMode")
    4341                            .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4342                            .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4343                            .dwattr $C$DW$441, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4344                            .dwattr $C$DW$441, DW_AT_decl_line(0x421)
    4345                            .dwattr $C$DW$441, DW_AT_decl_column(0x0d)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   80

    4346                    
    4347                    $C$DW$442       .dwtag  DW_TAG_member
    4348                            .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$24)
    4349                            .dwattr $C$DW$442, DW_AT_name("cpePatchFxn")
    4350                            .dwattr $C$DW$442, DW_AT_TI_symbol_name("cpePatchFxn")
    4351                            .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4352                            .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4353                            .dwattr $C$DW$442, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4354                            .dwattr $C$DW$442, DW_AT_decl_line(0x422)
    4355                            .dwattr $C$DW$442, DW_AT_decl_column(0x0c)
    4356                    
    4357                    $C$DW$443       .dwtag  DW_TAG_member
    4358                            .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$24)
    4359                            .dwattr $C$DW$443, DW_AT_name("mcePatchFxn")
    4360                            .dwattr $C$DW$443, DW_AT_TI_symbol_name("mcePatchFxn")
    4361                            .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4362                            .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4363                            .dwattr $C$DW$443, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4364                            .dwattr $C$DW$443, DW_AT_decl_line(0x423)
    4365                            .dwattr $C$DW$443, DW_AT_decl_column(0x0c)
    4366                    
    4367                    $C$DW$444       .dwtag  DW_TAG_member
    4368                            .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$24)
    4369                            .dwattr $C$DW$444, DW_AT_name("rfePatchFxn")
    4370                            .dwattr $C$DW$444, DW_AT_TI_symbol_name("rfePatchFxn")
    4371                            .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4372                            .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4373                            .dwattr $C$DW$444, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4374                            .dwattr $C$DW$444, DW_AT_decl_line(0x424)
    4375                            .dwattr $C$DW$444, DW_AT_decl_column(0x0c)
    4376                    
    4377                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4378                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x420)
    4379                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    4380                            .dwendtag $C$DW$T$25
    4381                    
    4382                    $C$DW$T$38      .dwtag  DW_TAG_typedef
    4383                            .dwattr $C$DW$T$38, DW_AT_name("RF_Mode")
    4384                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$25)
    4385                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4386                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4387                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x425)
    4388                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
    4389                    
    4390                    $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    4391                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    4392                            .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
    4393                    
    4394                    
    4395                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4396                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    4397                    $C$DW$445       .dwtag  DW_TAG_member
    4398                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$27)
    4399                            .dwattr $C$DW$445, DW_AT_name("rawValue")
    4400                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("rawValue")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   81

    4401                            .dwattr $C$DW$445, DW_AT_bit_offset(0x0a)
    4402                            .dwattr $C$DW$445, DW_AT_bit_size(0x16)
    4403                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4404                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4405                            .dwattr $C$DW$445, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4406                            .dwattr $C$DW$445, DW_AT_decl_line(0x3d6)
    4407                            .dwattr $C$DW$445, DW_AT_decl_column(0x0e)
    4408                    
    4409                    $C$DW$446       .dwtag  DW_TAG_member
    4410                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$27)
    4411                            .dwattr $C$DW$446, DW_AT_name("__dummy")
    4412                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("__dummy")
    4413                            .dwattr $C$DW$446, DW_AT_bit_offset(0x01)
    4414                            .dwattr $C$DW$446, DW_AT_bit_size(0x09)
    4415                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4416                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4417                            .dwattr $C$DW$446, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4418                            .dwattr $C$DW$446, DW_AT_decl_line(0x3da)
    4419                            .dwattr $C$DW$446, DW_AT_decl_column(0x0e)
    4420                    
    4421                    $C$DW$447       .dwtag  DW_TAG_member
    4422                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$27)
    4423                            .dwattr $C$DW$447, DW_AT_name("paType")
    4424                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("paType")
    4425                            .dwattr $C$DW$447, DW_AT_bit_offset(0x00)
    4426                            .dwattr $C$DW$447, DW_AT_bit_size(0x01)
    4427                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4428                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4429                            .dwattr $C$DW$447, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4430                            .dwattr $C$DW$447, DW_AT_decl_line(0x3db)
    4431                            .dwattr $C$DW$447, DW_AT_decl_column(0x0e)
    4432                    
    4433                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4434                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x3d5)
    4435                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    4436                            .dwendtag $C$DW$T$28
    4437                    
    4438                    $C$DW$T$31      .dwtag  DW_TAG_typedef
    4439                            .dwattr $C$DW$T$31, DW_AT_name("RF_TxPowerTable_Value")
    4440                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    4441                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    4442                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4443                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x3df)
    4444                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    4445                    
    4446                    
    4447                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4448                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x05)
    4449                    $C$DW$448       .dwtag  DW_TAG_member
    4450                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$30)
    4451                            .dwattr $C$DW$448, DW_AT_name("power")
    4452                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("power")
    4453                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4454                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4455                            .dwattr $C$DW$448, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   82

    4456                            .dwattr $C$DW$448, DW_AT_decl_line(0x3f5)
    4457                            .dwattr $C$DW$448, DW_AT_decl_column(0x0c)
    4458                    
    4459                    $C$DW$449       .dwtag  DW_TAG_member
    4460                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$31)
    4461                            .dwattr $C$DW$449, DW_AT_name("value")
    4462                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("value")
    4463                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4464                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4465                            .dwattr $C$DW$449, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4466                            .dwattr $C$DW$449, DW_AT_decl_line(0x3f8)
    4467                            .dwattr $C$DW$449, DW_AT_decl_column(0x1b)
    4468                    
    4469                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4470                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x3f4)
    4471                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    4472                            .dwendtag $C$DW$T$32
    4473                    
    4474                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    4475                            .dwattr $C$DW$T$33, DW_AT_name("RF_TxPowerTable_Entry")
    4476                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4477                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4478                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4479                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x3f9)
    4480                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x1b)
    4481                    
    4482                    $C$DW$T$34      .dwtag  DW_TAG_const_type
    4483                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4484                    
    4485                    $C$DW$T$35      .dwtag  DW_TAG_typedef
    4486                            .dwattr $C$DW$T$35, DW_AT_name("macTxPwrVal_t")
    4487                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4488                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4489                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/
    4490                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x144)
    4491                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x25)
    4492                    
    4493                    $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    4494                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    4495                            .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    4496                    
    4497                    
    4498                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4499                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    4500                    $C$DW$450       .dwtag  DW_TAG_member
    4501                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$36)
    4502                            .dwattr $C$DW$450, DW_AT_name("pTxPwrVals")
    4503                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("pTxPwrVals")
    4504                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4505                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4506                            .dwattr $C$DW$450, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    4507                            .dwattr $C$DW$450, DW_AT_decl_line(0x148)
    4508                            .dwattr $C$DW$450, DW_AT_decl_column(0x12)
    4509                    
    4510                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   83

    4511                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x147)
    4512                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    4513                            .dwendtag $C$DW$T$37
    4514                    
    4515                    $C$DW$T$41      .dwtag  DW_TAG_const_type
    4516                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$37)
    4517                    
    4518                    $C$DW$T$42      .dwtag  DW_TAG_typedef
    4519                            .dwattr $C$DW$T$42, DW_AT_name("macTxPwrTbl_t")
    4520                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4521                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4522                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/
    4523                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x149)
    4524                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
    4525                    
    4526                    $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4527                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4528                            .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    4529                    
    4530                    
    4531                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    4532                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x30)
    4533                    $C$DW$451       .dwtag  DW_TAG_member
    4534                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$27)
    4535                            .dwattr $C$DW$451, DW_AT_name("getHwRevision")
    4536                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("getHwRevision")
    4537                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4538                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4539                            .dwattr $C$DW$451, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    4540                            .dwattr $C$DW$451, DW_AT_decl_line(0x155)
    4541                            .dwattr $C$DW$451, DW_AT_decl_column(0x1c)
    4542                    
    4543                    $C$DW$452       .dwtag  DW_TAG_member
    4544                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$39)
    4545                            .dwattr $C$DW$452, DW_AT_name("pRfPatchTable")
    4546                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("pRfPatchTable")
    4547                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4548                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4549                            .dwattr $C$DW$452, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    4550                            .dwattr $C$DW$452, DW_AT_decl_line(0x156)
    4551                            .dwattr $C$DW$452, DW_AT_decl_column(0x1d)
    4552                    
    4553                    $C$DW$453       .dwtag  DW_TAG_member
    4554                            .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$40)
    4555                            .dwattr $C$DW$453, DW_AT_name("pRfDrvTblPtr")
    4556                            .dwattr $C$DW$453, DW_AT_TI_symbol_name("pRfDrvTblPtr")
    4557                            .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4558                            .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4559                            .dwattr $C$DW$453, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    4560                            .dwattr $C$DW$453, DW_AT_decl_line(0x157)
    4561                            .dwattr $C$DW$453, DW_AT_decl_column(0x1d)
    4562                    
    4563                    $C$DW$454       .dwtag  DW_TAG_member
    4564                            .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$40)
    4565                            .dwattr $C$DW$454, DW_AT_name("pCryptoDrvTblPtr")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   84

    4566                            .dwattr $C$DW$454, DW_AT_TI_symbol_name("pCryptoDrvTblPtr")
    4567                            .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4568                            .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4569                            .dwattr $C$DW$454, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    4570                            .dwattr $C$DW$454, DW_AT_decl_line(0x158)
    4571                            .dwattr $C$DW$454, DW_AT_decl_column(0x1d)
    4572                    
    4573                    $C$DW$455       .dwtag  DW_TAG_member
    4574                            .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$43)
    4575                            .dwattr $C$DW$455, DW_AT_name("pTxPwrTbl")
    4576                            .dwattr $C$DW$455, DW_AT_TI_symbol_name("pTxPwrTbl")
    4577                            .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4578                            .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4579                            .dwattr $C$DW$455, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    4580                            .dwattr $C$DW$455, DW_AT_decl_line(0x159)
    4581                            .dwattr $C$DW$455, DW_AT_decl_column(0x20)
    4582                    
    4583                    $C$DW$456       .dwtag  DW_TAG_member
    4584                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$44)
    4585                            .dwattr $C$DW$456, DW_AT_name("pOverrides")
    4586                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("pOverrides")
    4587                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4588                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4589                            .dwattr $C$DW$456, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    4590                            .dwattr $C$DW$456, DW_AT_decl_line(0x15a)
    4591                            .dwattr $C$DW$456, DW_AT_decl_column(0x1e)
    4592                    
    4593                    $C$DW$457       .dwtag  DW_TAG_member
    4594                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$45)
    4595                            .dwattr $C$DW$457, DW_AT_name("pLoDivider")
    4596                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("pLoDivider")
    4597                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4598                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4599                            .dwattr $C$DW$457, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    4600                            .dwattr $C$DW$457, DW_AT_decl_line(0x15b)
    4601                            .dwattr $C$DW$457, DW_AT_decl_column(0x1d)
    4602                    
    4603                    $C$DW$458       .dwtag  DW_TAG_member
    4604                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$22)
    4605                            .dwattr $C$DW$458, DW_AT_name("rfFeModeBias")
    4606                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("rfFeModeBias")
    4607                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4608                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4609                            .dwattr $C$DW$458, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    4610                            .dwattr $C$DW$458, DW_AT_decl_line(0x15c)
    4611                            .dwattr $C$DW$458, DW_AT_decl_column(0x1c)
    4612                    
    4613                    $C$DW$459       .dwtag  DW_TAG_member
    4614                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$22)
    4615                            .dwattr $C$DW$459, DW_AT_name("phyId")
    4616                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("phyId")
    4617                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4618                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4619                            .dwattr $C$DW$459, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    4620                            .dwattr $C$DW$459, DW_AT_decl_line(0x15d)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   85

    4621                            .dwattr $C$DW$459, DW_AT_decl_column(0x1c)
    4622                    
    4623                    $C$DW$460       .dwtag  DW_TAG_member
    4624                            .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$22)
    4625                            .dwattr $C$DW$460, DW_AT_name("last")
    4626                            .dwattr $C$DW$460, DW_AT_TI_symbol_name("last")
    4627                            .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4628                            .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4629                            .dwattr $C$DW$460, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    4630                            .dwattr $C$DW$460, DW_AT_decl_line(0x15e)
    4631                            .dwattr $C$DW$460, DW_AT_decl_column(0x1c)
    4632                    
    4633                    $C$DW$461       .dwtag  DW_TAG_member
    4634                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$48)
    4635                            .dwattr $C$DW$461, DW_AT_name("pSetRE")
    4636                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("pSetRE")
    4637                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4638                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4639                            .dwattr $C$DW$461, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    4640                            .dwattr $C$DW$461, DW_AT_decl_line(0x15f)
    4641                            .dwattr $C$DW$461, DW_AT_decl_column(0x1c)
    4642                    
    4643                    $C$DW$462       .dwtag  DW_TAG_member
    4644                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$49)
    4645                            .dwattr $C$DW$462, DW_AT_name("pAssertFP")
    4646                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("pAssertFP")
    4647                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4648                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4649                            .dwattr $C$DW$462, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    4650                            .dwattr $C$DW$462, DW_AT_decl_line(0x160)
    4651                            .dwattr $C$DW$462, DW_AT_decl_column(0x1c)
    4652                    
    4653                    $C$DW$463       .dwtag  DW_TAG_member
    4654                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$52)
    4655                            .dwattr $C$DW$463, DW_AT_name("pAntSwitchFP")
    4656                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("pAntSwitchFP")
    4657                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4658                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4659                            .dwattr $C$DW$463, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    4660                            .dwattr $C$DW$463, DW_AT_decl_line(0x161)
    4661                            .dwattr $C$DW$463, DW_AT_decl_column(0x1c)
    4662                    
    4663                    $C$DW$464       .dwtag  DW_TAG_member
    4664                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$53)
    4665                            .dwattr $C$DW$464, DW_AT_name("pAntPwrFP")
    4666                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("pAntPwrFP")
    4667                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4668                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4669                            .dwattr $C$DW$464, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/m
    4670                            .dwattr $C$DW$464, DW_AT_decl_line(0x162)
    4671                            .dwattr $C$DW$464, DW_AT_decl_column(0x1c)
    4672                    
    4673                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/
    4674                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x154)
    4675                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   86

    4676                            .dwendtag $C$DW$T$54
    4677                    
    4678                    $C$DW$T$1087    .dwtag  DW_TAG_typedef
    4679                            .dwattr $C$DW$T$1087, DW_AT_name("macUserCfg_t")
    4680                            .dwattr $C$DW$T$1087, DW_AT_type(*$C$DW$T$54)
    4681                            .dwattr $C$DW$T$1087, DW_AT_language(DW_LANG_C)
    4682                            .dwattr $C$DW$T$1087, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Applicatio
    4683                            .dwattr $C$DW$T$1087, DW_AT_decl_line(0x163)
    4684                            .dwattr $C$DW$T$1087, DW_AT_decl_column(0x03)
    4685                    
    4686                    $C$DW$T$1088    .dwtag  DW_TAG_pointer_type
    4687                            .dwattr $C$DW$T$1088, DW_AT_type(*$C$DW$T$1087)
    4688                            .dwattr $C$DW$T$1088, DW_AT_address_class(0x20)
    4689                    
    4690                    
    4691                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    4692                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x10)
    4693                    $C$DW$465       .dwtag  DW_TAG_member
    4694                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$14)
    4695                            .dwattr $C$DW$465, DW_AT_name("__max_align1")
    4696                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("__max_align1")
    4697                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4698                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4699                            .dwattr $C$DW$465, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4700                            .dwattr $C$DW$465, DW_AT_decl_line(0x70)
    4701                            .dwattr $C$DW$465, DW_AT_decl_column(0x0c)
    4702                    
    4703                    $C$DW$466       .dwtag  DW_TAG_member
    4704                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$18)
    4705                            .dwattr $C$DW$466, DW_AT_name("__max_align2")
    4706                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("__max_align2")
    4707                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4708                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4709                            .dwattr $C$DW$466, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4710                            .dwattr $C$DW$466, DW_AT_decl_line(0x71)
    4711                            .dwattr $C$DW$466, DW_AT_decl_column(0x0e)
    4712                    
    4713                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    4714                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x6f)
    4715                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    4716                            .dwendtag $C$DW$T$55
    4717                    
    4718                    $C$DW$T$1089    .dwtag  DW_TAG_typedef
    4719                            .dwattr $C$DW$T$1089, DW_AT_name("__max_align_t")
    4720                            .dwattr $C$DW$T$1089, DW_AT_type(*$C$DW$T$55)
    4721                            .dwattr $C$DW$T$1089, DW_AT_language(DW_LANG_C)
    4722                            .dwattr $C$DW$T$1089, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/includ
    4723                            .dwattr $C$DW$T$1089, DW_AT_decl_line(0x72)
    4724                            .dwattr $C$DW$T$1089, DW_AT_decl_column(0x03)
    4725                    
    4726                    
    4727                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    4728                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x08)
    4729                    $C$DW$467       .dwtag  DW_TAG_member
    4730                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$10)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   87

    4731                            .dwattr $C$DW$467, DW_AT_name("quot")
    4732                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("quot")
    4733                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4734                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4735                            .dwattr $C$DW$467, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4736                            .dwattr $C$DW$467, DW_AT_decl_line(0x49)
    4737                            .dwattr $C$DW$467, DW_AT_decl_column(0x16)
    4738                    
    4739                    $C$DW$468       .dwtag  DW_TAG_member
    4740                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$10)
    4741                            .dwattr $C$DW$468, DW_AT_name("rem")
    4742                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("rem")
    4743                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4744                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4745                            .dwattr $C$DW$468, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4746                            .dwattr $C$DW$468, DW_AT_decl_line(0x49)
    4747                            .dwattr $C$DW$468, DW_AT_decl_column(0x1c)
    4748                    
    4749                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    4750                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x49)
    4751                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x10)
    4752                            .dwendtag $C$DW$T$56
    4753                    
    4754                    $C$DW$T$1090    .dwtag  DW_TAG_typedef
    4755                            .dwattr $C$DW$T$1090, DW_AT_name("div_t")
    4756                            .dwattr $C$DW$T$1090, DW_AT_type(*$C$DW$T$56)
    4757                            .dwattr $C$DW$T$1090, DW_AT_language(DW_LANG_C)
    4758                            .dwattr $C$DW$T$1090, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/includ
    4759                            .dwattr $C$DW$T$1090, DW_AT_decl_line(0x49)
    4760                            .dwattr $C$DW$T$1090, DW_AT_decl_column(0x23)
    4761                    
    4762                    
    4763                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    4764                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x08)
    4765                    $C$DW$469       .dwtag  DW_TAG_member
    4766                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$10)
    4767                            .dwattr $C$DW$469, DW_AT_name("quot")
    4768                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("quot")
    4769                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4770                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4771                            .dwattr $C$DW$469, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4772                            .dwattr $C$DW$469, DW_AT_decl_line(0x4e)
    4773                            .dwattr $C$DW$469, DW_AT_decl_column(0x16)
    4774                    
    4775                    $C$DW$470       .dwtag  DW_TAG_member
    4776                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$10)
    4777                            .dwattr $C$DW$470, DW_AT_name("rem")
    4778                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("rem")
    4779                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4780                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4781                            .dwattr $C$DW$470, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4782                            .dwattr $C$DW$470, DW_AT_decl_line(0x4e)
    4783                            .dwattr $C$DW$470, DW_AT_decl_column(0x1c)
    4784                    
    4785                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   88

    4786                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x4e)
    4787                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x10)
    4788                            .dwendtag $C$DW$T$57
    4789                    
    4790                    $C$DW$T$1091    .dwtag  DW_TAG_typedef
    4791                            .dwattr $C$DW$T$1091, DW_AT_name("ldiv_t")
    4792                            .dwattr $C$DW$T$1091, DW_AT_type(*$C$DW$T$57)
    4793                            .dwattr $C$DW$T$1091, DW_AT_language(DW_LANG_C)
    4794                            .dwattr $C$DW$T$1091, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/includ
    4795                            .dwattr $C$DW$T$1091, DW_AT_decl_line(0x4e)
    4796                            .dwattr $C$DW$T$1091, DW_AT_decl_column(0x23)
    4797                    
    4798                    
    4799                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    4800                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
    4801                    $C$DW$471       .dwtag  DW_TAG_member
    4802                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$14)
    4803                            .dwattr $C$DW$471, DW_AT_name("quot")
    4804                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("quot")
    4805                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4806                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4807                            .dwattr $C$DW$471, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4808                            .dwattr $C$DW$471, DW_AT_decl_line(0x56)
    4809                            .dwattr $C$DW$471, DW_AT_decl_column(0x1c)
    4810                    
    4811                    $C$DW$472       .dwtag  DW_TAG_member
    4812                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$14)
    4813                            .dwattr $C$DW$472, DW_AT_name("rem")
    4814                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("rem")
    4815                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4816                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4817                            .dwattr $C$DW$472, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4818                            .dwattr $C$DW$472, DW_AT_decl_line(0x56)
    4819                            .dwattr $C$DW$472, DW_AT_decl_column(0x22)
    4820                    
    4821                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    4822                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x56)
    4823                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x10)
    4824                            .dwendtag $C$DW$T$58
    4825                    
    4826                    $C$DW$T$1092    .dwtag  DW_TAG_typedef
    4827                            .dwattr $C$DW$T$1092, DW_AT_name("lldiv_t")
    4828                            .dwattr $C$DW$T$1092, DW_AT_type(*$C$DW$T$58)
    4829                            .dwattr $C$DW$T$1092, DW_AT_language(DW_LANG_C)
    4830                            .dwattr $C$DW$T$1092, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/includ
    4831                            .dwattr $C$DW$T$1092, DW_AT_decl_line(0x56)
    4832                            .dwattr $C$DW$T$1092, DW_AT_decl_column(0x29)
    4833                    
    4834                    
    4835                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    4836                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x08)
    4837                    $C$DW$473       .dwtag  DW_TAG_member
    4838                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$61)
    4839                            .dwattr $C$DW$473, DW_AT_name("pointerStack")
    4840                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("pointerStack")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   89

    4841                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4842                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4843                            .dwattr $C$DW$473, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4844                            .dwattr $C$DW$473, DW_AT_decl_line(0x3f5)
    4845                            .dwattr $C$DW$473, DW_AT_decl_column(0x16)
    4846                    
    4847                    $C$DW$474       .dwtag  DW_TAG_member
    4848                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$62)
    4849                            .dwattr $C$DW$474, DW_AT_name("directAPI")
    4850                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("directAPI")
    4851                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4852                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4853                            .dwattr $C$DW$474, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4854                            .dwattr $C$DW$474, DW_AT_decl_line(0x3f6)
    4855                            .dwattr $C$DW$474, DW_AT_decl_column(0x15)
    4856                    
    4857                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4858                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x3f4)
    4859                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
    4860                            .dwendtag $C$DW$T$63
    4861                    
    4862                    $C$DW$T$65      .dwtag  DW_TAG_typedef
    4863                            .dwattr $C$DW$T$65, DW_AT_name("icall_directAPIMsg_t")
    4864                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$63)
    4865                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    4866                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4867                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x3f7)
    4868                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    4869                    
    4870                    
    4871                    $C$DW$T$66      .dwtag  DW_TAG_structure_type
    4872                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x14)
    4873                    $C$DW$475       .dwtag  DW_TAG_member
    4874                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$64)
    4875                            .dwattr $C$DW$475, DW_AT_name("hdr")
    4876                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("hdr")
    4877                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4878                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4879                            .dwattr $C$DW$475, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4880                            .dwattr $C$DW$475, DW_AT_decl_line(0x3fb)
    4881                            .dwattr $C$DW$475, DW_AT_decl_column(0x10)
    4882                    
    4883                    $C$DW$476       .dwtag  DW_TAG_member
    4884                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$65)
    4885                            .dwattr $C$DW$476, DW_AT_name("msg")
    4886                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("msg")
    4887                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4888                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4889                            .dwattr $C$DW$476, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4890                            .dwattr $C$DW$476, DW_AT_decl_line(0x3fc)
    4891                            .dwattr $C$DW$476, DW_AT_decl_column(0x1a)
    4892                    
    4893                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4894                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x3fa)
    4895                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x01)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   90

    4896                            .dwendtag $C$DW$T$66
    4897                    
    4898                    $C$DW$T$1093    .dwtag  DW_TAG_typedef
    4899                            .dwattr $C$DW$T$1093, DW_AT_name("icallLiteMsg_t")
    4900                            .dwattr $C$DW$T$1093, DW_AT_type(*$C$DW$T$66)
    4901                            .dwattr $C$DW$T$1093, DW_AT_language(DW_LANG_C)
    4902                            .dwattr $C$DW$T$1093, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    4903                            .dwattr $C$DW$T$1093, DW_AT_decl_line(0x3fd)
    4904                            .dwattr $C$DW$T$1093, DW_AT_decl_column(0x03)
    4905                    
    4906                    
    4907                    $C$DW$T$67      .dwtag  DW_TAG_structure_type
    4908                            .dwattr $C$DW$T$67, DW_AT_byte_size(0x0a)
    4909                    $C$DW$477       .dwtag  DW_TAG_member
    4910                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$494)
    4911                            .dwattr $C$DW$477, DW_AT_name("addr")
    4912                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("addr")
    4913                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4914                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4915                            .dwattr $C$DW$477, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/S
    4916                            .dwattr $C$DW$477, DW_AT_decl_line(0x55)
    4917                            .dwattr $C$DW$477, DW_AT_decl_column(0x05)
    4918                    
    4919                    $C$DW$478       .dwtag  DW_TAG_member
    4920                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$22)
    4921                            .dwattr $C$DW$478, DW_AT_name("addrMode")
    4922                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("addrMode")
    4923                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4924                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4925                            .dwattr $C$DW$478, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/S
    4926                            .dwattr $C$DW$478, DW_AT_decl_line(0x56)
    4927                            .dwattr $C$DW$478, DW_AT_decl_column(0x13)
    4928                    
    4929                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application/
    4930                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x50)
    4931                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x01)
    4932                            .dwendtag $C$DW$T$67
    4933                    
    4934                    $C$DW$T$386     .dwtag  DW_TAG_typedef
    4935                            .dwattr $C$DW$T$386, DW_AT_name("sAddr_t")
    4936                            .dwattr $C$DW$T$386, DW_AT_type(*$C$DW$T$67)
    4937                            .dwattr $C$DW$T$386, DW_AT_language(DW_LANG_C)
    4938                            .dwattr $C$DW$T$386, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/sensor_cc1350lp/Application
    4939                            .dwattr $C$DW$T$386, DW_AT_decl_line(0x57)
    4940                            .dwattr $C$DW$T$386, DW_AT_decl_column(0x03)
    4941                    
    4942                    $C$DW$T$442     .dwtag  DW_TAG_pointer_type
    4943                            .dwattr $C$DW$T$442, DW_AT_type(*$C$DW$T$386)
    4944                            .dwattr $C$DW$T$442, DW_AT_address_class(0x20)
    4945                    
    4946                    
    4947                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4948                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    4949                    $C$DW$479       .dwtag  DW_TAG_member
    4950                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$497)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   91

    4951                            .dwattr $C$DW$479, DW_AT_name("addr")
    4952                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("addr")
    4953                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4954                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4955                            .dwattr $C$DW$479, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4956                            .dwattr $C$DW$479, DW_AT_decl_line(0x139)
    4957                            .dwattr $C$DW$479, DW_AT_decl_column(0x05)
    4958                    
    4959                    $C$DW$480       .dwtag  DW_TAG_member
    4960                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$69)
    4961                            .dwattr $C$DW$480, DW_AT_name("addrMode")
    4962                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("addrMode")
    4963                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4964                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4965                            .dwattr $C$DW$480, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4966                            .dwattr $C$DW$480, DW_AT_decl_line(0x13a)
    4967                            .dwattr $C$DW$480, DW_AT_decl_column(0x08)
    4968                    
    4969                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4970                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x134)
    4971                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x01)
    4972                            .dwendtag $C$DW$T$70
    4973                    
    4974                    $C$DW$T$1094    .dwtag  DW_TAG_typedef
    4975                            .dwattr $C$DW$T$1094, DW_AT_name("zAddrType_t")
    4976                            .dwattr $C$DW$T$1094, DW_AT_type(*$C$DW$T$70)
    4977                            .dwattr $C$DW$T$1094, DW_AT_language(DW_LANG_C)
    4978                            .dwattr $C$DW$T$1094, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    4979                            .dwattr $C$DW$T$1094, DW_AT_decl_line(0x13b)
    4980                            .dwattr $C$DW$T$1094, DW_AT_decl_column(0x03)
    4981                    
    4982                    
    4983                    $C$DW$T$73      .dwtag  DW_TAG_structure_type
    4984                            .dwattr $C$DW$T$73, DW_AT_byte_size(0x0c)
    4985                    $C$DW$481       .dwtag  DW_TAG_member
    4986                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$68)
    4987                            .dwattr $C$DW$481, DW_AT_name("txCounter")
    4988                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("txCounter")
    4989                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4990                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4991                            .dwattr $C$DW$481, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4992                            .dwattr $C$DW$481, DW_AT_decl_line(0x198)
    4993                            .dwattr $C$DW$481, DW_AT_decl_column(0x0a)
    4994                    
    4995                    $C$DW$482       .dwtag  DW_TAG_member
    4996                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$68)
    4997                            .dwattr $C$DW$482, DW_AT_name("txCost")
    4998                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("txCost")
    4999                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5000                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5001                            .dwattr $C$DW$482, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5002                            .dwattr $C$DW$482, DW_AT_decl_line(0x199)
    5003                            .dwattr $C$DW$482, DW_AT_decl_column(0x0a)
    5004                    
    5005                    $C$DW$483       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   92

    5006                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$68)
    5007                            .dwattr $C$DW$483, DW_AT_name("rxLqi")
    5008                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("rxLqi")
    5009                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5010                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5011                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5012                            .dwattr $C$DW$483, DW_AT_decl_line(0x19b)
    5013                            .dwattr $C$DW$483, DW_AT_decl_column(0x0a)
    5014                    
    5015                    $C$DW$484       .dwtag  DW_TAG_member
    5016                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$68)
    5017                            .dwattr $C$DW$484, DW_AT_name("inKeySeqNum")
    5018                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("inKeySeqNum")
    5019                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5020                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5021                            .dwattr $C$DW$484, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5022                            .dwattr $C$DW$484, DW_AT_decl_line(0x19d)
    5023                            .dwattr $C$DW$484, DW_AT_decl_column(0x0a)
    5024                    
    5025                    $C$DW$485       .dwtag  DW_TAG_member
    5026                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$71)
    5027                            .dwattr $C$DW$485, DW_AT_name("inFrmCntr")
    5028                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("inFrmCntr")
    5029                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5030                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5031                            .dwattr $C$DW$485, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5032                            .dwattr $C$DW$485, DW_AT_decl_line(0x19e)
    5033                            .dwattr $C$DW$485, DW_AT_decl_column(0x0a)
    5034                    
    5035                    $C$DW$486       .dwtag  DW_TAG_member
    5036                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$72)
    5037                            .dwattr $C$DW$486, DW_AT_name("txFailure")
    5038                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("txFailure")
    5039                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5040                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5041                            .dwattr $C$DW$486, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5042                            .dwattr $C$DW$486, DW_AT_decl_line(0x19f)
    5043                            .dwattr $C$DW$486, DW_AT_decl_column(0x0a)
    5044                    
    5045                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    5046                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x197)
    5047                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x01)
    5048                            .dwendtag $C$DW$T$73
    5049                    
    5050                    $C$DW$T$1095    .dwtag  DW_TAG_typedef
    5051                            .dwattr $C$DW$T$1095, DW_AT_name("linkInfo_t")
    5052                            .dwattr $C$DW$T$1095, DW_AT_type(*$C$DW$T$73)
    5053                            .dwattr $C$DW$T$1095, DW_AT_language(DW_LANG_C)
    5054                            .dwattr $C$DW$T$1095, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    5055                            .dwattr $C$DW$T$1095, DW_AT_decl_line(0x1a0)
    5056                            .dwattr $C$DW$T$1095, DW_AT_decl_column(0x03)
    5057                    
    5058                    
    5059                    $C$DW$T$74      .dwtag  DW_TAG_structure_type
    5060                            .dwattr $C$DW$T$74, DW_AT_byte_size(0x02)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   93

    5061                    $C$DW$487       .dwtag  DW_TAG_member
    5062                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$68)
    5063                            .dwattr $C$DW$487, DW_AT_name("event")
    5064                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("event")
    5065                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5066                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5067                            .dwattr $C$DW$487, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5068                            .dwattr $C$DW$487, DW_AT_decl_line(0x79)
    5069                            .dwattr $C$DW$487, DW_AT_decl_column(0x0a)
    5070                    
    5071                    $C$DW$488       .dwtag  DW_TAG_member
    5072                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$68)
    5073                            .dwattr $C$DW$488, DW_AT_name("status")
    5074                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("status")
    5075                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5076                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5077                            .dwattr $C$DW$488, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5078                            .dwattr $C$DW$488, DW_AT_decl_line(0x7a)
    5079                            .dwattr $C$DW$488, DW_AT_decl_column(0x0a)
    5080                    
    5081                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    5082                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x78)
    5083                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x01)
    5084                            .dwendtag $C$DW$T$74
    5085                    
    5086                    $C$DW$T$1096    .dwtag  DW_TAG_typedef
    5087                            .dwattr $C$DW$T$1096, DW_AT_name("osal_event_hdr_t")
    5088                            .dwattr $C$DW$T$1096, DW_AT_type(*$C$DW$T$74)
    5089                            .dwattr $C$DW$T$1096, DW_AT_language(DW_LANG_C)
    5090                            .dwattr $C$DW$T$1096, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    5091                            .dwattr $C$DW$T$1096, DW_AT_decl_line(0x7b)
    5092                            .dwattr $C$DW$T$1096, DW_AT_decl_column(0x03)
    5093                    
    5094                    
    5095                    $C$DW$T$107     .dwtag  DW_TAG_structure_type
    5096                            .dwattr $C$DW$T$107, DW_AT_byte_size(0x4c)
    5097                    $C$DW$489       .dwtag  DW_TAG_member
    5098                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$77)
    5099                            .dwattr $C$DW$489, DW_AT_name("Crc32")
    5100                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("Crc32")
    5101                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5102                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5103                            .dwattr $C$DW$489, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5104                            .dwattr $C$DW$489, DW_AT_decl_line(0x76)
    5105                            .dwattr $C$DW$489, DW_AT_decl_column(0x25)
    5106                    
    5107                    $C$DW$490       .dwtag  DW_TAG_member
    5108                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$80)
    5109                            .dwattr $C$DW$490, DW_AT_name("FlashGetSize")
    5110                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("FlashGetSize")
    5111                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5112                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5113                            .dwattr $C$DW$490, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5114                            .dwattr $C$DW$490, DW_AT_decl_line(0x77)
    5115                            .dwattr $C$DW$490, DW_AT_decl_column(0x25)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   94

    5116                    
    5117                    $C$DW$491       .dwtag  DW_TAG_member
    5118                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$81)
    5119                            .dwattr $C$DW$491, DW_AT_name("GetChipId")
    5120                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("GetChipId")
    5121                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5122                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5123                            .dwattr $C$DW$491, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5124                            .dwattr $C$DW$491, DW_AT_decl_line(0x78)
    5125                            .dwattr $C$DW$491, DW_AT_decl_column(0x25)
    5126                    
    5127                    $C$DW$492       .dwtag  DW_TAG_member
    5128                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$84)
    5129                            .dwattr $C$DW$492, DW_AT_name("ReservedLocation1")
    5130                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("ReservedLocation1")
    5131                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5132                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5133                            .dwattr $C$DW$492, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5134                            .dwattr $C$DW$492, DW_AT_decl_line(0x79)
    5135                            .dwattr $C$DW$492, DW_AT_decl_column(0x25)
    5136                    
    5137                    $C$DW$493       .dwtag  DW_TAG_member
    5138                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$85)
    5139                            .dwattr $C$DW$493, DW_AT_name("ReservedLocation2")
    5140                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("ReservedLocation2")
    5141                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5142                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5143                            .dwattr $C$DW$493, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5144                            .dwattr $C$DW$493, DW_AT_decl_line(0x7a)
    5145                            .dwattr $C$DW$493, DW_AT_decl_column(0x25)
    5146                    
    5147                    $C$DW$494       .dwtag  DW_TAG_member
    5148                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$86)
    5149                            .dwattr $C$DW$494, DW_AT_name("ReservedLocation3")
    5150                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("ReservedLocation3")
    5151                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5152                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5153                            .dwattr $C$DW$494, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5154                            .dwattr $C$DW$494, DW_AT_decl_line(0x7b)
    5155                            .dwattr $C$DW$494, DW_AT_decl_column(0x25)
    5156                    
    5157                    $C$DW$495       .dwtag  DW_TAG_member
    5158                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$87)
    5159                            .dwattr $C$DW$495, DW_AT_name("ResetDevice")
    5160                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("ResetDevice")
    5161                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5162                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5163                            .dwattr $C$DW$495, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5164                            .dwattr $C$DW$495, DW_AT_decl_line(0x7c)
    5165                            .dwattr $C$DW$495, DW_AT_decl_column(0x25)
    5166                    
    5167                    $C$DW$496       .dwtag  DW_TAG_member
    5168                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$93)
    5169                            .dwattr $C$DW$496, DW_AT_name("Fletcher32")
    5170                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("Fletcher32")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   95

    5171                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5172                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5173                            .dwattr $C$DW$496, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5174                            .dwattr $C$DW$496, DW_AT_decl_line(0x7d)
    5175                            .dwattr $C$DW$496, DW_AT_decl_column(0x25)
    5176                    
    5177                    $C$DW$497       .dwtag  DW_TAG_member
    5178                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$96)
    5179                            .dwattr $C$DW$497, DW_AT_name("MinValue")
    5180                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("MinValue")
    5181                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5182                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5183                            .dwattr $C$DW$497, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5184                            .dwattr $C$DW$497, DW_AT_decl_line(0x7e)
    5185                            .dwattr $C$DW$497, DW_AT_decl_column(0x25)
    5186                    
    5187                    $C$DW$498       .dwtag  DW_TAG_member
    5188                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$97)
    5189                            .dwattr $C$DW$498, DW_AT_name("MaxValue")
    5190                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("MaxValue")
    5191                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5192                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5193                            .dwattr $C$DW$498, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5194                            .dwattr $C$DW$498, DW_AT_decl_line(0x7f)
    5195                            .dwattr $C$DW$498, DW_AT_decl_column(0x25)
    5196                    
    5197                    $C$DW$499       .dwtag  DW_TAG_member
    5198                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$98)
    5199                            .dwattr $C$DW$499, DW_AT_name("MeanValue")
    5200                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("MeanValue")
    5201                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5202                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5203                            .dwattr $C$DW$499, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5204                            .dwattr $C$DW$499, DW_AT_decl_line(0x80)
    5205                            .dwattr $C$DW$499, DW_AT_decl_column(0x25)
    5206                    
    5207                    $C$DW$500       .dwtag  DW_TAG_member
    5208                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$99)
    5209                            .dwattr $C$DW$500, DW_AT_name("StandDeviationValue")
    5210                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("StandDeviationValue")
    5211                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5212                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5213                            .dwattr $C$DW$500, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5214                            .dwattr $C$DW$500, DW_AT_decl_line(0x81)
    5215                            .dwattr $C$DW$500, DW_AT_decl_column(0x25)
    5216                    
    5217                    $C$DW$501       .dwtag  DW_TAG_member
    5218                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$100)
    5219                            .dwattr $C$DW$501, DW_AT_name("ReservedLocation4")
    5220                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("ReservedLocation4")
    5221                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    5222                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5223                            .dwattr $C$DW$501, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5224                            .dwattr $C$DW$501, DW_AT_decl_line(0x82)
    5225                            .dwattr $C$DW$501, DW_AT_decl_column(0x25)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   96

    5226                    
    5227                    $C$DW$502       .dwtag  DW_TAG_member
    5228                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$101)
    5229                            .dwattr $C$DW$502, DW_AT_name("ReservedLocation5")
    5230                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("ReservedLocation5")
    5231                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5232                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5233                            .dwattr $C$DW$502, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5234                            .dwattr $C$DW$502, DW_AT_decl_line(0x83)
    5235                            .dwattr $C$DW$502, DW_AT_decl_column(0x25)
    5236                    
    5237                    $C$DW$503       .dwtag  DW_TAG_member
    5238                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$102)
    5239                            .dwattr $C$DW$503, DW_AT_name("HFSourceSafeSwitch")
    5240                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    5241                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5242                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5243                            .dwattr $C$DW$503, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5244                            .dwattr $C$DW$503, DW_AT_decl_line(0x84)
    5245                            .dwattr $C$DW$503, DW_AT_decl_column(0x25)
    5246                    
    5247                    $C$DW$504       .dwtag  DW_TAG_member
    5248                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$103)
    5249                            .dwattr $C$DW$504, DW_AT_name("SelectCompAInput")
    5250                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("SelectCompAInput")
    5251                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5252                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    5253                            .dwattr $C$DW$504, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5254                            .dwattr $C$DW$504, DW_AT_decl_line(0x85)
    5255                            .dwattr $C$DW$504, DW_AT_decl_column(0x25)
    5256                    
    5257                    $C$DW$505       .dwtag  DW_TAG_member
    5258                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$104)
    5259                            .dwattr $C$DW$505, DW_AT_name("SelectCompARef")
    5260                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("SelectCompARef")
    5261                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5262                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5263                            .dwattr $C$DW$505, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5264                            .dwattr $C$DW$505, DW_AT_decl_line(0x86)
    5265                            .dwattr $C$DW$505, DW_AT_decl_column(0x25)
    5266                    
    5267                    $C$DW$506       .dwtag  DW_TAG_member
    5268                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$105)
    5269                            .dwattr $C$DW$506, DW_AT_name("SelectADCCompBInput")
    5270                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("SelectADCCompBInput")
    5271                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5272                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    5273                            .dwattr $C$DW$506, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5274                            .dwattr $C$DW$506, DW_AT_decl_line(0x87)
    5275                            .dwattr $C$DW$506, DW_AT_decl_column(0x25)
    5276                    
    5277                    $C$DW$507       .dwtag  DW_TAG_member
    5278                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$106)
    5279                            .dwattr $C$DW$507, DW_AT_name("SelectCompBRef")
    5280                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("SelectCompBRef")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   97

    5281                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    5282                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    5283                            .dwattr $C$DW$507, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5284                            .dwattr $C$DW$507, DW_AT_decl_line(0x88)
    5285                            .dwattr $C$DW$507, DW_AT_decl_column(0x25)
    5286                    
    5287                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    5288                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x75)
    5289                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x01)
    5290                            .dwendtag $C$DW$T$107
    5291                    
    5292                    $C$DW$T$1097    .dwtag  DW_TAG_typedef
    5293                            .dwattr $C$DW$T$1097, DW_AT_name("HARD_API_T")
    5294                            .dwattr $C$DW$T$1097, DW_AT_type(*$C$DW$T$107)
    5295                            .dwattr $C$DW$T$1097, DW_AT_language(DW_LANG_C)
    5296                            .dwattr $C$DW$T$1097, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\device
    5297                            .dwattr $C$DW$T$1097, DW_AT_decl_line(0x89)
    5298                            .dwattr $C$DW$T$1097, DW_AT_decl_column(0x03)
    5299                    
    5300                    
    5301                    $C$DW$T$110     .dwtag  DW_TAG_structure_type
    5302                            .dwattr $C$DW$T$110, DW_AT_byte_size(0x0a)
    5303                    $C$DW$508       .dwtag  DW_TAG_member
    5304                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$498)
    5305                            .dwattr $C$DW$508, DW_AT_name("addr")
    5306                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("addr")
    5307                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5308                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    5309                            .dwattr $C$DW$508, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\Application\a
    5310                            .dwattr $C$DW$508, DW_AT_decl_line(0x4db)
    5311                            .dwattr $C$DW$508, DW_AT_decl_column(0x07)
    5312                    
    5313                    $C$DW$509       .dwtag  DW_TAG_member
    5314                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$109)
    5315                            .dwattr $C$DW$509, DW_AT_name("addrMode")
    5316                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("addrMode")
    5317                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5318                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    5319                            .dwattr $C$DW$509, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\Application\a
    5320                            .dwattr $C$DW$509, DW_AT_decl_line(0x4de)
    5321                            .dwattr $C$DW$509, DW_AT_decl_column(0x17)
    5322                    
    5323                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\Application
    5324                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x4d0)
    5325                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x01)
    5326                            .dwendtag $C$DW$T$110
    5327                    
    5328                    $C$DW$T$744     .dwtag  DW_TAG_typedef
    5329                            .dwattr $C$DW$T$744, DW_AT_name("ApiMac_sAddr_t")
    5330                            .dwattr $C$DW$T$744, DW_AT_type(*$C$DW$T$110)
    5331                            .dwattr $C$DW$T$744, DW_AT_language(DW_LANG_C)
    5332                            .dwattr $C$DW$T$744, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\Application
    5333                            .dwattr $C$DW$T$744, DW_AT_decl_line(0x4df)
    5334                            .dwattr $C$DW$T$744, DW_AT_decl_column(0x03)
    5335                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   98

    5336                    
    5337                    $C$DW$T$111     .dwtag  DW_TAG_structure_type
    5338                            .dwattr $C$DW$T$111, DW_AT_byte_size(0x08)
    5339                    $C$DW$510       .dwtag  DW_TAG_member
    5340                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$27)
    5341                            .dwattr $C$DW$510, DW_AT_name("frameCounter")
    5342                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("frameCounter")
    5343                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5344                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    5345                            .dwattr $C$DW$510, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\Application\a
    5346                            .dwattr $C$DW$510, DW_AT_decl_line(0x575)
    5347                            .dwattr $C$DW$510, DW_AT_decl_column(0x1a)
    5348                    
    5349                    $C$DW$511       .dwtag  DW_TAG_member
    5350                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$89)
    5351                            .dwattr $C$DW$511, DW_AT_name("keyIdx")
    5352                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("keyIdx")
    5353                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5354                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    5355                            .dwattr $C$DW$511, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\Application\a
    5356                            .dwattr $C$DW$511, DW_AT_decl_line(0x576)
    5357                            .dwattr $C$DW$511, DW_AT_decl_column(0x1a)
    5358                    
    5359                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\Application
    5360                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x574)
    5361                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x01)
    5362                            .dwendtag $C$DW$T$111
    5363                    
    5364                    $C$DW$T$804     .dwtag  DW_TAG_typedef
    5365                            .dwattr $C$DW$T$804, DW_AT_name("ApiMac_frameCntr_t")
    5366                            .dwattr $C$DW$T$804, DW_AT_type(*$C$DW$T$111)
    5367                            .dwattr $C$DW$T$804, DW_AT_language(DW_LANG_C)
    5368                            .dwattr $C$DW$T$804, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\Application
    5369                            .dwattr $C$DW$T$804, DW_AT_decl_line(0x577)
    5370                            .dwattr $C$DW$T$804, DW_AT_decl_column(0x03)
    5371                    
    5372                    $C$DW$T$805     .dwtag  DW_TAG_pointer_type
    5373                            .dwattr $C$DW$T$805, DW_AT_type(*$C$DW$T$804)
    5374                            .dwattr $C$DW$T$805, DW_AT_address_class(0x20)
    5375                    
    5376                    
    5377                    $C$DW$T$115     .dwtag  DW_TAG_structure_type
    5378                            .dwattr $C$DW$T$115, DW_AT_byte_size(0x40)
    5379                    $C$DW$512       .dwtag  DW_TAG_member
    5380                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$113)
    5381                            .dwattr $C$DW$512, DW_AT_name("beaconType")
    5382                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("beaconType")
    5383                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5384                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    5385                            .dwattr $C$DW$512, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\Application\a
    5386                            .dwattr $C$DW$512, DW_AT_decl_line(0x886)
    5387                            .dwattr $C$DW$512, DW_AT_decl_column(0x19)
    5388                    
    5389                    $C$DW$513       .dwtag  DW_TAG_member
    5390                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$22)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:34:37 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{CC387863-0630-4850-B517-389364D5EC03} PAGE   99

    5391                            .dwattr $C$DW$513, DW_AT_name("bsn")
    5392                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("bsn")
    5393                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5394                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    5395                            .dwattr $C$DW$513, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\Application\a
    5396                            .dwattr $C$DW$513, DW_AT_decl_line(0x888)
    5397                            .dwattr $C$DW$513, DW_AT_decl_column(0x0d)
    5398                    
    5399                    $C$DW$514       .dwtag  DW_TAG_member
    5400                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$114)
    5401                            .dwattr $C$DW$514, DW_AT_name("panDesc")
    5402                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("panDesc")
    5403                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5404                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    5405                            .dwattr $C$DW$514, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\Application\a
    5406                            .dwattr $C$DW$514, DW_AT_decl_line(0x88a)
    5407                            .dwattr $C$DW$514, DW_AT_decl_column(0x16)
    5408                    
    5409                    $C$DW$515       .dwtag  DW_TAG_member
    5410                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$501)
    5411                            .dwattr $C$DW$515, DW_AT_name("beaconData")
    5412                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("beaconData")
    5413                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5414                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    5415                            .dwattr $C$DW$515, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\Application\a
    5416                            .dwattr $C$DW$515, DW_AT_decl_line(0x895)
    5417                            .dwattr $C$DW$515, DW_AT_decl_column(0x07)
    5418                    
    5419                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\Application
    5420                            .dwattr $C$DW$T$115, DW_AT_decl_line(0x884)
    5421                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x01)
    5422                            .dwendtag $C$DW$T$115
    5423                    
    5424                    $C$DW$T$658     .dwtag  DW_TAG_typedef
    5425                            .dwattr $C$DW$T$658, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    5426                            .dwattr $C$DW$T$658, DW_AT_type(*$C$DW$T$115)
    5427                            .dwattr $C$DW$T$658, DW_AT_language(DW_LANG_C)
    5428                            .dwattr $C$DW$T$658, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\sensor_cc1350lp\Application
    5429                            .dwattr $C$DW$T$658, DW_AT_decl_line(0x896)
    5430                            .dwattr $C$DW$T$658, DW_AT_decl_column(0x03)
    5431                    
    5432                    $C$DW$T$659     .dwtag  DW_TAG_pointer_type
    5433                            .dwattr $C$DW$T$659, DW_AT_type(*$C$DW$T$658)
    5434                            .dwattr $C$DW$T$659, DW_AT_address_class(0x20)
    5435                    
    5436                    
    5437                    $C$DW$T$116     .dwtag  DW_TAG_structure_type
    5438                            .dwattr $C$DW$T$116, DW_AT_byte_size(0x08)
    5439                    $C$DW$516       .dwtag  DW_TAG_member
    5440                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$45)
    5441                            .dwattr $C$DW$516, DW_AT_name("pCurrEntry")
    5442                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("pCurrEntry")
    5443                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5444                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    5445                            .dwattr $C$DW$516, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
