TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Nov 28 13:22:11 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/mac_user_config.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Adrian\workspace_v8\collector_cc1350lp\collector_cc
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    5522                            .dwattr $C$DW$468, DW_AT_decl_file("..\Application\mac_user_config.h")
    5523                            .dwattr $C$DW$468, DW_AT_decl_line(0x11d)
    5524                            .dwattr $C$DW$468, DW_AT_decl_column(0x05)
    5525                    
    5526                    $C$DW$469       .dwtag  DW_TAG_enumerator
    5527                            .dwattr $C$DW$469, DW_AT_name("MAC_RADIO_CC1352P")
    5528                            .dwattr $C$DW$469, DW_AT_const_value(0x02)
    5529                            .dwattr $C$DW$469, DW_AT_decl_file("..\Application\mac_user_config.h")
    5530                            .dwattr $C$DW$469, DW_AT_decl_line(0x11e)
    5531                            .dwattr $C$DW$469, DW_AT_decl_column(0x05)
    5532                    
    5533                    $C$DW$470       .dwtag  DW_TAG_enumerator
    5534                            .dwattr $C$DW$470, DW_AT_name("MAC_RADIO_CCXXX2")
    5535                            .dwattr $C$DW$470, DW_AT_const_value(0x00)
    5536                            .dwattr $C$DW$470, DW_AT_decl_file("..\Application\mac_user_config.h")
    5537                            .dwattr $C$DW$470, DW_AT_decl_line(0x11f)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  103

    5538                            .dwattr $C$DW$470, DW_AT_decl_column(0x05)
    5539                    
    5540                            .dwattr $C$DW$T$780, DW_AT_decl_file("..\Application\mac_user_config.h")
    5541                            .dwattr $C$DW$T$780, DW_AT_decl_line(0x118)
    5542                            .dwattr $C$DW$T$780, DW_AT_decl_column(0x01)
    5543                            .dwendtag $C$DW$T$780
    5544                    
    5545                    $C$DW$T$781     .dwtag  DW_TAG_typedef
    5546                            .dwattr $C$DW$T$781, DW_AT_name("macChipType_t")
    5547                            .dwattr $C$DW$T$781, DW_AT_type(*$C$DW$T$780)
    5548                            .dwattr $C$DW$T$781, DW_AT_language(DW_LANG_C)
    5549                            .dwattr $C$DW$T$781, DW_AT_decl_file("..\Application\mac_user_config.h")
    5550                            .dwattr $C$DW$T$781, DW_AT_decl_line(0x120)
    5551                            .dwattr $C$DW$T$781, DW_AT_decl_column(0x03)
    5552                    
    5553                    
    5554                    $C$DW$T$782     .dwtag  DW_TAG_enumeration_type
    5555                            .dwattr $C$DW$T$782, DW_AT_byte_size(0x01)
    5556                    $C$DW$471       .dwtag  DW_TAG_enumerator
    5557                            .dwattr $C$DW$471, DW_AT_name("MAC_HW_REV_21")
    5558                            .dwattr $C$DW$471, DW_AT_const_value(0x00)
    5559                            .dwattr $C$DW$471, DW_AT_decl_file("..\Application\mac_user_config.h")
    5560                            .dwattr $C$DW$471, DW_AT_decl_line(0x125)
    5561                            .dwattr $C$DW$471, DW_AT_decl_column(0x05)
    5562                    
    5563                    $C$DW$472       .dwtag  DW_TAG_enumerator
    5564                            .dwattr $C$DW$472, DW_AT_name("MAC_HW_REV_20")
    5565                            .dwattr $C$DW$472, DW_AT_const_value(0x01)
    5566                            .dwattr $C$DW$472, DW_AT_decl_file("..\Application\mac_user_config.h")
    5567                            .dwattr $C$DW$472, DW_AT_decl_line(0x126)
    5568                            .dwattr $C$DW$472, DW_AT_decl_column(0x05)
    5569                    
    5570                    $C$DW$473       .dwtag  DW_TAG_enumerator
    5571                            .dwattr $C$DW$473, DW_AT_name("MAC_HW_MAX_REVS")
    5572                            .dwattr $C$DW$473, DW_AT_const_value(0x02)
    5573                            .dwattr $C$DW$473, DW_AT_decl_file("..\Application\mac_user_config.h")
    5574                            .dwattr $C$DW$473, DW_AT_decl_line(0x127)
    5575                            .dwattr $C$DW$473, DW_AT_decl_column(0x05)
    5576                    
    5577                            .dwattr $C$DW$T$782, DW_AT_decl_file("..\Application\mac_user_config.h")
    5578                            .dwattr $C$DW$T$782, DW_AT_decl_line(0x124)
    5579                            .dwattr $C$DW$T$782, DW_AT_decl_column(0x01)
    5580                            .dwendtag $C$DW$T$782
    5581                    
    5582                    $C$DW$T$783     .dwtag  DW_TAG_typedef
    5583                            .dwattr $C$DW$T$783, DW_AT_name("macHwRevision_t")
    5584                            .dwattr $C$DW$T$783, DW_AT_type(*$C$DW$T$782)
    5585                            .dwattr $C$DW$T$783, DW_AT_language(DW_LANG_C)
    5586                            .dwattr $C$DW$T$783, DW_AT_decl_file("..\Application\mac_user_config.h")
    5587                            .dwattr $C$DW$T$783, DW_AT_decl_line(0x128)
    5588                            .dwattr $C$DW$T$783, DW_AT_decl_column(0x03)
    5589                    
    5590                    
    5591                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5592                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  104

    5593                    $C$DW$474       .dwtag  DW_TAG_member
    5594                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$22)
    5595                            .dwattr $C$DW$474, DW_AT_name("rfMode")
    5596                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("rfMode")
    5597                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5598                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    5599                            .dwattr $C$DW$474, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5600                            .dwattr $C$DW$474, DW_AT_decl_line(0x421)
    5601                            .dwattr $C$DW$474, DW_AT_decl_column(0x0d)
    5602                    
    5603                    $C$DW$475       .dwtag  DW_TAG_member
    5604                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$24)
    5605                            .dwattr $C$DW$475, DW_AT_name("cpePatchFxn")
    5606                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("cpePatchFxn")
    5607                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5608                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    5609                            .dwattr $C$DW$475, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5610                            .dwattr $C$DW$475, DW_AT_decl_line(0x422)
    5611                            .dwattr $C$DW$475, DW_AT_decl_column(0x0c)
    5612                    
    5613                    $C$DW$476       .dwtag  DW_TAG_member
    5614                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$24)
    5615                            .dwattr $C$DW$476, DW_AT_name("mcePatchFxn")
    5616                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("mcePatchFxn")
    5617                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5618                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    5619                            .dwattr $C$DW$476, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5620                            .dwattr $C$DW$476, DW_AT_decl_line(0x423)
    5621                            .dwattr $C$DW$476, DW_AT_decl_column(0x0c)
    5622                    
    5623                    $C$DW$477       .dwtag  DW_TAG_member
    5624                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$24)
    5625                            .dwattr $C$DW$477, DW_AT_name("rfePatchFxn")
    5626                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("rfePatchFxn")
    5627                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5628                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    5629                            .dwattr $C$DW$477, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5630                            .dwattr $C$DW$477, DW_AT_decl_line(0x424)
    5631                            .dwattr $C$DW$477, DW_AT_decl_column(0x0c)
    5632                    
    5633                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    5634                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x420)
    5635                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    5636                            .dwendtag $C$DW$T$25
    5637                    
    5638                    $C$DW$T$49      .dwtag  DW_TAG_typedef
    5639                            .dwattr $C$DW$T$49, DW_AT_name("RF_Mode")
    5640                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$25)
    5641                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    5642                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    5643                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x425)
    5644                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
    5645                    
    5646                    $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    5647                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  105

    5648                            .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    5649                    
    5650                    
    5651                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    5652                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    5653                    $C$DW$478       .dwtag  DW_TAG_member
    5654                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$22)
    5655                            .dwattr $C$DW$478, DW_AT_name("triggerType")
    5656                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("triggerType")
    5657                            .dwattr $C$DW$478, DW_AT_bit_offset(0x04)
    5658                            .dwattr $C$DW$478, DW_AT_bit_size(0x04)
    5659                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5660                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    5661                            .dwattr $C$DW$478, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5662                            .dwattr $C$DW$478, DW_AT_decl_line(0x7d)
    5663                            .dwattr $C$DW$478, DW_AT_decl_column(0x0f)
    5664                    
    5665                    $C$DW$479       .dwtag  DW_TAG_member
    5666                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$22)
    5667                            .dwattr $C$DW$479, DW_AT_name("bEnaCmd")
    5668                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("bEnaCmd")
    5669                            .dwattr $C$DW$479, DW_AT_bit_offset(0x03)
    5670                            .dwattr $C$DW$479, DW_AT_bit_size(0x01)
    5671                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5672                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    5673                            .dwattr $C$DW$479, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5674                            .dwattr $C$DW$479, DW_AT_decl_line(0x7e)
    5675                            .dwattr $C$DW$479, DW_AT_decl_column(0x0f)
    5676                    
    5677                    $C$DW$480       .dwtag  DW_TAG_member
    5678                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$22)
    5679                            .dwattr $C$DW$480, DW_AT_name("triggerNo")
    5680                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("triggerNo")
    5681                            .dwattr $C$DW$480, DW_AT_bit_offset(0x01)
    5682                            .dwattr $C$DW$480, DW_AT_bit_size(0x02)
    5683                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5684                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    5685                            .dwattr $C$DW$480, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5686                            .dwattr $C$DW$480, DW_AT_decl_line(0x80)
    5687                            .dwattr $C$DW$480, DW_AT_decl_column(0x0f)
    5688                    
    5689                    $C$DW$481       .dwtag  DW_TAG_member
    5690                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$22)
    5691                            .dwattr $C$DW$481, DW_AT_name("pastTrig")
    5692                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("pastTrig")
    5693                            .dwattr $C$DW$481, DW_AT_bit_offset(0x00)
    5694                            .dwattr $C$DW$481, DW_AT_bit_size(0x01)
    5695                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5696                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    5697                            .dwattr $C$DW$481, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5698                            .dwattr $C$DW$481, DW_AT_decl_line(0x81)
    5699                            .dwattr $C$DW$481, DW_AT_decl_column(0x0f)
    5700                    
    5701                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5702                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x7c)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  106

    5703                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x0b)
    5704                            .dwendtag $C$DW$T$26
    5705                    
    5706                    
    5707                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    5708                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    5709                    $C$DW$482       .dwtag  DW_TAG_member
    5710                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$22)
    5711                            .dwattr $C$DW$482, DW_AT_name("rule")
    5712                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("rule")
    5713                            .dwattr $C$DW$482, DW_AT_bit_offset(0x04)
    5714                            .dwattr $C$DW$482, DW_AT_bit_size(0x04)
    5715                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5716                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5717                            .dwattr $C$DW$482, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5718                            .dwattr $C$DW$482, DW_AT_decl_line(0x85)
    5719                            .dwattr $C$DW$482, DW_AT_decl_column(0x0f)
    5720                    
    5721                    $C$DW$483       .dwtag  DW_TAG_member
    5722                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$22)
    5723                            .dwattr $C$DW$483, DW_AT_name("nSkip")
    5724                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("nSkip")
    5725                            .dwattr $C$DW$483, DW_AT_bit_offset(0x00)
    5726                            .dwattr $C$DW$483, DW_AT_bit_size(0x04)
    5727                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5728                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5729                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5730                            .dwattr $C$DW$483, DW_AT_decl_line(0x86)
    5731                            .dwattr $C$DW$483, DW_AT_decl_column(0x0f)
    5732                    
    5733                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5734                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x84)
    5735                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0b)
    5736                            .dwendtag $C$DW$T$27
    5737                    
    5738                    
    5739                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5740                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    5741                    $C$DW$484       .dwtag  DW_TAG_member
    5742                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$22)
    5743                            .dwattr $C$DW$484, DW_AT_name("triggerType")
    5744                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("triggerType")
    5745                            .dwattr $C$DW$484, DW_AT_bit_offset(0x04)
    5746                            .dwattr $C$DW$484, DW_AT_bit_size(0x04)
    5747                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5748                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5749                            .dwattr $C$DW$484, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5750                            .dwattr $C$DW$484, DW_AT_decl_line(0xb3)
    5751                            .dwattr $C$DW$484, DW_AT_decl_column(0x0f)
    5752                    
    5753                    $C$DW$485       .dwtag  DW_TAG_member
    5754                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$22)
    5755                            .dwattr $C$DW$485, DW_AT_name("bEnaCmd")
    5756                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("bEnaCmd")
    5757                            .dwattr $C$DW$485, DW_AT_bit_offset(0x03)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  107

    5758                            .dwattr $C$DW$485, DW_AT_bit_size(0x01)
    5759                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5760                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5761                            .dwattr $C$DW$485, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5762                            .dwattr $C$DW$485, DW_AT_decl_line(0xb4)
    5763                            .dwattr $C$DW$485, DW_AT_decl_column(0x0f)
    5764                    
    5765                    $C$DW$486       .dwtag  DW_TAG_member
    5766                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$22)
    5767                            .dwattr $C$DW$486, DW_AT_name("triggerNo")
    5768                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("triggerNo")
    5769                            .dwattr $C$DW$486, DW_AT_bit_offset(0x01)
    5770                            .dwattr $C$DW$486, DW_AT_bit_size(0x02)
    5771                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5772                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5773                            .dwattr $C$DW$486, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5774                            .dwattr $C$DW$486, DW_AT_decl_line(0xb6)
    5775                            .dwattr $C$DW$486, DW_AT_decl_column(0x0f)
    5776                    
    5777                    $C$DW$487       .dwtag  DW_TAG_member
    5778                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$22)
    5779                            .dwattr $C$DW$487, DW_AT_name("pastTrig")
    5780                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("pastTrig")
    5781                            .dwattr $C$DW$487, DW_AT_bit_offset(0x00)
    5782                            .dwattr $C$DW$487, DW_AT_bit_size(0x01)
    5783                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5784                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5785                            .dwattr $C$DW$487, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5786                            .dwattr $C$DW$487, DW_AT_decl_line(0xb7)
    5787                            .dwattr $C$DW$487, DW_AT_decl_column(0x0f)
    5788                    
    5789                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5790                            .dwattr $C$DW$T$28, DW_AT_decl_line(0xb2)
    5791                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
    5792                            .dwendtag $C$DW$T$28
    5793                    
    5794                    
    5795                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5796                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    5797                    $C$DW$488       .dwtag  DW_TAG_member
    5798                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$22)
    5799                            .dwattr $C$DW$488, DW_AT_name("rule")
    5800                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("rule")
    5801                            .dwattr $C$DW$488, DW_AT_bit_offset(0x04)
    5802                            .dwattr $C$DW$488, DW_AT_bit_size(0x04)
    5803                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5804                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5805                            .dwattr $C$DW$488, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5806                            .dwattr $C$DW$488, DW_AT_decl_line(0xbb)
    5807                            .dwattr $C$DW$488, DW_AT_decl_column(0x0f)
    5808                    
    5809                    $C$DW$489       .dwtag  DW_TAG_member
    5810                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$22)
    5811                            .dwattr $C$DW$489, DW_AT_name("nSkip")
    5812                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("nSkip")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  108

    5813                            .dwattr $C$DW$489, DW_AT_bit_offset(0x00)
    5814                            .dwattr $C$DW$489, DW_AT_bit_size(0x04)
    5815                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5816                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5817                            .dwattr $C$DW$489, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5818                            .dwattr $C$DW$489, DW_AT_decl_line(0xbc)
    5819                            .dwattr $C$DW$489, DW_AT_decl_column(0x0f)
    5820                    
    5821                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5822                            .dwattr $C$DW$T$29, DW_AT_decl_line(0xba)
    5823                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    5824                            .dwendtag $C$DW$T$29
    5825                    
    5826                    
    5827                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5828                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    5829                    $C$DW$490       .dwtag  DW_TAG_member
    5830                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$31)
    5831                            .dwattr $C$DW$490, DW_AT_name("frontEndMode")
    5832                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("frontEndMode")
    5833                            .dwattr $C$DW$490, DW_AT_bit_offset(0x0d)
    5834                            .dwattr $C$DW$490, DW_AT_bit_size(0x03)
    5835                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5836                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5837                            .dwattr $C$DW$490, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5838                            .dwattr $C$DW$490, DW_AT_decl_line(0xc9)
    5839                            .dwattr $C$DW$490, DW_AT_decl_column(0x10)
    5840                    
    5841                    $C$DW$491       .dwtag  DW_TAG_member
    5842                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$31)
    5843                            .dwattr $C$DW$491, DW_AT_name("biasMode")
    5844                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("biasMode")
    5845                            .dwattr $C$DW$491, DW_AT_bit_offset(0x0c)
    5846                            .dwattr $C$DW$491, DW_AT_bit_size(0x01)
    5847                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5848                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5849                            .dwattr $C$DW$491, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5850                            .dwattr $C$DW$491, DW_AT_decl_line(0xcf)
    5851                            .dwattr $C$DW$491, DW_AT_decl_column(0x10)
    5852                    
    5853                    $C$DW$492       .dwtag  DW_TAG_member
    5854                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$31)
    5855                            .dwattr $C$DW$492, DW_AT_name("analogCfgMode")
    5856                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("analogCfgMode")
    5857                            .dwattr $C$DW$492, DW_AT_bit_offset(0x06)
    5858                            .dwattr $C$DW$492, DW_AT_bit_size(0x06)
    5859                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5860                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5861                            .dwattr $C$DW$492, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5862                            .dwattr $C$DW$492, DW_AT_decl_line(0xd1)
    5863                            .dwattr $C$DW$492, DW_AT_decl_column(0x10)
    5864                    
    5865                    $C$DW$493       .dwtag  DW_TAG_member
    5866                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$31)
    5867                            .dwattr $C$DW$493, DW_AT_name("bNoFsPowerUp")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  109

    5868                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("bNoFsPowerUp")
    5869                            .dwattr $C$DW$493, DW_AT_bit_offset(0x05)
    5870                            .dwattr $C$DW$493, DW_AT_bit_size(0x01)
    5871                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5872                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5873                            .dwattr $C$DW$493, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5874                            .dwattr $C$DW$493, DW_AT_decl_line(0xd8)
    5875                            .dwattr $C$DW$493, DW_AT_decl_column(0x10)
    5876                    
    5877                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5878                            .dwattr $C$DW$T$32, DW_AT_decl_line(0xc8)
    5879                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x0b)
    5880                            .dwendtag $C$DW$T$32
    5881                    
    5882                    
    5883                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5884                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    5885                    $C$DW$494       .dwtag  DW_TAG_member
    5886                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$22)
    5887                            .dwattr $C$DW$494, DW_AT_name("triggerType")
    5888                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("triggerType")
    5889                            .dwattr $C$DW$494, DW_AT_bit_offset(0x04)
    5890                            .dwattr $C$DW$494, DW_AT_bit_size(0x04)
    5891                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5892                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5893                            .dwattr $C$DW$494, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5894                            .dwattr $C$DW$494, DW_AT_decl_line(0x1cf)
    5895                            .dwattr $C$DW$494, DW_AT_decl_column(0x0f)
    5896                    
    5897                    $C$DW$495       .dwtag  DW_TAG_member
    5898                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$22)
    5899                            .dwattr $C$DW$495, DW_AT_name("bEnaCmd")
    5900                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("bEnaCmd")
    5901                            .dwattr $C$DW$495, DW_AT_bit_offset(0x03)
    5902                            .dwattr $C$DW$495, DW_AT_bit_size(0x01)
    5903                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5904                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5905                            .dwattr $C$DW$495, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5906                            .dwattr $C$DW$495, DW_AT_decl_line(0x1d0)
    5907                            .dwattr $C$DW$495, DW_AT_decl_column(0x0f)
    5908                    
    5909                    $C$DW$496       .dwtag  DW_TAG_member
    5910                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$22)
    5911                            .dwattr $C$DW$496, DW_AT_name("triggerNo")
    5912                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("triggerNo")
    5913                            .dwattr $C$DW$496, DW_AT_bit_offset(0x01)
    5914                            .dwattr $C$DW$496, DW_AT_bit_size(0x02)
    5915                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5916                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5917                            .dwattr $C$DW$496, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5918                            .dwattr $C$DW$496, DW_AT_decl_line(0x1d2)
    5919                            .dwattr $C$DW$496, DW_AT_decl_column(0x0f)
    5920                    
    5921                    $C$DW$497       .dwtag  DW_TAG_member
    5922                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$22)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  110

    5923                            .dwattr $C$DW$497, DW_AT_name("pastTrig")
    5924                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("pastTrig")
    5925                            .dwattr $C$DW$497, DW_AT_bit_offset(0x00)
    5926                            .dwattr $C$DW$497, DW_AT_bit_size(0x01)
    5927                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5928                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5929                            .dwattr $C$DW$497, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5930                            .dwattr $C$DW$497, DW_AT_decl_line(0x1d3)
    5931                            .dwattr $C$DW$497, DW_AT_decl_column(0x0f)
    5932                    
    5933                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5934                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x1ce)
    5935                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
    5936                            .dwendtag $C$DW$T$33
    5937                    
    5938                    
    5939                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5940                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    5941                    $C$DW$498       .dwtag  DW_TAG_member
    5942                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$22)
    5943                            .dwattr $C$DW$498, DW_AT_name("rule")
    5944                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("rule")
    5945                            .dwattr $C$DW$498, DW_AT_bit_offset(0x04)
    5946                            .dwattr $C$DW$498, DW_AT_bit_size(0x04)
    5947                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5948                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5949                            .dwattr $C$DW$498, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5950                            .dwattr $C$DW$498, DW_AT_decl_line(0x1d7)
    5951                            .dwattr $C$DW$498, DW_AT_decl_column(0x0f)
    5952                    
    5953                    $C$DW$499       .dwtag  DW_TAG_member
    5954                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$22)
    5955                            .dwattr $C$DW$499, DW_AT_name("nSkip")
    5956                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("nSkip")
    5957                            .dwattr $C$DW$499, DW_AT_bit_offset(0x00)
    5958                            .dwattr $C$DW$499, DW_AT_bit_size(0x04)
    5959                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5960                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5961                            .dwattr $C$DW$499, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5962                            .dwattr $C$DW$499, DW_AT_decl_line(0x1d8)
    5963                            .dwattr $C$DW$499, DW_AT_decl_column(0x0f)
    5964                    
    5965                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5966                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x1d6)
    5967                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    5968                            .dwendtag $C$DW$T$34
    5969                    
    5970                    
    5971                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5972                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    5973                    $C$DW$500       .dwtag  DW_TAG_member
    5974                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$31)
    5975                            .dwattr $C$DW$500, DW_AT_name("modType")
    5976                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("modType")
    5977                            .dwattr $C$DW$500, DW_AT_bit_offset(0x0d)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  111

    5978                            .dwattr $C$DW$500, DW_AT_bit_size(0x03)
    5979                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5980                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5981                            .dwattr $C$DW$500, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5982                            .dwattr $C$DW$500, DW_AT_decl_line(0x1db)
    5983                            .dwattr $C$DW$500, DW_AT_decl_column(0x10)
    5984                    
    5985                    $C$DW$501       .dwtag  DW_TAG_member
    5986                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$31)
    5987                            .dwattr $C$DW$501, DW_AT_name("deviation")
    5988                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("deviation")
    5989                            .dwattr $C$DW$501, DW_AT_bit_offset(0x00)
    5990                            .dwattr $C$DW$501, DW_AT_bit_size(0x0d)
    5991                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5992                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5993                            .dwattr $C$DW$501, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5994                            .dwattr $C$DW$501, DW_AT_decl_line(0x1de)
    5995                            .dwattr $C$DW$501, DW_AT_decl_column(0x10)
    5996                    
    5997                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5998                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x1da)
    5999                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    6000                            .dwendtag $C$DW$T$35
    6001                    
    6002                    
    6003                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6004                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    6005                    $C$DW$502       .dwtag  DW_TAG_member
    6006                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$37)
    6007                            .dwattr $C$DW$502, DW_AT_name("preScale")
    6008                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("preScale")
    6009                            .dwattr $C$DW$502, DW_AT_bit_offset(0x1c)
    6010                            .dwattr $C$DW$502, DW_AT_bit_size(0x04)
    6011                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6012                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    6013                            .dwattr $C$DW$502, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6014                            .dwattr $C$DW$502, DW_AT_decl_line(0x1e1)
    6015                            .dwattr $C$DW$502, DW_AT_decl_column(0x10)
    6016                    
    6017                    $C$DW$503       .dwtag  DW_TAG_member
    6018                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$37)
    6019                            .dwattr $C$DW$503, DW_AT_name("rateWord")
    6020                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("rateWord")
    6021                            .dwattr $C$DW$503, DW_AT_bit_offset(0x03)
    6022                            .dwattr $C$DW$503, DW_AT_bit_size(0x15)
    6023                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6024                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    6025                            .dwattr $C$DW$503, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6026                            .dwattr $C$DW$503, DW_AT_decl_line(0x1e3)
    6027                            .dwattr $C$DW$503, DW_AT_decl_column(0x10)
    6028                    
    6029                    $C$DW$504       .dwtag  DW_TAG_member
    6030                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$37)
    6031                            .dwattr $C$DW$504, DW_AT_name("decimMode")
    6032                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("decimMode")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  112

    6033                            .dwattr $C$DW$504, DW_AT_bit_offset(0x00)
    6034                            .dwattr $C$DW$504, DW_AT_bit_size(0x03)
    6035                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6036                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    6037                            .dwattr $C$DW$504, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6038                            .dwattr $C$DW$504, DW_AT_decl_line(0x1e4)
    6039                            .dwattr $C$DW$504, DW_AT_decl_column(0x10)
    6040                    
    6041                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6042                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x1e0)
    6043                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    6044                            .dwendtag $C$DW$T$38
    6045                    
    6046                    
    6047                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6048                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    6049                    $C$DW$505       .dwtag  DW_TAG_member
    6050                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$22)
    6051                            .dwattr $C$DW$505, DW_AT_name("nPreamBytes")
    6052                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("nPreamBytes")
    6053                            .dwattr $C$DW$505, DW_AT_bit_offset(0x02)
    6054                            .dwattr $C$DW$505, DW_AT_bit_size(0x06)
    6055                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6056                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    6057                            .dwattr $C$DW$505, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6058                            .dwattr $C$DW$505, DW_AT_decl_line(0x1ec)
    6059                            .dwattr $C$DW$505, DW_AT_decl_column(0x0f)
    6060                    
    6061                    $C$DW$506       .dwtag  DW_TAG_member
    6062                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$22)
    6063                            .dwattr $C$DW$506, DW_AT_name("preamMode")
    6064                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("preamMode")
    6065                            .dwattr $C$DW$506, DW_AT_bit_offset(0x00)
    6066                            .dwattr $C$DW$506, DW_AT_bit_size(0x02)
    6067                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6068                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    6069                            .dwattr $C$DW$506, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6070                            .dwattr $C$DW$506, DW_AT_decl_line(0x1f2)
    6071                            .dwattr $C$DW$506, DW_AT_decl_column(0x0f)
    6072                    
    6073                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6074                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x1eb)
    6075                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    6076                            .dwendtag $C$DW$T$39
    6077                    
    6078                    
    6079                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6080                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    6081                    $C$DW$507       .dwtag  DW_TAG_member
    6082                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$31)
    6083                            .dwattr $C$DW$507, DW_AT_name("nSwBits")
    6084                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("nSwBits")
    6085                            .dwattr $C$DW$507, DW_AT_bit_offset(0x0a)
    6086                            .dwattr $C$DW$507, DW_AT_bit_size(0x06)
    6087                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  113

    6088                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    6089                            .dwattr $C$DW$507, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6090                            .dwattr $C$DW$507, DW_AT_decl_line(0x1f8)
    6091                            .dwattr $C$DW$507, DW_AT_decl_column(0x10)
    6092                    
    6093                    $C$DW$508       .dwtag  DW_TAG_member
    6094                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$31)
    6095                            .dwattr $C$DW$508, DW_AT_name("bBitReversal")
    6096                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("bBitReversal")
    6097                            .dwattr $C$DW$508, DW_AT_bit_offset(0x09)
    6098                            .dwattr $C$DW$508, DW_AT_bit_size(0x01)
    6099                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6100                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    6101                            .dwattr $C$DW$508, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6102                            .dwattr $C$DW$508, DW_AT_decl_line(0x1f9)
    6103                            .dwattr $C$DW$508, DW_AT_decl_column(0x10)
    6104                    
    6105                    $C$DW$509       .dwtag  DW_TAG_member
    6106                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$31)
    6107                            .dwattr $C$DW$509, DW_AT_name("bMsbFirst")
    6108                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("bMsbFirst")
    6109                            .dwattr $C$DW$509, DW_AT_bit_offset(0x08)
    6110                            .dwattr $C$DW$509, DW_AT_bit_size(0x01)
    6111                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6112                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    6113                            .dwattr $C$DW$509, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6114                            .dwattr $C$DW$509, DW_AT_decl_line(0x1fb)
    6115                            .dwattr $C$DW$509, DW_AT_decl_column(0x10)
    6116                    
    6117                    $C$DW$510       .dwtag  DW_TAG_member
    6118                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$31)
    6119                            .dwattr $C$DW$510, DW_AT_name("fecMode")
    6120                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("fecMode")
    6121                            .dwattr $C$DW$510, DW_AT_bit_offset(0x04)
    6122                            .dwattr $C$DW$510, DW_AT_bit_size(0x04)
    6123                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6124                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    6125                            .dwattr $C$DW$510, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6126                            .dwattr $C$DW$510, DW_AT_decl_line(0x1fd)
    6127                            .dwattr $C$DW$510, DW_AT_decl_column(0x10)
    6128                    
    6129                    $C$DW$511       .dwtag  DW_TAG_member
    6130                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$31)
    6131                            .dwattr $C$DW$511, DW_AT_name("whitenMode")
    6132                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("whitenMode")
    6133                            .dwattr $C$DW$511, DW_AT_bit_offset(0x00)
    6134                            .dwattr $C$DW$511, DW_AT_bit_size(0x03)
    6135                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6136                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    6137                            .dwattr $C$DW$511, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6138                            .dwattr $C$DW$511, DW_AT_decl_line(0x203)
    6139                            .dwattr $C$DW$511, DW_AT_decl_column(0x10)
    6140                    
    6141                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6142                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x1f7)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  114

    6143                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    6144                            .dwendtag $C$DW$T$40
    6145                    
    6146                    
    6147                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6148                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    6149                    $C$DW$512       .dwtag  DW_TAG_member
    6150                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$31)
    6151                            .dwattr $C$DW$512, DW_AT_name("frontEndMode")
    6152                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("frontEndMode")
    6153                            .dwattr $C$DW$512, DW_AT_bit_offset(0x0d)
    6154                            .dwattr $C$DW$512, DW_AT_bit_size(0x03)
    6155                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6156                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    6157                            .dwattr $C$DW$512, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6158                            .dwattr $C$DW$512, DW_AT_decl_line(0x20d)
    6159                            .dwattr $C$DW$512, DW_AT_decl_column(0x10)
    6160                    
    6161                    $C$DW$513       .dwtag  DW_TAG_member
    6162                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$31)
    6163                            .dwattr $C$DW$513, DW_AT_name("biasMode")
    6164                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("biasMode")
    6165                            .dwattr $C$DW$513, DW_AT_bit_offset(0x0c)
    6166                            .dwattr $C$DW$513, DW_AT_bit_size(0x01)
    6167                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6168                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    6169                            .dwattr $C$DW$513, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6170                            .dwattr $C$DW$513, DW_AT_decl_line(0x213)
    6171                            .dwattr $C$DW$513, DW_AT_decl_column(0x10)
    6172                    
    6173                    $C$DW$514       .dwtag  DW_TAG_member
    6174                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$31)
    6175                            .dwattr $C$DW$514, DW_AT_name("analogCfgMode")
    6176                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("analogCfgMode")
    6177                            .dwattr $C$DW$514, DW_AT_bit_offset(0x06)
    6178                            .dwattr $C$DW$514, DW_AT_bit_size(0x06)
    6179                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6180                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    6181                            .dwattr $C$DW$514, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6182                            .dwattr $C$DW$514, DW_AT_decl_line(0x215)
    6183                            .dwattr $C$DW$514, DW_AT_decl_column(0x10)
    6184                    
    6185                    $C$DW$515       .dwtag  DW_TAG_member
    6186                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$31)
    6187                            .dwattr $C$DW$515, DW_AT_name("bNoFsPowerUp")
    6188                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("bNoFsPowerUp")
    6189                            .dwattr $C$DW$515, DW_AT_bit_offset(0x05)
    6190                            .dwattr $C$DW$515, DW_AT_bit_size(0x01)
    6191                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6192                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    6193                            .dwattr $C$DW$515, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6194                            .dwattr $C$DW$515, DW_AT_decl_line(0x21c)
    6195                            .dwattr $C$DW$515, DW_AT_decl_column(0x10)
    6196                    
    6197                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  115

    6198                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x20c)
    6199                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    6200                            .dwendtag $C$DW$T$41
    6201                    
    6202                    
    6203                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    6204                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    6205                    $C$DW$516       .dwtag  DW_TAG_member
    6206                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$22)
    6207                            .dwattr $C$DW$516, DW_AT_name("triggerType")
    6208                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("triggerType")
    6209                            .dwattr $C$DW$516, DW_AT_bit_offset(0x04)
    6210                            .dwattr $C$DW$516, DW_AT_bit_size(0x04)
    6211                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6212                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    6213                            .dwattr $C$DW$516, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6214                            .dwattr $C$DW$516, DW_AT_decl_line(0x232)
    6215                            .dwattr $C$DW$516, DW_AT_decl_column(0x0f)
    6216                    
    6217                    $C$DW$517       .dwtag  DW_TAG_member
    6218                            .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$22)
    6219                            .dwattr $C$DW$517, DW_AT_name("bEnaCmd")
    6220                            .dwattr $C$DW$517, DW_AT_TI_symbol_name("bEnaCmd")
    6221                            .dwattr $C$DW$517, DW_AT_bit_offset(0x03)
    6222                            .dwattr $C$DW$517, DW_AT_bit_size(0x01)
    6223                            .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6224                            .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    6225                            .dwattr $C$DW$517, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6226                            .dwattr $C$DW$517, DW_AT_decl_line(0x233)
    6227                            .dwattr $C$DW$517, DW_AT_decl_column(0x0f)
    6228                    
    6229                    $C$DW$518       .dwtag  DW_TAG_member
    6230                            .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$22)
    6231                            .dwattr $C$DW$518, DW_AT_name("triggerNo")
    6232                            .dwattr $C$DW$518, DW_AT_TI_symbol_name("triggerNo")
    6233                            .dwattr $C$DW$518, DW_AT_bit_offset(0x01)
    6234                            .dwattr $C$DW$518, DW_AT_bit_size(0x02)
    6235                            .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6236                            .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    6237                            .dwattr $C$DW$518, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6238                            .dwattr $C$DW$518, DW_AT_decl_line(0x235)
    6239                            .dwattr $C$DW$518, DW_AT_decl_column(0x0f)
    6240                    
    6241                    $C$DW$519       .dwtag  DW_TAG_member
    6242                            .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$22)
    6243                            .dwattr $C$DW$519, DW_AT_name("pastTrig")
    6244                            .dwattr $C$DW$519, DW_AT_TI_symbol_name("pastTrig")
    6245                            .dwattr $C$DW$519, DW_AT_bit_offset(0x00)
    6246                            .dwattr $C$DW$519, DW_AT_bit_size(0x01)
    6247                            .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6248                            .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    6249                            .dwattr $C$DW$519, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6250                            .dwattr $C$DW$519, DW_AT_decl_line(0x236)
    6251                            .dwattr $C$DW$519, DW_AT_decl_column(0x0f)
    6252                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  116

    6253                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6254                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x231)
    6255                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    6256                            .dwendtag $C$DW$T$42
    6257                    
    6258                    
    6259                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    6260                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    6261                    $C$DW$520       .dwtag  DW_TAG_member
    6262                            .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$22)
    6263                            .dwattr $C$DW$520, DW_AT_name("rule")
    6264                            .dwattr $C$DW$520, DW_AT_TI_symbol_name("rule")
    6265                            .dwattr $C$DW$520, DW_AT_bit_offset(0x04)
    6266                            .dwattr $C$DW$520, DW_AT_bit_size(0x04)
    6267                            .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6268                            .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    6269                            .dwattr $C$DW$520, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6270                            .dwattr $C$DW$520, DW_AT_decl_line(0x23a)
    6271                            .dwattr $C$DW$520, DW_AT_decl_column(0x0f)
    6272                    
    6273                    $C$DW$521       .dwtag  DW_TAG_member
    6274                            .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$22)
    6275                            .dwattr $C$DW$521, DW_AT_name("nSkip")
    6276                            .dwattr $C$DW$521, DW_AT_TI_symbol_name("nSkip")
    6277                            .dwattr $C$DW$521, DW_AT_bit_offset(0x00)
    6278                            .dwattr $C$DW$521, DW_AT_bit_size(0x04)
    6279                            .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6280                            .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    6281                            .dwattr $C$DW$521, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6282                            .dwattr $C$DW$521, DW_AT_decl_line(0x23b)
    6283                            .dwattr $C$DW$521, DW_AT_decl_column(0x0f)
    6284                    
    6285                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6286                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x239)
    6287                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    6288                            .dwendtag $C$DW$T$43
    6289                    
    6290                    
    6291                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    6292                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    6293                    $C$DW$522       .dwtag  DW_TAG_member
    6294                            .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$31)
    6295                            .dwattr $C$DW$522, DW_AT_name("modType")
    6296                            .dwattr $C$DW$522, DW_AT_TI_symbol_name("modType")
    6297                            .dwattr $C$DW$522, DW_AT_bit_offset(0x0d)
    6298                            .dwattr $C$DW$522, DW_AT_bit_size(0x03)
    6299                            .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6300                            .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    6301                            .dwattr $C$DW$522, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6302                            .dwattr $C$DW$522, DW_AT_decl_line(0x23e)
    6303                            .dwattr $C$DW$522, DW_AT_decl_column(0x10)
    6304                    
    6305                    $C$DW$523       .dwtag  DW_TAG_member
    6306                            .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$31)
    6307                            .dwattr $C$DW$523, DW_AT_name("deviation")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  117

    6308                            .dwattr $C$DW$523, DW_AT_TI_symbol_name("deviation")
    6309                            .dwattr $C$DW$523, DW_AT_bit_offset(0x00)
    6310                            .dwattr $C$DW$523, DW_AT_bit_size(0x0d)
    6311                            .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6312                            .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    6313                            .dwattr $C$DW$523, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6314                            .dwattr $C$DW$523, DW_AT_decl_line(0x241)
    6315                            .dwattr $C$DW$523, DW_AT_decl_column(0x10)
    6316                    
    6317                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6318                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x23d)
    6319                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x0b)
    6320                            .dwendtag $C$DW$T$44
    6321                    
    6322                    
    6323                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    6324                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    6325                    $C$DW$524       .dwtag  DW_TAG_member
    6326                            .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$37)
    6327                            .dwattr $C$DW$524, DW_AT_name("preScale")
    6328                            .dwattr $C$DW$524, DW_AT_TI_symbol_name("preScale")
    6329                            .dwattr $C$DW$524, DW_AT_bit_offset(0x1c)
    6330                            .dwattr $C$DW$524, DW_AT_bit_size(0x04)
    6331                            .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6332                            .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    6333                            .dwattr $C$DW$524, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6334                            .dwattr $C$DW$524, DW_AT_decl_line(0x244)
    6335                            .dwattr $C$DW$524, DW_AT_decl_column(0x10)
    6336                    
    6337                    $C$DW$525       .dwtag  DW_TAG_member
    6338                            .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$37)
    6339                            .dwattr $C$DW$525, DW_AT_name("rateWord")
    6340                            .dwattr $C$DW$525, DW_AT_TI_symbol_name("rateWord")
    6341                            .dwattr $C$DW$525, DW_AT_bit_offset(0x03)
    6342                            .dwattr $C$DW$525, DW_AT_bit_size(0x15)
    6343                            .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6344                            .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    6345                            .dwattr $C$DW$525, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6346                            .dwattr $C$DW$525, DW_AT_decl_line(0x246)
    6347                            .dwattr $C$DW$525, DW_AT_decl_column(0x10)
    6348                    
    6349                    $C$DW$526       .dwtag  DW_TAG_member
    6350                            .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$37)
    6351                            .dwattr $C$DW$526, DW_AT_name("decimMode")
    6352                            .dwattr $C$DW$526, DW_AT_TI_symbol_name("decimMode")
    6353                            .dwattr $C$DW$526, DW_AT_bit_offset(0x00)
    6354                            .dwattr $C$DW$526, DW_AT_bit_size(0x03)
    6355                            .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6356                            .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    6357                            .dwattr $C$DW$526, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6358                            .dwattr $C$DW$526, DW_AT_decl_line(0x247)
    6359                            .dwattr $C$DW$526, DW_AT_decl_column(0x10)
    6360                    
    6361                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6362                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x243)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  118

    6363                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0b)
    6364                            .dwendtag $C$DW$T$45
    6365                    
    6366                    
    6367                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    6368                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    6369                    $C$DW$527       .dwtag  DW_TAG_member
    6370                            .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$22)
    6371                            .dwattr $C$DW$527, DW_AT_name("nPreamBytes")
    6372                            .dwattr $C$DW$527, DW_AT_TI_symbol_name("nPreamBytes")
    6373                            .dwattr $C$DW$527, DW_AT_bit_offset(0x02)
    6374                            .dwattr $C$DW$527, DW_AT_bit_size(0x06)
    6375                            .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6376                            .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    6377                            .dwattr $C$DW$527, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6378                            .dwattr $C$DW$527, DW_AT_decl_line(0x24f)
    6379                            .dwattr $C$DW$527, DW_AT_decl_column(0x0f)
    6380                    
    6381                    $C$DW$528       .dwtag  DW_TAG_member
    6382                            .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$22)
    6383                            .dwattr $C$DW$528, DW_AT_name("preamMode")
    6384                            .dwattr $C$DW$528, DW_AT_TI_symbol_name("preamMode")
    6385                            .dwattr $C$DW$528, DW_AT_bit_offset(0x00)
    6386                            .dwattr $C$DW$528, DW_AT_bit_size(0x02)
    6387                            .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6388                            .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    6389                            .dwattr $C$DW$528, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6390                            .dwattr $C$DW$528, DW_AT_decl_line(0x255)
    6391                            .dwattr $C$DW$528, DW_AT_decl_column(0x0f)
    6392                    
    6393                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6394                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x24e)
    6395                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x0b)
    6396                            .dwendtag $C$DW$T$46
    6397                    
    6398                    
    6399                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    6400                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    6401                    $C$DW$529       .dwtag  DW_TAG_member
    6402                            .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$31)
    6403                            .dwattr $C$DW$529, DW_AT_name("nSwBits")
    6404                            .dwattr $C$DW$529, DW_AT_TI_symbol_name("nSwBits")
    6405                            .dwattr $C$DW$529, DW_AT_bit_offset(0x0a)
    6406                            .dwattr $C$DW$529, DW_AT_bit_size(0x06)
    6407                            .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6408                            .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    6409                            .dwattr $C$DW$529, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6410                            .dwattr $C$DW$529, DW_AT_decl_line(0x25b)
    6411                            .dwattr $C$DW$529, DW_AT_decl_column(0x10)
    6412                    
    6413                    $C$DW$530       .dwtag  DW_TAG_member
    6414                            .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$31)
    6415                            .dwattr $C$DW$530, DW_AT_name("bBitReversal")
    6416                            .dwattr $C$DW$530, DW_AT_TI_symbol_name("bBitReversal")
    6417                            .dwattr $C$DW$530, DW_AT_bit_offset(0x09)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  119

    6418                            .dwattr $C$DW$530, DW_AT_bit_size(0x01)
    6419                            .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6420                            .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    6421                            .dwattr $C$DW$530, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6422                            .dwattr $C$DW$530, DW_AT_decl_line(0x25c)
    6423                            .dwattr $C$DW$530, DW_AT_decl_column(0x10)
    6424                    
    6425                    $C$DW$531       .dwtag  DW_TAG_member
    6426                            .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$31)
    6427                            .dwattr $C$DW$531, DW_AT_name("bMsbFirst")
    6428                            .dwattr $C$DW$531, DW_AT_TI_symbol_name("bMsbFirst")
    6429                            .dwattr $C$DW$531, DW_AT_bit_offset(0x08)
    6430                            .dwattr $C$DW$531, DW_AT_bit_size(0x01)
    6431                            .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6432                            .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    6433                            .dwattr $C$DW$531, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6434                            .dwattr $C$DW$531, DW_AT_decl_line(0x25e)
    6435                            .dwattr $C$DW$531, DW_AT_decl_column(0x10)
    6436                    
    6437                    $C$DW$532       .dwtag  DW_TAG_member
    6438                            .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$31)
    6439                            .dwattr $C$DW$532, DW_AT_name("fecMode")
    6440                            .dwattr $C$DW$532, DW_AT_TI_symbol_name("fecMode")
    6441                            .dwattr $C$DW$532, DW_AT_bit_offset(0x04)
    6442                            .dwattr $C$DW$532, DW_AT_bit_size(0x04)
    6443                            .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6444                            .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    6445                            .dwattr $C$DW$532, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6446                            .dwattr $C$DW$532, DW_AT_decl_line(0x260)
    6447                            .dwattr $C$DW$532, DW_AT_decl_column(0x10)
    6448                    
    6449                    $C$DW$533       .dwtag  DW_TAG_member
    6450                            .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$31)
    6451                            .dwattr $C$DW$533, DW_AT_name("whitenMode")
    6452                            .dwattr $C$DW$533, DW_AT_TI_symbol_name("whitenMode")
    6453                            .dwattr $C$DW$533, DW_AT_bit_offset(0x00)
    6454                            .dwattr $C$DW$533, DW_AT_bit_size(0x03)
    6455                            .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6456                            .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    6457                            .dwattr $C$DW$533, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6458                            .dwattr $C$DW$533, DW_AT_decl_line(0x266)
    6459                            .dwattr $C$DW$533, DW_AT_decl_column(0x10)
    6460                    
    6461                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6462                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x25a)
    6463                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x0b)
    6464                            .dwendtag $C$DW$T$47
    6465                    
    6466                    
    6467                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    6468                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    6469                    $C$DW$534       .dwtag  DW_TAG_member
    6470                            .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$31)
    6471                            .dwattr $C$DW$534, DW_AT_name("frontEndMode")
    6472                            .dwattr $C$DW$534, DW_AT_TI_symbol_name("frontEndMode")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  120

    6473                            .dwattr $C$DW$534, DW_AT_bit_offset(0x0d)
    6474                            .dwattr $C$DW$534, DW_AT_bit_size(0x03)
    6475                            .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6476                            .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    6477                            .dwattr $C$DW$534, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6478                            .dwattr $C$DW$534, DW_AT_decl_line(0x270)
    6479                            .dwattr $C$DW$534, DW_AT_decl_column(0x10)
    6480                    
    6481                    $C$DW$535       .dwtag  DW_TAG_member
    6482                            .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$31)
    6483                            .dwattr $C$DW$535, DW_AT_name("biasMode")
    6484                            .dwattr $C$DW$535, DW_AT_TI_symbol_name("biasMode")
    6485                            .dwattr $C$DW$535, DW_AT_bit_offset(0x0c)
    6486                            .dwattr $C$DW$535, DW_AT_bit_size(0x01)
    6487                            .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6488                            .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    6489                            .dwattr $C$DW$535, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6490                            .dwattr $C$DW$535, DW_AT_decl_line(0x276)
    6491                            .dwattr $C$DW$535, DW_AT_decl_column(0x10)
    6492                    
    6493                    $C$DW$536       .dwtag  DW_TAG_member
    6494                            .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$31)
    6495                            .dwattr $C$DW$536, DW_AT_name("analogCfgMode")
    6496                            .dwattr $C$DW$536, DW_AT_TI_symbol_name("analogCfgMode")
    6497                            .dwattr $C$DW$536, DW_AT_bit_offset(0x06)
    6498                            .dwattr $C$DW$536, DW_AT_bit_size(0x06)
    6499                            .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6500                            .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    6501                            .dwattr $C$DW$536, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6502                            .dwattr $C$DW$536, DW_AT_decl_line(0x278)
    6503                            .dwattr $C$DW$536, DW_AT_decl_column(0x10)
    6504                    
    6505                    $C$DW$537       .dwtag  DW_TAG_member
    6506                            .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$31)
    6507                            .dwattr $C$DW$537, DW_AT_name("bNoFsPowerUp")
    6508                            .dwattr $C$DW$537, DW_AT_TI_symbol_name("bNoFsPowerUp")
    6509                            .dwattr $C$DW$537, DW_AT_bit_offset(0x05)
    6510                            .dwattr $C$DW$537, DW_AT_bit_size(0x01)
    6511                            .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6512                            .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    6513                            .dwattr $C$DW$537, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6514                            .dwattr $C$DW$537, DW_AT_decl_line(0x27f)
    6515                            .dwattr $C$DW$537, DW_AT_decl_column(0x10)
    6516                    
    6517                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6518                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x26f)
    6519                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x0b)
    6520                            .dwendtag $C$DW$T$48
    6521                    
    6522                    
    6523                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    6524                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x24)
    6525                    $C$DW$538       .dwtag  DW_TAG_member
    6526                            .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$37)
    6527                            .dwattr $C$DW$538, DW_AT_name("nInactivityTimeout")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  121

    6528                            .dwattr $C$DW$538, DW_AT_TI_symbol_name("nInactivityTimeout")
    6529                            .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6530                            .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    6531                            .dwattr $C$DW$538, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6532                            .dwattr $C$DW$538, DW_AT_decl_line(0x515)
    6533                            .dwattr $C$DW$538, DW_AT_decl_column(0x1d)
    6534                    
    6535                    $C$DW$539       .dwtag  DW_TAG_member
    6536                            .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$50)
    6537                            .dwattr $C$DW$539, DW_AT_name("pRfMode")
    6538                            .dwattr $C$DW$539, DW_AT_TI_symbol_name("pRfMode")
    6539                            .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6540                            .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    6541                            .dwattr $C$DW$539, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6542                            .dwattr $C$DW$539, DW_AT_decl_line(0x516)
    6543                            .dwattr $C$DW$539, DW_AT_decl_column(0x1d)
    6544                    
    6545                    $C$DW$540       .dwtag  DW_TAG_member
    6546                            .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$52)
    6547                            .dwattr $C$DW$540, DW_AT_name("pRadioSetup")
    6548                            .dwattr $C$DW$540, DW_AT_TI_symbol_name("pRadioSetup")
    6549                            .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6550                            .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    6551                            .dwattr $C$DW$540, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6552                            .dwattr $C$DW$540, DW_AT_decl_line(0x517)
    6553                            .dwattr $C$DW$540, DW_AT_decl_column(0x1d)
    6554                    
    6555                    $C$DW$541       .dwtag  DW_TAG_member
    6556                            .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$37)
    6557                            .dwattr $C$DW$541, DW_AT_name("nPowerUpDuration")
    6558                            .dwattr $C$DW$541, DW_AT_TI_symbol_name("nPowerUpDuration")
    6559                            .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6560                            .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    6561                            .dwattr $C$DW$541, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6562                            .dwattr $C$DW$541, DW_AT_decl_line(0x518)
    6563                            .dwattr $C$DW$541, DW_AT_decl_column(0x1d)
    6564                    
    6565                    $C$DW$542       .dwtag  DW_TAG_member
    6566                            .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$53)
    6567                            .dwattr $C$DW$542, DW_AT_name("bMeasurePowerUpDuration")
    6568                            .dwattr $C$DW$542, DW_AT_TI_symbol_name("bMeasurePowerUpDuration")
    6569                            .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6570                            .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    6571                            .dwattr $C$DW$542, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6572                            .dwattr $C$DW$542, DW_AT_decl_line(0x519)
    6573                            .dwattr $C$DW$542, DW_AT_decl_column(0x1d)
    6574                    
    6575                    $C$DW$543       .dwtag  DW_TAG_member
    6576                            .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$53)
    6577                            .dwattr $C$DW$543, DW_AT_name("bUpdateSetup")
    6578                            .dwattr $C$DW$543, DW_AT_TI_symbol_name("bUpdateSetup")
    6579                            .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6580                            .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    6581                            .dwattr $C$DW$543, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6582                            .dwattr $C$DW$543, DW_AT_decl_line(0x51a)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  122

    6583                            .dwattr $C$DW$543, DW_AT_decl_column(0x1d)
    6584                    
    6585                    $C$DW$544       .dwtag  DW_TAG_member
    6586                            .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$31)
    6587                            .dwattr $C$DW$544, DW_AT_name("nPowerUpDurationMargin")
    6588                            .dwattr $C$DW$544, DW_AT_TI_symbol_name("nPowerUpDurationMargin")
    6589                            .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6590                            .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    6591                            .dwattr $C$DW$544, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6592                            .dwattr $C$DW$544, DW_AT_decl_line(0x51b)
    6593                            .dwattr $C$DW$544, DW_AT_decl_column(0x1d)
    6594                    
    6595                    $C$DW$545       .dwtag  DW_TAG_member
    6596                            .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$3)
    6597                            .dwattr $C$DW$545, DW_AT_name("pPowerCb")
    6598                            .dwattr $C$DW$545, DW_AT_TI_symbol_name("pPowerCb")
    6599                            .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6600                            .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    6601                            .dwattr $C$DW$545, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6602                            .dwattr $C$DW$545, DW_AT_decl_line(0x51c)
    6603                            .dwattr $C$DW$545, DW_AT_decl_column(0x1d)
    6604                    
    6605                    $C$DW$546       .dwtag  DW_TAG_member
    6606                            .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$3)
    6607                            .dwattr $C$DW$546, DW_AT_name("pErrCb")
    6608                            .dwattr $C$DW$546, DW_AT_TI_symbol_name("pErrCb")
    6609                            .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6610                            .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    6611                            .dwattr $C$DW$546, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6612                            .dwattr $C$DW$546, DW_AT_decl_line(0x51d)
    6613                            .dwattr $C$DW$546, DW_AT_decl_column(0x1d)
    6614                    
    6615                    $C$DW$547       .dwtag  DW_TAG_member
    6616                            .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$3)
    6617                            .dwattr $C$DW$547, DW_AT_name("pClientEventCb")
    6618                            .dwattr $C$DW$547, DW_AT_TI_symbol_name("pClientEventCb")
    6619                            .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6620                            .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    6621                            .dwattr $C$DW$547, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6622                            .dwattr $C$DW$547, DW_AT_decl_line(0x51e)
    6623                            .dwattr $C$DW$547, DW_AT_decl_column(0x1d)
    6624                    
    6625                    $C$DW$548       .dwtag  DW_TAG_member
    6626                            .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$54)
    6627                            .dwattr $C$DW$548, DW_AT_name("nClientEventMask")
    6628                            .dwattr $C$DW$548, DW_AT_TI_symbol_name("nClientEventMask")
    6629                            .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6630                            .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    6631                            .dwattr $C$DW$548, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6632                            .dwattr $C$DW$548, DW_AT_decl_line(0x51f)
    6633                            .dwattr $C$DW$548, DW_AT_decl_column(0x1d)
    6634                    
    6635                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    6636                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x514)
    6637                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  123

    6638                            .dwendtag $C$DW$T$55
    6639                    
    6640                    
    6641                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    6642                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
    6643                    $C$DW$549       .dwtag  DW_TAG_member
    6644                            .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$22)
    6645                            .dwattr $C$DW$549, DW_AT_name("triggerType")
    6646                            .dwattr $C$DW$549, DW_AT_TI_symbol_name("triggerType")
    6647                            .dwattr $C$DW$549, DW_AT_bit_offset(0x04)
    6648                            .dwattr $C$DW$549, DW_AT_bit_size(0x04)
    6649                            .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6650                            .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    6651                            .dwattr $C$DW$549, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6652                            .dwattr $C$DW$549, DW_AT_decl_line(0xee)
    6653                            .dwattr $C$DW$549, DW_AT_decl_column(0x0f)
    6654                    
    6655                    $C$DW$550       .dwtag  DW_TAG_member
    6656                            .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$22)
    6657                            .dwattr $C$DW$550, DW_AT_name("bEnaCmd")
    6658                            .dwattr $C$DW$550, DW_AT_TI_symbol_name("bEnaCmd")
    6659                            .dwattr $C$DW$550, DW_AT_bit_offset(0x03)
    6660                            .dwattr $C$DW$550, DW_AT_bit_size(0x01)
    6661                            .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6662                            .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    6663                            .dwattr $C$DW$550, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6664                            .dwattr $C$DW$550, DW_AT_decl_line(0xef)
    6665                            .dwattr $C$DW$550, DW_AT_decl_column(0x0f)
    6666                    
    6667                    $C$DW$551       .dwtag  DW_TAG_member
    6668                            .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$22)
    6669                            .dwattr $C$DW$551, DW_AT_name("triggerNo")
    6670                            .dwattr $C$DW$551, DW_AT_TI_symbol_name("triggerNo")
    6671                            .dwattr $C$DW$551, DW_AT_bit_offset(0x01)
    6672                            .dwattr $C$DW$551, DW_AT_bit_size(0x02)
    6673                            .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6674                            .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    6675                            .dwattr $C$DW$551, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6676                            .dwattr $C$DW$551, DW_AT_decl_line(0xf1)
    6677                            .dwattr $C$DW$551, DW_AT_decl_column(0x0f)
    6678                    
    6679                    $C$DW$552       .dwtag  DW_TAG_member
    6680                            .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$22)
    6681                            .dwattr $C$DW$552, DW_AT_name("pastTrig")
    6682                            .dwattr $C$DW$552, DW_AT_TI_symbol_name("pastTrig")
    6683                            .dwattr $C$DW$552, DW_AT_bit_offset(0x00)
    6684                            .dwattr $C$DW$552, DW_AT_bit_size(0x01)
    6685                            .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6686                            .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    6687                            .dwattr $C$DW$552, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6688                            .dwattr $C$DW$552, DW_AT_decl_line(0xf2)
    6689                            .dwattr $C$DW$552, DW_AT_decl_column(0x0f)
    6690                    
    6691                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6692                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xed)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:11 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{BB41C441-43C9-4E57-87FA-3353477D1DAA} PAGE  124

    6693                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x0b)
    6694                            .dwendtag $C$DW$T$56
    6695                    
    6696                    
    6697                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    6698                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
    6699                    $C$DW$553       .dwtag  DW_TAG_member
    6700                            .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$22)
    6701                            .dwattr $C$DW$553, DW_AT_name("rule")
    6702                            .dwattr $C$DW$553, DW_AT_TI_symbol_name("rule")
    6703                            .dwattr $C$DW$553, DW_AT_bit_offset(0x04)
