TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Nov 28 13:22:08 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/OSAL/osal_clock.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Adrian\workspace_v8\collector_cc1350lp\collector_cc
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    1211                            .dwendtag $C$DW$T$185
    1212                    
    1213                    $C$DW$T$186     .dwtag  DW_TAG_typedef
    1214                            .dwattr $C$DW$T$186, DW_AT_name("tFlashStateCommandsType")
    1215                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$185)
    1216                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    1217                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    1218                            .dwattr $C$DW$T$186, DW_AT_decl_line(0xb0)
    1219                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x03)
    1220                    
    1221                    
    1222                    $C$DW$T$187     .dwtag  DW_TAG_enumeration_type
    1223                            .dwattr $C$DW$T$187, DW_AT_byte_size(0x01)
    1224                    $C$DW$64        .dwtag  DW_TAG_enumerator
    1225                            .dwattr $C$DW$64, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    1226                            .dwattr $C$DW$64, DW_AT_const_value(0xe0)
    1227                            .dwattr $C$DW$64, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1228                            .dwattr $C$DW$64, DW_AT_decl_line(0x3de)
    1229                            .dwattr $C$DW$64, DW_AT_decl_column(0x04)
    1230                    
    1231                    $C$DW$65        .dwtag  DW_TAG_enumerator
    1232                            .dwattr $C$DW$65, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    1233                            .dwattr $C$DW$65, DW_AT_const_value(0xe1)
    1234                            .dwattr $C$DW$65, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1235                            .dwattr $C$DW$65, DW_AT_decl_line(0x3e0)
    1236                            .dwattr $C$DW$65, DW_AT_decl_column(0x04)
    1237                    
    1238                    $C$DW$66        .dwtag  DW_TAG_enumerator
    1239                            .dwattr $C$DW$66, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    1240                            .dwattr $C$DW$66, DW_AT_const_value(0xe2)
    1241                            .dwattr $C$DW$66, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1242                            .dwattr $C$DW$66, DW_AT_decl_line(0x3e2)
    1243                            .dwattr $C$DW$66, DW_AT_decl_column(0x04)
    1244                    
    1245                    $C$DW$67        .dwtag  DW_TAG_enumerator
    1246                            .dwattr $C$DW$67, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    1247                            .dwattr $C$DW$67, DW_AT_const_value(0xe3)
    1248                            .dwattr $C$DW$67, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1249                            .dwattr $C$DW$67, DW_AT_decl_line(0x3e4)
    1250                            .dwattr $C$DW$67, DW_AT_decl_column(0x04)
    1251                    
    1252                    $C$DW$68        .dwtag  DW_TAG_enumerator
    1253                            .dwattr $C$DW$68, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    1254                            .dwattr $C$DW$68, DW_AT_const_value(0xe4)
    1255                            .dwattr $C$DW$68, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1256                            .dwattr $C$DW$68, DW_AT_decl_line(0x3e6)
    1257                            .dwattr $C$DW$68, DW_AT_decl_column(0x04)
    1258                    
    1259                    $C$DW$69        .dwtag  DW_TAG_enumerator
    1260                            .dwattr $C$DW$69, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   24

    1261                            .dwattr $C$DW$69, DW_AT_const_value(0xe5)
    1262                            .dwattr $C$DW$69, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1263                            .dwattr $C$DW$69, DW_AT_decl_line(0x3e8)
    1264                            .dwattr $C$DW$69, DW_AT_decl_column(0x04)
    1265                    
    1266                            .dwattr $C$DW$T$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1267                            .dwattr $C$DW$T$187, DW_AT_decl_line(0x3dc)
    1268                            .dwattr $C$DW$T$187, DW_AT_decl_column(0x01)
    1269                            .dwendtag $C$DW$T$187
    1270                    
    1271                    $C$DW$T$188     .dwtag  DW_TAG_typedef
    1272                            .dwattr $C$DW$T$188, DW_AT_name("ICall_RemotiCmdEvent_t")
    1273                            .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$187)
    1274                            .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    1275                            .dwattr $C$DW$T$188, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1276                            .dwattr $C$DW$T$188, DW_AT_decl_line(0x3e9)
    1277                            .dwattr $C$DW$T$188, DW_AT_decl_column(0x02)
    1278                    
    1279                    
    1280                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1281                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
    1282                    $C$DW$70        .dwtag  DW_TAG_member
    1283                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$21)
    1284                            .dwattr $C$DW$70, DW_AT_name("seconds")
    1285                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("seconds")
    1286                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1287                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1288                            .dwattr $C$DW$70, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1289                            .dwattr $C$DW$70, DW_AT_decl_line(0x50)
    1290                            .dwattr $C$DW$70, DW_AT_decl_column(0x09)
    1291                    
    1292                    $C$DW$71        .dwtag  DW_TAG_member
    1293                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$21)
    1294                            .dwattr $C$DW$71, DW_AT_name("minutes")
    1295                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("minutes")
    1296                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1297                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1298                            .dwattr $C$DW$71, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1299                            .dwattr $C$DW$71, DW_AT_decl_line(0x51)
    1300                            .dwattr $C$DW$71, DW_AT_decl_column(0x09)
    1301                    
    1302                    $C$DW$72        .dwtag  DW_TAG_member
    1303                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$21)
    1304                            .dwattr $C$DW$72, DW_AT_name("hour")
    1305                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("hour")
    1306                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1307                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1308                            .dwattr $C$DW$72, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1309                            .dwattr $C$DW$72, DW_AT_decl_line(0x52)
    1310                            .dwattr $C$DW$72, DW_AT_decl_column(0x09)
    1311                    
    1312                    $C$DW$73        .dwtag  DW_TAG_member
    1313                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$21)
    1314                            .dwattr $C$DW$73, DW_AT_name("day")
    1315                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("day")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   25

    1316                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1317                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1318                            .dwattr $C$DW$73, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1319                            .dwattr $C$DW$73, DW_AT_decl_line(0x53)
    1320                            .dwattr $C$DW$73, DW_AT_decl_column(0x09)
    1321                    
    1322                    $C$DW$74        .dwtag  DW_TAG_member
    1323                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
    1324                            .dwattr $C$DW$74, DW_AT_name("month")
    1325                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("month")
    1326                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1327                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1328                            .dwattr $C$DW$74, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1329                            .dwattr $C$DW$74, DW_AT_decl_line(0x54)
    1330                            .dwattr $C$DW$74, DW_AT_decl_column(0x09)
    1331                    
    1332                    $C$DW$75        .dwtag  DW_TAG_member
    1333                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$22)
    1334                            .dwattr $C$DW$75, DW_AT_name("year")
    1335                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("year")
    1336                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1337                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1338                            .dwattr $C$DW$75, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1339                            .dwattr $C$DW$75, DW_AT_decl_line(0x55)
    1340                            .dwattr $C$DW$75, DW_AT_decl_column(0x0a)
    1341                    
    1342                            .dwattr $C$DW$T$23, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1343                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x4f)
    1344                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
    1345                            .dwendtag $C$DW$T$23
    1346                    
    1347                    $C$DW$T$189     .dwtag  DW_TAG_typedef
    1348                            .dwattr $C$DW$T$189, DW_AT_name("UTCTimeStruct")
    1349                            .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$23)
    1350                            .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    1351                            .dwattr $C$DW$T$189, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1352                            .dwattr $C$DW$T$189, DW_AT_decl_line(0x56)
    1353                            .dwattr $C$DW$T$189, DW_AT_decl_column(0x03)
    1354                    
    1355                    $C$DW$T$190     .dwtag  DW_TAG_pointer_type
    1356                            .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$189)
    1357                            .dwattr $C$DW$T$190, DW_AT_address_class(0x20)
    1358                    
    1359                    $C$DW$T$191     .dwtag  DW_TAG_const_type
    1360                            .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$190)
    1361                    
    1362                    
    1363                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1364                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    1365                    $C$DW$76        .dwtag  DW_TAG_member
    1366                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$14)
    1367                            .dwattr $C$DW$76, DW_AT_name("__max_align1")
    1368                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("__max_align1")
    1369                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1370                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   26

    1371                            .dwattr $C$DW$76, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/sy
    1372                            .dwattr $C$DW$76, DW_AT_decl_line(0x70)
    1373                            .dwattr $C$DW$76, DW_AT_decl_column(0x0c)
    1374                    
    1375                    $C$DW$77        .dwtag  DW_TAG_member
    1376                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$18)
    1377                            .dwattr $C$DW$77, DW_AT_name("__max_align2")
    1378                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("__max_align2")
    1379                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1380                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1381                            .dwattr $C$DW$77, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/sy
    1382                            .dwattr $C$DW$77, DW_AT_decl_line(0x71)
    1383                            .dwattr $C$DW$77, DW_AT_decl_column(0x0e)
    1384                    
    1385                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    1386                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x6f)
    1387                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    1388                            .dwendtag $C$DW$T$24
    1389                    
    1390                    $C$DW$T$194     .dwtag  DW_TAG_typedef
    1391                            .dwattr $C$DW$T$194, DW_AT_name("__max_align_t")
    1392                            .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$24)
    1393                            .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    1394                            .dwattr $C$DW$T$194, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1395                            .dwattr $C$DW$T$194, DW_AT_decl_line(0x72)
    1396                            .dwattr $C$DW$T$194, DW_AT_decl_column(0x03)
    1397                    
    1398                    
    1399                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
    1400                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x4c)
    1401                    $C$DW$78        .dwtag  DW_TAG_member
    1402                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$32)
    1403                            .dwattr $C$DW$78, DW_AT_name("Crc32")
    1404                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("Crc32")
    1405                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1406                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1407                            .dwattr $C$DW$78, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1408                            .dwattr $C$DW$78, DW_AT_decl_line(0x76)
    1409                            .dwattr $C$DW$78, DW_AT_decl_column(0x25)
    1410                    
    1411                    $C$DW$79        .dwtag  DW_TAG_member
    1412                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$35)
    1413                            .dwattr $C$DW$79, DW_AT_name("FlashGetSize")
    1414                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("FlashGetSize")
    1415                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1416                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1417                            .dwattr $C$DW$79, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1418                            .dwattr $C$DW$79, DW_AT_decl_line(0x77)
    1419                            .dwattr $C$DW$79, DW_AT_decl_column(0x25)
    1420                    
    1421                    $C$DW$80        .dwtag  DW_TAG_member
    1422                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$36)
    1423                            .dwattr $C$DW$80, DW_AT_name("GetChipId")
    1424                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("GetChipId")
    1425                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   27

    1426                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1427                            .dwattr $C$DW$80, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1428                            .dwattr $C$DW$80, DW_AT_decl_line(0x78)
    1429                            .dwattr $C$DW$80, DW_AT_decl_column(0x25)
    1430                    
    1431                    $C$DW$81        .dwtag  DW_TAG_member
    1432                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$39)
    1433                            .dwattr $C$DW$81, DW_AT_name("ReservedLocation1")
    1434                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("ReservedLocation1")
    1435                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1436                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1437                            .dwattr $C$DW$81, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1438                            .dwattr $C$DW$81, DW_AT_decl_line(0x79)
    1439                            .dwattr $C$DW$81, DW_AT_decl_column(0x25)
    1440                    
    1441                    $C$DW$82        .dwtag  DW_TAG_member
    1442                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$40)
    1443                            .dwattr $C$DW$82, DW_AT_name("ReservedLocation2")
    1444                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("ReservedLocation2")
    1445                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1446                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1447                            .dwattr $C$DW$82, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1448                            .dwattr $C$DW$82, DW_AT_decl_line(0x7a)
    1449                            .dwattr $C$DW$82, DW_AT_decl_column(0x25)
    1450                    
    1451                    $C$DW$83        .dwtag  DW_TAG_member
    1452                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$41)
    1453                            .dwattr $C$DW$83, DW_AT_name("ReservedLocation3")
    1454                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("ReservedLocation3")
    1455                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1456                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1457                            .dwattr $C$DW$83, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1458                            .dwattr $C$DW$83, DW_AT_decl_line(0x7b)
    1459                            .dwattr $C$DW$83, DW_AT_decl_column(0x25)
    1460                    
    1461                    $C$DW$84        .dwtag  DW_TAG_member
    1462                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$44)
    1463                            .dwattr $C$DW$84, DW_AT_name("ResetDevice")
    1464                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("ResetDevice")
    1465                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1466                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1467                            .dwattr $C$DW$84, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1468                            .dwattr $C$DW$84, DW_AT_decl_line(0x7c)
    1469                            .dwattr $C$DW$84, DW_AT_decl_column(0x25)
    1470                    
    1471                    $C$DW$85        .dwtag  DW_TAG_member
    1472                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$50)
    1473                            .dwattr $C$DW$85, DW_AT_name("Fletcher32")
    1474                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("Fletcher32")
    1475                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1476                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1477                            .dwattr $C$DW$85, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1478                            .dwattr $C$DW$85, DW_AT_decl_line(0x7d)
    1479                            .dwattr $C$DW$85, DW_AT_decl_column(0x25)
    1480                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   28

    1481                    $C$DW$86        .dwtag  DW_TAG_member
    1482                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$54)
    1483                            .dwattr $C$DW$86, DW_AT_name("MinValue")
    1484                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("MinValue")
    1485                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1486                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1487                            .dwattr $C$DW$86, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1488                            .dwattr $C$DW$86, DW_AT_decl_line(0x7e)
    1489                            .dwattr $C$DW$86, DW_AT_decl_column(0x25)
    1490                    
    1491                    $C$DW$87        .dwtag  DW_TAG_member
    1492                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$55)
    1493                            .dwattr $C$DW$87, DW_AT_name("MaxValue")
    1494                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("MaxValue")
    1495                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1496                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1497                            .dwattr $C$DW$87, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1498                            .dwattr $C$DW$87, DW_AT_decl_line(0x7f)
    1499                            .dwattr $C$DW$87, DW_AT_decl_column(0x25)
    1500                    
    1501                    $C$DW$88        .dwtag  DW_TAG_member
    1502                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$56)
    1503                            .dwattr $C$DW$88, DW_AT_name("MeanValue")
    1504                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("MeanValue")
    1505                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1506                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1507                            .dwattr $C$DW$88, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1508                            .dwattr $C$DW$88, DW_AT_decl_line(0x80)
    1509                            .dwattr $C$DW$88, DW_AT_decl_column(0x25)
    1510                    
    1511                    $C$DW$89        .dwtag  DW_TAG_member
    1512                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$57)
    1513                            .dwattr $C$DW$89, DW_AT_name("StandDeviationValue")
    1514                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("StandDeviationValue")
    1515                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1516                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1517                            .dwattr $C$DW$89, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1518                            .dwattr $C$DW$89, DW_AT_decl_line(0x81)
    1519                            .dwattr $C$DW$89, DW_AT_decl_column(0x25)
    1520                    
    1521                    $C$DW$90        .dwtag  DW_TAG_member
    1522                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$60)
    1523                            .dwattr $C$DW$90, DW_AT_name("ReservedLocation4")
    1524                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("ReservedLocation4")
    1525                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1526                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1527                            .dwattr $C$DW$90, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1528                            .dwattr $C$DW$90, DW_AT_decl_line(0x82)
    1529                            .dwattr $C$DW$90, DW_AT_decl_column(0x25)
    1530                    
    1531                    $C$DW$91        .dwtag  DW_TAG_member
    1532                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$61)
    1533                            .dwattr $C$DW$91, DW_AT_name("ReservedLocation5")
    1534                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("ReservedLocation5")
    1535                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   29

    1536                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1537                            .dwattr $C$DW$91, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1538                            .dwattr $C$DW$91, DW_AT_decl_line(0x83)
    1539                            .dwattr $C$DW$91, DW_AT_decl_column(0x25)
    1540                    
    1541                    $C$DW$92        .dwtag  DW_TAG_member
    1542                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$62)
    1543                            .dwattr $C$DW$92, DW_AT_name("HFSourceSafeSwitch")
    1544                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    1545                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1546                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1547                            .dwattr $C$DW$92, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1548                            .dwattr $C$DW$92, DW_AT_decl_line(0x84)
    1549                            .dwattr $C$DW$92, DW_AT_decl_column(0x25)
    1550                    
    1551                    $C$DW$93        .dwtag  DW_TAG_member
    1552                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$65)
    1553                            .dwattr $C$DW$93, DW_AT_name("SelectCompAInput")
    1554                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("SelectCompAInput")
    1555                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1556                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1557                            .dwattr $C$DW$93, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1558                            .dwattr $C$DW$93, DW_AT_decl_line(0x85)
    1559                            .dwattr $C$DW$93, DW_AT_decl_column(0x25)
    1560                    
    1561                    $C$DW$94        .dwtag  DW_TAG_member
    1562                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$66)
    1563                            .dwattr $C$DW$94, DW_AT_name("SelectCompARef")
    1564                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("SelectCompARef")
    1565                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1566                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1567                            .dwattr $C$DW$94, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1568                            .dwattr $C$DW$94, DW_AT_decl_line(0x86)
    1569                            .dwattr $C$DW$94, DW_AT_decl_column(0x25)
    1570                    
    1571                    $C$DW$95        .dwtag  DW_TAG_member
    1572                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$67)
    1573                            .dwattr $C$DW$95, DW_AT_name("SelectADCCompBInput")
    1574                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("SelectADCCompBInput")
    1575                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1576                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1577                            .dwattr $C$DW$95, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1578                            .dwattr $C$DW$95, DW_AT_decl_line(0x87)
    1579                            .dwattr $C$DW$95, DW_AT_decl_column(0x25)
    1580                    
    1581                    $C$DW$96        .dwtag  DW_TAG_member
    1582                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$68)
    1583                            .dwattr $C$DW$96, DW_AT_name("SelectCompBRef")
    1584                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("SelectCompBRef")
    1585                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1586                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1587                            .dwattr $C$DW$96, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1588                            .dwattr $C$DW$96, DW_AT_decl_line(0x88)
    1589                            .dwattr $C$DW$96, DW_AT_decl_column(0x25)
    1590                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   30

    1591                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1592                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x75)
    1593                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x01)
    1594                            .dwendtag $C$DW$T$69
    1595                    
    1596                    $C$DW$T$195     .dwtag  DW_TAG_typedef
    1597                            .dwattr $C$DW$T$195, DW_AT_name("HARD_API_T")
    1598                            .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$69)
    1599                            .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
    1600                            .dwattr $C$DW$T$195, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    1601                            .dwattr $C$DW$T$195, DW_AT_decl_line(0x89)
    1602                            .dwattr $C$DW$T$195, DW_AT_decl_column(0x03)
    1603                    
    1604                    
    1605                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    1606                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x08)
    1607                    $C$DW$97        .dwtag  DW_TAG_member
    1608                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$10)
    1609                            .dwattr $C$DW$97, DW_AT_name("quot")
    1610                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("quot")
    1611                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1612                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1613                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/st
    1614                            .dwattr $C$DW$97, DW_AT_decl_line(0x49)
    1615                            .dwattr $C$DW$97, DW_AT_decl_column(0x16)
    1616                    
    1617                    $C$DW$98        .dwtag  DW_TAG_member
    1618                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$10)
    1619                            .dwattr $C$DW$98, DW_AT_name("rem")
    1620                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("rem")
    1621                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1622                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1623                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/st
    1624                            .dwattr $C$DW$98, DW_AT_decl_line(0x49)
    1625                            .dwattr $C$DW$98, DW_AT_decl_column(0x1c)
    1626                    
    1627                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    1628                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x49)
    1629                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x10)
    1630                            .dwendtag $C$DW$T$70
    1631                    
    1632                    $C$DW$T$196     .dwtag  DW_TAG_typedef
    1633                            .dwattr $C$DW$T$196, DW_AT_name("div_t")
    1634                            .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$70)
    1635                            .dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)
    1636                            .dwattr $C$DW$T$196, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1637                            .dwattr $C$DW$T$196, DW_AT_decl_line(0x49)
    1638                            .dwattr $C$DW$T$196, DW_AT_decl_column(0x23)
    1639                    
    1640                    
    1641                    $C$DW$T$71      .dwtag  DW_TAG_structure_type
    1642                            .dwattr $C$DW$T$71, DW_AT_byte_size(0x08)
    1643                    $C$DW$99        .dwtag  DW_TAG_member
    1644                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$10)
    1645                            .dwattr $C$DW$99, DW_AT_name("quot")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   31

    1646                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("quot")
    1647                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1649                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/st
    1650                            .dwattr $C$DW$99, DW_AT_decl_line(0x4e)
    1651                            .dwattr $C$DW$99, DW_AT_decl_column(0x16)
    1652                    
    1653                    $C$DW$100       .dwtag  DW_TAG_member
    1654                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$10)
    1655                            .dwattr $C$DW$100, DW_AT_name("rem")
    1656                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("rem")
    1657                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1658                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1659                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    1660                            .dwattr $C$DW$100, DW_AT_decl_line(0x4e)
    1661                            .dwattr $C$DW$100, DW_AT_decl_column(0x1c)
    1662                    
    1663                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    1664                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x4e)
    1665                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x10)
    1666                            .dwendtag $C$DW$T$71
    1667                    
    1668                    $C$DW$T$197     .dwtag  DW_TAG_typedef
    1669                            .dwattr $C$DW$T$197, DW_AT_name("ldiv_t")
    1670                            .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$71)
    1671                            .dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
    1672                            .dwattr $C$DW$T$197, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1673                            .dwattr $C$DW$T$197, DW_AT_decl_line(0x4e)
    1674                            .dwattr $C$DW$T$197, DW_AT_decl_column(0x23)
    1675                    
    1676                    
    1677                    $C$DW$T$72      .dwtag  DW_TAG_structure_type
    1678                            .dwattr $C$DW$T$72, DW_AT_byte_size(0x10)
    1679                    $C$DW$101       .dwtag  DW_TAG_member
    1680                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$14)
    1681                            .dwattr $C$DW$101, DW_AT_name("quot")
    1682                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("quot")
    1683                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1684                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1685                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    1686                            .dwattr $C$DW$101, DW_AT_decl_line(0x56)
    1687                            .dwattr $C$DW$101, DW_AT_decl_column(0x1c)
    1688                    
    1689                    $C$DW$102       .dwtag  DW_TAG_member
    1690                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$14)
    1691                            .dwattr $C$DW$102, DW_AT_name("rem")
    1692                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("rem")
    1693                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1694                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1695                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    1696                            .dwattr $C$DW$102, DW_AT_decl_line(0x56)
    1697                            .dwattr $C$DW$102, DW_AT_decl_column(0x22)
    1698                    
    1699                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    1700                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x56)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   32

    1701                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x10)
    1702                            .dwendtag $C$DW$T$72
    1703                    
    1704                    $C$DW$T$198     .dwtag  DW_TAG_typedef
    1705                            .dwattr $C$DW$T$198, DW_AT_name("lldiv_t")
    1706                            .dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$72)
    1707                            .dwattr $C$DW$T$198, DW_AT_language(DW_LANG_C)
    1708                            .dwattr $C$DW$T$198, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    1709                            .dwattr $C$DW$T$198, DW_AT_decl_line(0x56)
    1710                            .dwattr $C$DW$T$198, DW_AT_decl_column(0x29)
    1711                    
    1712                    
    1713                    $C$DW$T$77      .dwtag  DW_TAG_structure_type
    1714                            .dwattr $C$DW$T$77, DW_AT_byte_size(0x08)
    1715                    $C$DW$103       .dwtag  DW_TAG_member
    1716                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$75)
    1717                            .dwattr $C$DW$103, DW_AT_name("pointerStack")
    1718                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("pointerStack")
    1719                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1720                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1721                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1722                            .dwattr $C$DW$103, DW_AT_decl_line(0x3f5)
    1723                            .dwattr $C$DW$103, DW_AT_decl_column(0x16)
    1724                    
    1725                    $C$DW$104       .dwtag  DW_TAG_member
    1726                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$76)
    1727                            .dwattr $C$DW$104, DW_AT_name("directAPI")
    1728                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("directAPI")
    1729                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1730                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1731                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1732                            .dwattr $C$DW$104, DW_AT_decl_line(0x3f6)
    1733                            .dwattr $C$DW$104, DW_AT_decl_column(0x15)
    1734                    
    1735                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1736                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x3f4)
    1737                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x01)
    1738                            .dwendtag $C$DW$T$77
    1739                    
    1740                    $C$DW$T$79      .dwtag  DW_TAG_typedef
    1741                            .dwattr $C$DW$T$79, DW_AT_name("icall_directAPIMsg_t")
    1742                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$77)
    1743                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1744                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1745                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x3f7)
    1746                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
    1747                    
    1748                    
    1749                    $C$DW$T$80      .dwtag  DW_TAG_structure_type
    1750                            .dwattr $C$DW$T$80, DW_AT_byte_size(0x14)
    1751                    $C$DW$105       .dwtag  DW_TAG_member
    1752                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$78)
    1753                            .dwattr $C$DW$105, DW_AT_name("hdr")
    1754                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("hdr")
    1755                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   33

    1756                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1757                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1758                            .dwattr $C$DW$105, DW_AT_decl_line(0x3fb)
    1759                            .dwattr $C$DW$105, DW_AT_decl_column(0x10)
    1760                    
    1761                    $C$DW$106       .dwtag  DW_TAG_member
    1762                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$79)
    1763                            .dwattr $C$DW$106, DW_AT_name("msg")
    1764                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("msg")
    1765                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1766                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1767                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1768                            .dwattr $C$DW$106, DW_AT_decl_line(0x3fc)
    1769                            .dwattr $C$DW$106, DW_AT_decl_column(0x1a)
    1770                    
    1771                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1772                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x3fa)
    1773                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x01)
    1774                            .dwendtag $C$DW$T$80
    1775                    
    1776                    $C$DW$T$199     .dwtag  DW_TAG_typedef
    1777                            .dwattr $C$DW$T$199, DW_AT_name("icallLiteMsg_t")
    1778                            .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$80)
    1779                            .dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
    1780                            .dwattr $C$DW$T$199, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1781                            .dwattr $C$DW$T$199, DW_AT_decl_line(0x3fd)
    1782                            .dwattr $C$DW$T$199, DW_AT_decl_column(0x03)
    1783                    
    1784                    
    1785                    $C$DW$T$83      .dwtag  DW_TAG_structure_type
    1786                            .dwattr $C$DW$T$83, DW_AT_byte_size(0x0c)
    1787                    $C$DW$107       .dwtag  DW_TAG_member
    1788                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$81)
    1789                            .dwattr $C$DW$107, DW_AT_name("bufferHead")
    1790                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("bufferHead")
    1791                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1792                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1793                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1794                            .dwattr $C$DW$107, DW_AT_decl_line(0x80)
    1795                            .dwattr $C$DW$107, DW_AT_decl_column(0x13)
    1796                    
    1797                    $C$DW$108       .dwtag  DW_TAG_member
    1798                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$81)
    1799                            .dwattr $C$DW$108, DW_AT_name("bufferTail")
    1800                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("bufferTail")
    1801                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1802                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1803                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1804                            .dwattr $C$DW$108, DW_AT_decl_line(0x81)
    1805                            .dwattr $C$DW$108, DW_AT_decl_column(0x13)
    1806                    
    1807                    $C$DW$109       .dwtag  DW_TAG_member
    1808                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$22)
    1809                            .dwattr $C$DW$109, DW_AT_name("maxBufSize")
    1810                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("maxBufSize")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   34

    1811                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1812                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1813                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1814                            .dwattr $C$DW$109, DW_AT_decl_line(0x82)
    1815                            .dwattr $C$DW$109, DW_AT_decl_column(0x0a)
    1816                    
    1817                    $C$DW$110       .dwtag  DW_TAG_member
    1818                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$82)
    1819                            .dwattr $C$DW$110, DW_AT_name("pBuffer")
    1820                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("pBuffer")
    1821                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1822                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1823                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1824                            .dwattr $C$DW$110, DW_AT_decl_line(0x83)
    1825                            .dwattr $C$DW$110, DW_AT_decl_column(0x0a)
    1826                    
    1827                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1828                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x7e)
    1829                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x01)
    1830                            .dwendtag $C$DW$T$83
    1831                    
    1832                    $C$DW$T$85      .dwtag  DW_TAG_typedef
    1833                            .dwattr $C$DW$T$85, DW_AT_name("halUARTBufControl_t")
    1834                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$83)
    1835                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1836                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1837                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x84)
    1838                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x03)
    1839                    
    1840                    
    1841                    $C$DW$T$90      .dwtag  DW_TAG_structure_type
    1842                            .dwattr $C$DW$T$90, DW_AT_byte_size(0x2c)
    1843                    $C$DW$111       .dwtag  DW_TAG_member
    1844                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$84)
    1845                            .dwattr $C$DW$111, DW_AT_name("configured")
    1846                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("configured")
    1847                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1848                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1849                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1850                            .dwattr $C$DW$111, DW_AT_decl_line(0x88)
    1851                            .dwattr $C$DW$111, DW_AT_decl_column(0x17)
    1852                    
    1853                    $C$DW$112       .dwtag  DW_TAG_member
    1854                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$21)
    1855                            .dwattr $C$DW$112, DW_AT_name("baudRate")
    1856                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("baudRate")
    1857                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1858                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1859                            .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1860                            .dwattr $C$DW$112, DW_AT_decl_line(0x89)
    1861                            .dwattr $C$DW$112, DW_AT_decl_column(0x17)
    1862                    
    1863                    $C$DW$113       .dwtag  DW_TAG_member
    1864                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$84)
    1865                            .dwattr $C$DW$113, DW_AT_name("flowControl")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   35

    1866                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("flowControl")
    1867                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1868                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1869                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1870                            .dwattr $C$DW$113, DW_AT_decl_line(0x8a)
    1871                            .dwattr $C$DW$113, DW_AT_decl_column(0x17)
    1872                    
    1873                    $C$DW$114       .dwtag  DW_TAG_member
    1874                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$22)
    1875                            .dwattr $C$DW$114, DW_AT_name("flowControlThreshold")
    1876                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("flowControlThreshold")
    1877                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1878                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1879                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1880                            .dwattr $C$DW$114, DW_AT_decl_line(0x8b)
    1881                            .dwattr $C$DW$114, DW_AT_decl_column(0x17)
    1882                    
    1883                    $C$DW$115       .dwtag  DW_TAG_member
    1884                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$21)
    1885                            .dwattr $C$DW$115, DW_AT_name("idleTimeout")
    1886                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("idleTimeout")
    1887                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1888                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1889                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1890                            .dwattr $C$DW$115, DW_AT_decl_line(0x8c)
    1891                            .dwattr $C$DW$115, DW_AT_decl_column(0x17)
    1892                    
    1893                    $C$DW$116       .dwtag  DW_TAG_member
    1894                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$85)
    1895                            .dwattr $C$DW$116, DW_AT_name("rx")
    1896                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("rx")
    1897                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1898                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1899                            .dwattr $C$DW$116, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1900                            .dwattr $C$DW$116, DW_AT_decl_line(0x8d)
    1901                            .dwattr $C$DW$116, DW_AT_decl_column(0x17)
    1902                    
    1903                    $C$DW$117       .dwtag  DW_TAG_member
    1904                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$85)
    1905                            .dwattr $C$DW$117, DW_AT_name("tx")
    1906                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("tx")
    1907                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1908                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1909                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1910                            .dwattr $C$DW$117, DW_AT_decl_line(0x8e)
    1911                            .dwattr $C$DW$117, DW_AT_decl_column(0x17)
    1912                    
    1913                    $C$DW$118       .dwtag  DW_TAG_member
    1914                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$84)
    1915                            .dwattr $C$DW$118, DW_AT_name("intEnable")
    1916                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("intEnable")
    1917                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1918                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1919                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1920                            .dwattr $C$DW$118, DW_AT_decl_line(0x8f)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   36

    1921                            .dwattr $C$DW$118, DW_AT_decl_column(0x17)
    1922                    
    1923                    $C$DW$119       .dwtag  DW_TAG_member
    1924                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$86)
    1925                            .dwattr $C$DW$119, DW_AT_name("rxChRvdTime")
    1926                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("rxChRvdTime")
    1927                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1928                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1929                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1930                            .dwattr $C$DW$119, DW_AT_decl_line(0x90)
    1931                            .dwattr $C$DW$119, DW_AT_decl_column(0x17)
    1932                    
    1933                    $C$DW$120       .dwtag  DW_TAG_member
    1934                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$89)
    1935                            .dwattr $C$DW$120, DW_AT_name("callBackFunc")
    1936                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("callBackFunc")
    1937                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1938                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1939                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1940                            .dwattr $C$DW$120, DW_AT_decl_line(0x91)
    1941                            .dwattr $C$DW$120, DW_AT_decl_column(0x17)
    1942                    
    1943                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1944                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x87)
    1945                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x01)
    1946                            .dwendtag $C$DW$T$90
    1947                    
    1948                    $C$DW$T$200     .dwtag  DW_TAG_typedef
    1949                            .dwattr $C$DW$T$200, DW_AT_name("halUARTCfg_t")
    1950                            .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$90)
    1951                            .dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
    1952                            .dwattr $C$DW$T$200, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1953                            .dwattr $C$DW$T$200, DW_AT_decl_line(0x92)
    1954                            .dwattr $C$DW$T$200, DW_AT_decl_column(0x02)
    1955                    
    1956                    
    1957                    $C$DW$T$91      .dwtag  DW_TAG_structure_type
    1958                            .dwattr $C$DW$T$91, DW_AT_byte_size(0x02)
    1959                    $C$DW$121       .dwtag  DW_TAG_member
    1960                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$21)
    1961                            .dwattr $C$DW$121, DW_AT_name("event")
    1962                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("event")
    1963                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1964                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1965                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1966                            .dwattr $C$DW$121, DW_AT_decl_line(0x79)
    1967                            .dwattr $C$DW$121, DW_AT_decl_column(0x0a)
    1968                    
    1969                    $C$DW$122       .dwtag  DW_TAG_member
    1970                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$21)
    1971                            .dwattr $C$DW$122, DW_AT_name("status")
    1972                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("status")
    1973                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1974                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1975                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   37

    1976                            .dwattr $C$DW$122, DW_AT_decl_line(0x7a)
    1977                            .dwattr $C$DW$122, DW_AT_decl_column(0x0a)
    1978                    
    1979                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1980                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x78)
    1981                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x01)
    1982                            .dwendtag $C$DW$T$91
    1983                    
    1984                    $C$DW$T$92      .dwtag  DW_TAG_typedef
    1985                            .dwattr $C$DW$T$92, DW_AT_name("osal_event_hdr_t")
    1986                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    1987                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    1988                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1989                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x7b)
    1990                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x03)
    1991                    
    1992                    
    1993                    $C$DW$T$93      .dwtag  DW_TAG_structure_type
    1994                            .dwattr $C$DW$T$93, DW_AT_byte_size(0x04)
    1995                    $C$DW$123       .dwtag  DW_TAG_member
    1996                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$92)
    1997                            .dwattr $C$DW$123, DW_AT_name("hdr")
    1998                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("hdr")
    1999                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2000                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2001                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    2002                            .dwattr $C$DW$123, DW_AT_decl_line(0xbc)
    2003                            .dwattr $C$DW$123, DW_AT_decl_column(0x14)
    2004                    
    2005                    $C$DW$124       .dwtag  DW_TAG_member
    2006                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$21)
    2007                            .dwattr $C$DW$124, DW_AT_name("state")
    2008                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("state")
    2009                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2010                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2011                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    2012                            .dwattr $C$DW$124, DW_AT_decl_line(0xbd)
    2013                            .dwattr $C$DW$124, DW_AT_decl_column(0x09)
    2014                    
    2015                    $C$DW$125       .dwtag  DW_TAG_member
    2016                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$21)
    2017                            .dwattr $C$DW$125, DW_AT_name("keys")
    2018                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("keys")
    2019                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2020                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2021                            .dwattr $C$DW$125, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    2022                            .dwattr $C$DW$125, DW_AT_decl_line(0xbe)
    2023                            .dwattr $C$DW$125, DW_AT_decl_column(0x09)
    2024                    
    2025                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC13
    2026                            .dwattr $C$DW$T$93, DW_AT_decl_line(0xbb)
    2027                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x01)
    2028                            .dwendtag $C$DW$T$93
    2029                    
    2030                    $C$DW$T$201     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   38

    2031                            .dwattr $C$DW$T$201, DW_AT_name("keyChange_t")
    2032                            .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$93)
    2033                            .dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
    2034                            .dwattr $C$DW$T$201, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    2035                            .dwattr $C$DW$T$201, DW_AT_decl_line(0xbf)
    2036                            .dwattr $C$DW$T$201, DW_AT_decl_column(0x03)
    2037                    
    2038                    
    2039                    $C$DW$T$100     .dwtag  DW_TAG_union_type
    2040                            .dwattr $C$DW$T$100, DW_AT_byte_size(0x02)
    2041                    $C$DW$126       .dwtag  DW_TAG_member
    2042                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$96)
    2043                            .dwattr $C$DW$126, DW_AT_name("entityId")
    2044                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("entityId")
    2045                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2046                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2047                            .dwattr $C$DW$126, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2048                            .dwattr $C$DW$126, DW_AT_decl_line(0x1fe)
    2049                            .dwattr $C$DW$126, DW_AT_decl_column(0x14)
    2050                    
    2051                    $C$DW$127       .dwtag  DW_TAG_member
    2052                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$99)
    2053                            .dwattr $C$DW$127, DW_AT_name("servId")
    2054                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("servId")
    2055                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2056                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2057                            .dwattr $C$DW$127, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2058                            .dwattr $C$DW$127, DW_AT_decl_line(0x200)
    2059                            .dwattr $C$DW$127, DW_AT_decl_column(0x17)
    2060                    
    2061                            .dwattr $C$DW$T$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2062                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x1fc)
    2063                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x03)
    2064                            .dwendtag $C$DW$T$100
    2065                    
    2066                    
    2067                    $C$DW$T$101     .dwtag  DW_TAG_union_type
    2068                            .dwattr $C$DW$T$101, DW_AT_byte_size(0x02)
    2069                    $C$DW$128       .dwtag  DW_TAG_member
    2070                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$99)
    2071                            .dwattr $C$DW$128, DW_AT_name("servId")
    2072                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("servId")
    2073                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2074                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2075                            .dwattr $C$DW$128, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2076                            .dwattr $C$DW$128, DW_AT_decl_line(0x211)
    2077                            .dwattr $C$DW$128, DW_AT_decl_column(0x17)
    2078                    
    2079                    $C$DW$129       .dwtag  DW_TAG_member
    2080                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$96)
    2081                            .dwattr $C$DW$129, DW_AT_name("entityId")
    2082                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("entityId")
    2083                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2084                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2085                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   39

    2086                            .dwattr $C$DW$129, DW_AT_decl_line(0x213)
    2087                            .dwattr $C$DW$129, DW_AT_decl_column(0x14)
    2088                    
    2089                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2090                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x20f)
    2091                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x03)
    2092                            .dwendtag $C$DW$T$101
    2093                    
    2094                    
    2095                    $C$DW$T$102     .dwtag  DW_TAG_union_type
    2096                            .dwattr $C$DW$T$102, DW_AT_byte_size(0x02)
    2097                    $C$DW$130       .dwtag  DW_TAG_member
    2098                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$84)
    2099                            .dwattr $C$DW$130, DW_AT_name("paramCTS")
    2100                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("paramCTS")
    2101                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2102                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2103                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2104                            .dwattr $C$DW$130, DW_AT_decl_line(0x96)
    2105                            .dwattr $C$DW$130, DW_AT_decl_column(0x08)
    2106                    
    2107                    $C$DW$131       .dwtag  DW_TAG_member
    2108                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$84)
    2109                            .dwattr $C$DW$131, DW_AT_name("paramRTS")
    2110                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("paramRTS")
    2111                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2112                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2113                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2114                            .dwattr $C$DW$131, DW_AT_decl_line(0x97)
    2115                            .dwattr $C$DW$131, DW_AT_decl_column(0x08)
    2116                    
    2117                    $C$DW$132       .dwtag  DW_TAG_member
    2118                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$84)
    2119                            .dwattr $C$DW$132, DW_AT_name("paramDSR")
    2120                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("paramDSR")
    2121                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2122                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2123                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2124                            .dwattr $C$DW$132, DW_AT_decl_line(0x98)
    2125                            .dwattr $C$DW$132, DW_AT_decl_column(0x08)
    2126                    
    2127                    $C$DW$133       .dwtag  DW_TAG_member
    2128                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$84)
    2129                            .dwattr $C$DW$133, DW_AT_name("paramDTR")
    2130                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("paramDTR")
    2131                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2132                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2133                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2134                            .dwattr $C$DW$133, DW_AT_decl_line(0x99)
    2135                            .dwattr $C$DW$133, DW_AT_decl_column(0x08)
    2136                    
    2137                    $C$DW$134       .dwtag  DW_TAG_member
    2138                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$84)
    2139                            .dwattr $C$DW$134, DW_AT_name("paramCD")
    2140                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("paramCD")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   40

    2141                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2142                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2143                            .dwattr $C$DW$134, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2144                            .dwattr $C$DW$134, DW_AT_decl_line(0x9a)
    2145                            .dwattr $C$DW$134, DW_AT_decl_column(0x08)
    2146                    
    2147                    $C$DW$135       .dwtag  DW_TAG_member
    2148                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$84)
    2149                            .dwattr $C$DW$135, DW_AT_name("paramRI")
    2150                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("paramRI")
    2151                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2152                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2153                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2154                            .dwattr $C$DW$135, DW_AT_decl_line(0x9b)
    2155                            .dwattr $C$DW$135, DW_AT_decl_column(0x08)
    2156                    
    2157                    $C$DW$136       .dwtag  DW_TAG_member
    2158                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$22)
    2159                            .dwattr $C$DW$136, DW_AT_name("baudRate")
    2160                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("baudRate")
    2161                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2162                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2163                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2164                            .dwattr $C$DW$136, DW_AT_decl_line(0x9c)
    2165                            .dwattr $C$DW$136, DW_AT_decl_column(0x0a)
    2166                    
    2167                    $C$DW$137       .dwtag  DW_TAG_member
    2168                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$84)
    2169                            .dwattr $C$DW$137, DW_AT_name("flowControl")
    2170                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("flowControl")
    2171                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2172                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2173                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2174                            .dwattr $C$DW$137, DW_AT_decl_line(0x9d)
    2175                            .dwattr $C$DW$137, DW_AT_decl_column(0x08)
    2176                    
    2177                    $C$DW$138       .dwtag  DW_TAG_member
    2178                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$84)
    2179                            .dwattr $C$DW$138, DW_AT_name("flushControl")
    2180                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("flushControl")
    2181                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2182                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2183                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2184                            .dwattr $C$DW$138, DW_AT_decl_line(0x9e)
    2185                            .dwattr $C$DW$138, DW_AT_decl_column(0x08)
    2186                    
    2187                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2188                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x95)
    2189                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x01)
    2190                            .dwendtag $C$DW$T$102
    2191                    
    2192                    $C$DW$T$202     .dwtag  DW_TAG_typedef
    2193                            .dwattr $C$DW$T$202, DW_AT_name("halUARTIoctl_t")
    2194                            .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$102)
    2195                            .dwattr $C$DW$T$202, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   41

    2196                            .dwattr $C$DW$T$202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2197                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x9f)
    2198                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x02)
    2199                    
    2200                    
    2201                    $C$DW$T$103     .dwtag  DW_TAG_structure_type
    2202                            .dwattr $C$DW$T$103, DW_AT_name(".ggroup1")
    2203                            .dwattr $C$DW$T$103, DW_AT_byte_size(0x08)
    2204                    $C$DW$139       .dwtag  DW_TAG_member
    2205                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$11)
    2206                            .dwattr $C$DW$139, DW_AT_name("timeMSec")
    2207                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("timeMSec")
    2208                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2209                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2210                    
    2211                    $C$DW$140       .dwtag  DW_TAG_member
    2212                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$11)
    2213                            .dwattr $C$DW$140, DW_AT_name("OSAL_timeSeconds")
    2214                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("OSAL_timeSeconds")
    2215                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2216                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2217                    
    2218                            .dwendtag $C$DW$T$103
    2219                    
    2220                    
    2221                    $C$DW$T$104     .dwtag  DW_TAG_structure_type
    2222                            .dwattr $C$DW$T$104, DW_AT_name("_ICall_LiteCmdStatus_")
    2223                            .dwattr $C$DW$T$104, DW_AT_byte_size(0x01)
    2224                    $C$DW$141       .dwtag  DW_TAG_member
    2225                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$95)
    2226                            .dwattr $C$DW$141, DW_AT_name("cmdId")
    2227                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("cmdId")
    2228                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2229                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2230                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2231                            .dwattr $C$DW$141, DW_AT_decl_line(0x3f0)
    2232                            .dwattr $C$DW$141, DW_AT_decl_column(0x11)
    2233                    
    2234                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2235                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x3ee)
    2236                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x10)
    2237                            .dwendtag $C$DW$T$104
    2238                    
    2239                    $C$DW$T$204     .dwtag  DW_TAG_typedef
    2240                            .dwattr $C$DW$T$204, DW_AT_name("ICall_LiteCmdStatus")
    2241                            .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$104)
    2242                            .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
    2243                            .dwattr $C$DW$T$204, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2244                            .dwattr $C$DW$T$204, DW_AT_decl_line(0x3f1)
    2245                            .dwattr $C$DW$T$204, DW_AT_decl_column(0x03)
    2246                    
    2247                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2248                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2249                    
    2250                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   42

    2251                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2252                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2253                    
    2254                    $C$DW$T$205     .dwtag  DW_TAG_typedef
    2255                            .dwattr $C$DW$T$205, DW_AT_name("ICall_Semaphore")
    2256                            .dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$3)
    2257                            .dwattr $C$DW$T$205, DW_AT_language(DW_LANG_C)
    2258                            .dwattr $C$DW$T$205, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2259                            .dwattr $C$DW$T$205, DW_AT_decl_line(0x1ac)
    2260                            .dwattr $C$DW$T$205, DW_AT_decl_column(0x0f)
    2261                    
    2262                    $C$DW$T$120     .dwtag  DW_TAG_typedef
    2263                            .dwattr $C$DW$T$120, DW_AT_name("ICall_SyncHandle")
    2264                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$3)
    2265                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    2266                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2267                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x1aa)
    2268                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x0f)
    2269                    
    2270                    $C$DW$T$167     .dwtag  DW_TAG_typedef
    2271                            .dwattr $C$DW$T$167, DW_AT_name("ICall_TimerID")
    2272                            .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$3)
    2273                            .dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
    2274                            .dwattr $C$DW$T$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2275                            .dwattr $C$DW$T$167, DW_AT_decl_line(0x1b7)
    2276                            .dwattr $C$DW$T$167, DW_AT_decl_column(0x0f)
    2277                    
    2278                    $C$DW$T$206     .dwtag  DW_TAG_typedef
    2279                            .dwattr $C$DW$T$206, DW_AT_name("osal_msg_q_t")
    2280                            .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$3)
    2281                            .dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
    2282                            .dwattr $C$DW$T$206, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2283                            .dwattr $C$DW$T$206, DW_AT_decl_line(0x7d)
    2284                            .dwattr $C$DW$T$206, DW_AT_decl_column(0x10)
    2285                    
    2286                    
    2287                    $C$DW$T$42      .dwtag  DW_TAG_subroutine_type
    2288                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    2289                            .dwendtag $C$DW$T$42
    2290                    
    2291                    $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    2292                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2293                            .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    2294                    
    2295                    $C$DW$T$183     .dwtag  DW_TAG_typedef
    2296                            .dwattr $C$DW$T$183, DW_AT_name("APPASRTINTF_callAssrtHndler")
    2297                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$43)
    2298                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    2299                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2300                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x43)
    2301                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x10)
    2302                    
    2303                    $C$DW$T$62      .dwtag  DW_TAG_typedef
    2304                            .dwattr $C$DW$T$62, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
    2305                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$43)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   43

    2306                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2307                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    2308                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x5f)
    2309                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x19)
    2310                    
    2311                    $C$DW$T$44      .dwtag  DW_TAG_typedef
    2312                            .dwattr $C$DW$T$44, DW_AT_name("FPTR_RESETDEV_T")
    2313                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    2314                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2315                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    2316                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x4d)
    2317                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x19)
    2318                    
    2319                    $C$DW$T$207     .dwtag  DW_TAG_typedef
    2320                            .dwattr $C$DW$T$207, DW_AT_name("FPTR_VOID_VOID_T")
    2321                            .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$43)
    2322                            .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
    2323                            .dwattr $C$DW$T$207, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    2324                            .dwattr $C$DW$T$207, DW_AT_decl_line(0x33)
    2325                            .dwattr $C$DW$T$207, DW_AT_decl_column(0x11)
    2326                    
    2327                    $C$DW$T$208     .dwtag  DW_TAG_typedef
    2328                            .dwattr $C$DW$T$208, DW_AT_name("__TI_atexit_fn")
    2329                            .dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$43)
    2330                            .dwattr $C$DW$T$208, DW_AT_language(DW_LANG_C)
    2331                            .dwattr $C$DW$T$208, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    2332                            .dwattr $C$DW$T$208, DW_AT_decl_line(0xb2)
    2333                            .dwattr $C$DW$T$208, DW_AT_decl_column(0x14)
    2334                    
    2335                    
    2336                    $C$DW$T$58      .dwtag  DW_TAG_subroutine_type
    2337                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2338                    $C$DW$142       .dwtag  DW_TAG_formal_parameter
    2339                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$26)
    2340                    
    2341                            .dwendtag $C$DW$T$58
    2342                    
    2343                    $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    2344                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2345                            .dwattr $C$DW$T$59, DW_AT_address_class(0x20)
    2346                    
    2347                    $C$DW$T$60      .dwtag  DW_TAG_typedef
    2348                            .dwattr $C$DW$T$60, DW_AT_name("FPTR_RESERVED4_T")
    2349                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2350                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2351                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    2352                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x61)
    2353                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x19)
    2354                    
    2355                    $C$DW$T$61      .dwtag  DW_TAG_typedef
    2356                            .dwattr $C$DW$T$61, DW_AT_name("FPTR_RESERVED5_T")
    2357                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$59)
    2358                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2359                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    2360                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x63)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{FE5CC9C4-3D95-42C7-8599-A02F5AAB02A5} PAGE   44

    2361                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x19)
    2362                    
    2363                    
    2364                    $C$DW$T$63      .dwtag  DW_TAG_subroutine_type
    2365                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    2366                    $C$DW$143       .dwtag  DW_TAG_formal_parameter
    2367                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$28)
    2368                    
    2369                            .dwendtag $C$DW$T$63
    2370                    
    2371                    $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    2372                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    2373                            .dwattr $C$DW$T$64, DW_AT_address_class(0x20)
    2374                    
    2375                    $C$DW$T$67      .dwtag  DW_TAG_typedef
    2376                            .dwattr $C$DW$T$67, DW_AT_name("FPTR_ADCCOMPBIN_T")
    2377                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$64)
    2378                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2379                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    2380                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x69)
    2381                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x19)
    2382                    
    2383                    $C$DW$T$65      .dwtag  DW_TAG_typedef
    2384                            .dwattr $C$DW$T$65, DW_AT_name("FPTR_COMPAIN_T")
    2385                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    2386                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2387                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    2388                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x65)
    2389                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x19)
    2390                    
    2391                    $C$DW$T$66      .dwtag  DW_TAG_typedef
    2392                            .dwattr $C$DW$T$66, DW_AT_name("FPTR_COMPAREF_T")
    2393                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$64)
    2394                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    2395                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    2396                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x67)
    2397                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x19)
    2398                    
    2399                    $C$DW$T$68      .dwtag  DW_TAG_typedef
    2400                            .dwattr $C$DW$T$68, DW_AT_name("FPTR_COMPBREF_T")
    2401                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$64)
    2402                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
