TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Nov 28 13:22:09 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/StartUp/osaltasks.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Adrian\workspace_v8\collector_cc1350lp\collector_cc
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    4289                            .dwattr $C$DW$435, DW_AT_decl_line(0xa8)
    4290                            .dwattr $C$DW$435, DW_AT_decl_column(0x05)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   79

    4291                    
    4292                    $C$DW$436       .dwtag  DW_TAG_enumerator
    4293                            .dwattr $C$DW$436, DW_AT_name("FAPI_VALIDATE_SECTOR")
    4294                            .dwattr $C$DW$436, DW_AT_const_value(0x0e)
    4295                            .dwattr $C$DW$436, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4296                            .dwattr $C$DW$436, DW_AT_decl_line(0xa9)
    4297                            .dwattr $C$DW$436, DW_AT_decl_column(0x05)
    4298                    
    4299                    $C$DW$437       .dwtag  DW_TAG_enumerator
    4300                            .dwattr $C$DW$437, DW_AT_name("FAPI_CLEAR_STATUS")
    4301                            .dwattr $C$DW$437, DW_AT_const_value(0x10)
    4302                            .dwattr $C$DW$437, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4303                            .dwattr $C$DW$437, DW_AT_decl_line(0xaa)
    4304                            .dwattr $C$DW$437, DW_AT_decl_column(0x05)
    4305                    
    4306                    $C$DW$438       .dwtag  DW_TAG_enumerator
    4307                            .dwattr $C$DW$438, DW_AT_name("FAPI_PROGRAM_RESUME")
    4308                            .dwattr $C$DW$438, DW_AT_const_value(0x14)
    4309                            .dwattr $C$DW$438, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4310                            .dwattr $C$DW$438, DW_AT_decl_line(0xab)
    4311                            .dwattr $C$DW$438, DW_AT_decl_column(0x05)
    4312                    
    4313                    $C$DW$439       .dwtag  DW_TAG_enumerator
    4314                            .dwattr $C$DW$439, DW_AT_name("FAPI_ERASE_RESUME")
    4315                            .dwattr $C$DW$439, DW_AT_const_value(0x16)
    4316                            .dwattr $C$DW$439, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4317                            .dwattr $C$DW$439, DW_AT_decl_line(0xac)
    4318                            .dwattr $C$DW$439, DW_AT_decl_column(0x05)
    4319                    
    4320                    $C$DW$440       .dwtag  DW_TAG_enumerator
    4321                            .dwattr $C$DW$440, DW_AT_name("FAPI_CLEAR_MORE")
    4322                            .dwattr $C$DW$440, DW_AT_const_value(0x18)
    4323                            .dwattr $C$DW$440, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4324                            .dwattr $C$DW$440, DW_AT_decl_line(0xad)
    4325                            .dwattr $C$DW$440, DW_AT_decl_column(0x05)
    4326                    
    4327                    $C$DW$441       .dwtag  DW_TAG_enumerator
    4328                            .dwattr $C$DW$441, DW_AT_name("FAPI_PROGRAM_SECTOR")
    4329                            .dwattr $C$DW$441, DW_AT_const_value(0x20)
    4330                            .dwattr $C$DW$441, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4331                            .dwattr $C$DW$441, DW_AT_decl_line(0xae)
    4332                            .dwattr $C$DW$441, DW_AT_decl_column(0x05)
    4333                    
    4334                    $C$DW$442       .dwtag  DW_TAG_enumerator
    4335                            .dwattr $C$DW$442, DW_AT_name("FAPI_ERASE_OTP")
    4336                            .dwattr $C$DW$442, DW_AT_const_value(0x30)
    4337                            .dwattr $C$DW$442, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4338                            .dwattr $C$DW$442, DW_AT_decl_line(0xaf)
    4339                            .dwattr $C$DW$442, DW_AT_decl_column(0x05)
    4340                    
    4341                            .dwattr $C$DW$T$1084, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/device
    4342                            .dwattr $C$DW$T$1084, DW_AT_decl_line(0xa5)
    4343                            .dwattr $C$DW$T$1084, DW_AT_decl_column(0x01)
    4344                            .dwendtag $C$DW$T$1084
    4345                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   80

    4346                    $C$DW$T$1085    .dwtag  DW_TAG_typedef
    4347                            .dwattr $C$DW$T$1085, DW_AT_name("tFlashStateCommandsType")
    4348                            .dwattr $C$DW$T$1085, DW_AT_type(*$C$DW$T$1084)
    4349                            .dwattr $C$DW$T$1085, DW_AT_language(DW_LANG_C)
    4350                            .dwattr $C$DW$T$1085, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/device
    4351                            .dwattr $C$DW$T$1085, DW_AT_decl_line(0xb0)
    4352                            .dwattr $C$DW$T$1085, DW_AT_decl_column(0x03)
    4353                    
    4354                    
    4355                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4356                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    4357                    $C$DW$443       .dwtag  DW_TAG_member
    4358                            .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$22)
    4359                            .dwattr $C$DW$443, DW_AT_name("rfMode")
    4360                            .dwattr $C$DW$443, DW_AT_TI_symbol_name("rfMode")
    4361                            .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4362                            .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4363                            .dwattr $C$DW$443, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4364                            .dwattr $C$DW$443, DW_AT_decl_line(0x421)
    4365                            .dwattr $C$DW$443, DW_AT_decl_column(0x0d)
    4366                    
    4367                    $C$DW$444       .dwtag  DW_TAG_member
    4368                            .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$24)
    4369                            .dwattr $C$DW$444, DW_AT_name("cpePatchFxn")
    4370                            .dwattr $C$DW$444, DW_AT_TI_symbol_name("cpePatchFxn")
    4371                            .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4372                            .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4373                            .dwattr $C$DW$444, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4374                            .dwattr $C$DW$444, DW_AT_decl_line(0x422)
    4375                            .dwattr $C$DW$444, DW_AT_decl_column(0x0c)
    4376                    
    4377                    $C$DW$445       .dwtag  DW_TAG_member
    4378                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$24)
    4379                            .dwattr $C$DW$445, DW_AT_name("mcePatchFxn")
    4380                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("mcePatchFxn")
    4381                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4382                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4383                            .dwattr $C$DW$445, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4384                            .dwattr $C$DW$445, DW_AT_decl_line(0x423)
    4385                            .dwattr $C$DW$445, DW_AT_decl_column(0x0c)
    4386                    
    4387                    $C$DW$446       .dwtag  DW_TAG_member
    4388                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$24)
    4389                            .dwattr $C$DW$446, DW_AT_name("rfePatchFxn")
    4390                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("rfePatchFxn")
    4391                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4392                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4393                            .dwattr $C$DW$446, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4394                            .dwattr $C$DW$446, DW_AT_decl_line(0x424)
    4395                            .dwattr $C$DW$446, DW_AT_decl_column(0x0c)
    4396                    
    4397                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4398                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x420)
    4399                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    4400                            .dwendtag $C$DW$T$25
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   81

    4401                    
    4402                    $C$DW$T$38      .dwtag  DW_TAG_typedef
    4403                            .dwattr $C$DW$T$38, DW_AT_name("RF_Mode")
    4404                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$25)
    4405                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4406                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4407                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x425)
    4408                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
    4409                    
    4410                    $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    4411                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    4412                            .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
    4413                    
    4414                    
    4415                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4416                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    4417                    $C$DW$447       .dwtag  DW_TAG_member
    4418                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$27)
    4419                            .dwattr $C$DW$447, DW_AT_name("rawValue")
    4420                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("rawValue")
    4421                            .dwattr $C$DW$447, DW_AT_bit_offset(0x0a)
    4422                            .dwattr $C$DW$447, DW_AT_bit_size(0x16)
    4423                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4424                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4425                            .dwattr $C$DW$447, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4426                            .dwattr $C$DW$447, DW_AT_decl_line(0x3d6)
    4427                            .dwattr $C$DW$447, DW_AT_decl_column(0x0e)
    4428                    
    4429                    $C$DW$448       .dwtag  DW_TAG_member
    4430                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$27)
    4431                            .dwattr $C$DW$448, DW_AT_name("__dummy")
    4432                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("__dummy")
    4433                            .dwattr $C$DW$448, DW_AT_bit_offset(0x01)
    4434                            .dwattr $C$DW$448, DW_AT_bit_size(0x09)
    4435                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4436                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4437                            .dwattr $C$DW$448, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4438                            .dwattr $C$DW$448, DW_AT_decl_line(0x3da)
    4439                            .dwattr $C$DW$448, DW_AT_decl_column(0x0e)
    4440                    
    4441                    $C$DW$449       .dwtag  DW_TAG_member
    4442                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$27)
    4443                            .dwattr $C$DW$449, DW_AT_name("paType")
    4444                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("paType")
    4445                            .dwattr $C$DW$449, DW_AT_bit_offset(0x00)
    4446                            .dwattr $C$DW$449, DW_AT_bit_size(0x01)
    4447                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4448                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4449                            .dwattr $C$DW$449, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4450                            .dwattr $C$DW$449, DW_AT_decl_line(0x3db)
    4451                            .dwattr $C$DW$449, DW_AT_decl_column(0x0e)
    4452                    
    4453                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4454                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x3d5)
    4455                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   82

    4456                            .dwendtag $C$DW$T$28
    4457                    
    4458                    $C$DW$T$31      .dwtag  DW_TAG_typedef
    4459                            .dwattr $C$DW$T$31, DW_AT_name("RF_TxPowerTable_Value")
    4460                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    4461                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    4462                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4463                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x3df)
    4464                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    4465                    
    4466                    
    4467                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4468                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x05)
    4469                    $C$DW$450       .dwtag  DW_TAG_member
    4470                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$30)
    4471                            .dwattr $C$DW$450, DW_AT_name("power")
    4472                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("power")
    4473                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4474                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4475                            .dwattr $C$DW$450, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4476                            .dwattr $C$DW$450, DW_AT_decl_line(0x3f5)
    4477                            .dwattr $C$DW$450, DW_AT_decl_column(0x0c)
    4478                    
    4479                    $C$DW$451       .dwtag  DW_TAG_member
    4480                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$31)
    4481                            .dwattr $C$DW$451, DW_AT_name("value")
    4482                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("value")
    4483                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4484                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4485                            .dwattr $C$DW$451, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4486                            .dwattr $C$DW$451, DW_AT_decl_line(0x3f8)
    4487                            .dwattr $C$DW$451, DW_AT_decl_column(0x1b)
    4488                    
    4489                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4490                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x3f4)
    4491                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    4492                            .dwendtag $C$DW$T$32
    4493                    
    4494                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    4495                            .dwattr $C$DW$T$33, DW_AT_name("RF_TxPowerTable_Entry")
    4496                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4497                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4498                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4499                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x3f9)
    4500                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x1b)
    4501                    
    4502                    $C$DW$T$34      .dwtag  DW_TAG_const_type
    4503                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4504                    
    4505                    $C$DW$T$35      .dwtag  DW_TAG_typedef
    4506                            .dwattr $C$DW$T$35, DW_AT_name("macTxPwrVal_t")
    4507                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4508                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4509                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicati
    4510                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x144)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   83

    4511                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x25)
    4512                    
    4513                    $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    4514                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    4515                            .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    4516                    
    4517                    
    4518                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4519                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    4520                    $C$DW$452       .dwtag  DW_TAG_member
    4521                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$36)
    4522                            .dwattr $C$DW$452, DW_AT_name("pTxPwrVals")
    4523                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("pTxPwrVals")
    4524                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4525                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4526                            .dwattr $C$DW$452, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    4527                            .dwattr $C$DW$452, DW_AT_decl_line(0x148)
    4528                            .dwattr $C$DW$452, DW_AT_decl_column(0x12)
    4529                    
    4530                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicati
    4531                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x147)
    4532                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    4533                            .dwendtag $C$DW$T$37
    4534                    
    4535                    $C$DW$T$41      .dwtag  DW_TAG_const_type
    4536                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$37)
    4537                    
    4538                    $C$DW$T$42      .dwtag  DW_TAG_typedef
    4539                            .dwattr $C$DW$T$42, DW_AT_name("macTxPwrTbl_t")
    4540                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4541                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4542                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicati
    4543                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x149)
    4544                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
    4545                    
    4546                    $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4547                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4548                            .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    4549                    
    4550                    
    4551                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    4552                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x30)
    4553                    $C$DW$453       .dwtag  DW_TAG_member
    4554                            .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$27)
    4555                            .dwattr $C$DW$453, DW_AT_name("getHwRevision")
    4556                            .dwattr $C$DW$453, DW_AT_TI_symbol_name("getHwRevision")
    4557                            .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4558                            .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4559                            .dwattr $C$DW$453, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    4560                            .dwattr $C$DW$453, DW_AT_decl_line(0x155)
    4561                            .dwattr $C$DW$453, DW_AT_decl_column(0x1c)
    4562                    
    4563                    $C$DW$454       .dwtag  DW_TAG_member
    4564                            .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$39)
    4565                            .dwattr $C$DW$454, DW_AT_name("pRfPatchTable")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   84

    4566                            .dwattr $C$DW$454, DW_AT_TI_symbol_name("pRfPatchTable")
    4567                            .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4568                            .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4569                            .dwattr $C$DW$454, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    4570                            .dwattr $C$DW$454, DW_AT_decl_line(0x156)
    4571                            .dwattr $C$DW$454, DW_AT_decl_column(0x1d)
    4572                    
    4573                    $C$DW$455       .dwtag  DW_TAG_member
    4574                            .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$40)
    4575                            .dwattr $C$DW$455, DW_AT_name("pRfDrvTblPtr")
    4576                            .dwattr $C$DW$455, DW_AT_TI_symbol_name("pRfDrvTblPtr")
    4577                            .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4578                            .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4579                            .dwattr $C$DW$455, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    4580                            .dwattr $C$DW$455, DW_AT_decl_line(0x157)
    4581                            .dwattr $C$DW$455, DW_AT_decl_column(0x1d)
    4582                    
    4583                    $C$DW$456       .dwtag  DW_TAG_member
    4584                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$40)
    4585                            .dwattr $C$DW$456, DW_AT_name("pCryptoDrvTblPtr")
    4586                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("pCryptoDrvTblPtr")
    4587                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4588                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4589                            .dwattr $C$DW$456, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    4590                            .dwattr $C$DW$456, DW_AT_decl_line(0x158)
    4591                            .dwattr $C$DW$456, DW_AT_decl_column(0x1d)
    4592                    
    4593                    $C$DW$457       .dwtag  DW_TAG_member
    4594                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$43)
    4595                            .dwattr $C$DW$457, DW_AT_name("pTxPwrTbl")
    4596                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("pTxPwrTbl")
    4597                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4598                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4599                            .dwattr $C$DW$457, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    4600                            .dwattr $C$DW$457, DW_AT_decl_line(0x159)
    4601                            .dwattr $C$DW$457, DW_AT_decl_column(0x20)
    4602                    
    4603                    $C$DW$458       .dwtag  DW_TAG_member
    4604                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$44)
    4605                            .dwattr $C$DW$458, DW_AT_name("pOverrides")
    4606                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("pOverrides")
    4607                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4608                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4609                            .dwattr $C$DW$458, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    4610                            .dwattr $C$DW$458, DW_AT_decl_line(0x15a)
    4611                            .dwattr $C$DW$458, DW_AT_decl_column(0x1e)
    4612                    
    4613                    $C$DW$459       .dwtag  DW_TAG_member
    4614                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$45)
    4615                            .dwattr $C$DW$459, DW_AT_name("pLoDivider")
    4616                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("pLoDivider")
    4617                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4618                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4619                            .dwattr $C$DW$459, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    4620                            .dwattr $C$DW$459, DW_AT_decl_line(0x15b)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   85

    4621                            .dwattr $C$DW$459, DW_AT_decl_column(0x1d)
    4622                    
    4623                    $C$DW$460       .dwtag  DW_TAG_member
    4624                            .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$22)
    4625                            .dwattr $C$DW$460, DW_AT_name("rfFeModeBias")
    4626                            .dwattr $C$DW$460, DW_AT_TI_symbol_name("rfFeModeBias")
    4627                            .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4628                            .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4629                            .dwattr $C$DW$460, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    4630                            .dwattr $C$DW$460, DW_AT_decl_line(0x15c)
    4631                            .dwattr $C$DW$460, DW_AT_decl_column(0x1c)
    4632                    
    4633                    $C$DW$461       .dwtag  DW_TAG_member
    4634                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$22)
    4635                            .dwattr $C$DW$461, DW_AT_name("phyId")
    4636                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("phyId")
    4637                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4638                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4639                            .dwattr $C$DW$461, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    4640                            .dwattr $C$DW$461, DW_AT_decl_line(0x15d)
    4641                            .dwattr $C$DW$461, DW_AT_decl_column(0x1c)
    4642                    
    4643                    $C$DW$462       .dwtag  DW_TAG_member
    4644                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$22)
    4645                            .dwattr $C$DW$462, DW_AT_name("last")
    4646                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("last")
    4647                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4648                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4649                            .dwattr $C$DW$462, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    4650                            .dwattr $C$DW$462, DW_AT_decl_line(0x15e)
    4651                            .dwattr $C$DW$462, DW_AT_decl_column(0x1c)
    4652                    
    4653                    $C$DW$463       .dwtag  DW_TAG_member
    4654                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$48)
    4655                            .dwattr $C$DW$463, DW_AT_name("pSetRE")
    4656                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("pSetRE")
    4657                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4658                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4659                            .dwattr $C$DW$463, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    4660                            .dwattr $C$DW$463, DW_AT_decl_line(0x15f)
    4661                            .dwattr $C$DW$463, DW_AT_decl_column(0x1c)
    4662                    
    4663                    $C$DW$464       .dwtag  DW_TAG_member
    4664                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$49)
    4665                            .dwattr $C$DW$464, DW_AT_name("pAssertFP")
    4666                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("pAssertFP")
    4667                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4668                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4669                            .dwattr $C$DW$464, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    4670                            .dwattr $C$DW$464, DW_AT_decl_line(0x160)
    4671                            .dwattr $C$DW$464, DW_AT_decl_column(0x1c)
    4672                    
    4673                    $C$DW$465       .dwtag  DW_TAG_member
    4674                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$52)
    4675                            .dwattr $C$DW$465, DW_AT_name("pAntSwitchFP")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   86

    4676                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("pAntSwitchFP")
    4677                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4678                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4679                            .dwattr $C$DW$465, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    4680                            .dwattr $C$DW$465, DW_AT_decl_line(0x161)
    4681                            .dwattr $C$DW$465, DW_AT_decl_column(0x1c)
    4682                    
    4683                    $C$DW$466       .dwtag  DW_TAG_member
    4684                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$53)
    4685                            .dwattr $C$DW$466, DW_AT_name("pAntPwrFP")
    4686                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("pAntPwrFP")
    4687                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4688                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4689                            .dwattr $C$DW$466, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    4690                            .dwattr $C$DW$466, DW_AT_decl_line(0x162)
    4691                            .dwattr $C$DW$466, DW_AT_decl_column(0x1c)
    4692                    
    4693                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicati
    4694                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x154)
    4695                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
    4696                            .dwendtag $C$DW$T$54
    4697                    
    4698                    $C$DW$T$1087    .dwtag  DW_TAG_typedef
    4699                            .dwattr $C$DW$T$1087, DW_AT_name("macUserCfg_t")
    4700                            .dwattr $C$DW$T$1087, DW_AT_type(*$C$DW$T$54)
    4701                            .dwattr $C$DW$T$1087, DW_AT_language(DW_LANG_C)
    4702                            .dwattr $C$DW$T$1087, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applica
    4703                            .dwattr $C$DW$T$1087, DW_AT_decl_line(0x163)
    4704                            .dwattr $C$DW$T$1087, DW_AT_decl_column(0x03)
    4705                    
    4706                    $C$DW$T$1088    .dwtag  DW_TAG_pointer_type
    4707                            .dwattr $C$DW$T$1088, DW_AT_type(*$C$DW$T$1087)
    4708                            .dwattr $C$DW$T$1088, DW_AT_address_class(0x20)
    4709                    
    4710                    
    4711                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    4712                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x10)
    4713                    $C$DW$467       .dwtag  DW_TAG_member
    4714                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$14)
    4715                            .dwattr $C$DW$467, DW_AT_name("__max_align1")
    4716                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("__max_align1")
    4717                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4718                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4719                            .dwattr $C$DW$467, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4720                            .dwattr $C$DW$467, DW_AT_decl_line(0x70)
    4721                            .dwattr $C$DW$467, DW_AT_decl_column(0x0c)
    4722                    
    4723                    $C$DW$468       .dwtag  DW_TAG_member
    4724                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$18)
    4725                            .dwattr $C$DW$468, DW_AT_name("__max_align2")
    4726                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("__max_align2")
    4727                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4728                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4729                            .dwattr $C$DW$468, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4730                            .dwattr $C$DW$468, DW_AT_decl_line(0x71)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   87

    4731                            .dwattr $C$DW$468, DW_AT_decl_column(0x0e)
    4732                    
    4733                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    4734                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x6f)
    4735                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    4736                            .dwendtag $C$DW$T$55
    4737                    
    4738                    $C$DW$T$1089    .dwtag  DW_TAG_typedef
    4739                            .dwattr $C$DW$T$1089, DW_AT_name("__max_align_t")
    4740                            .dwattr $C$DW$T$1089, DW_AT_type(*$C$DW$T$55)
    4741                            .dwattr $C$DW$T$1089, DW_AT_language(DW_LANG_C)
    4742                            .dwattr $C$DW$T$1089, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/includ
    4743                            .dwattr $C$DW$T$1089, DW_AT_decl_line(0x72)
    4744                            .dwattr $C$DW$T$1089, DW_AT_decl_column(0x03)
    4745                    
    4746                    
    4747                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    4748                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x08)
    4749                    $C$DW$469       .dwtag  DW_TAG_member
    4750                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$10)
    4751                            .dwattr $C$DW$469, DW_AT_name("quot")
    4752                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("quot")
    4753                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4754                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4755                            .dwattr $C$DW$469, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4756                            .dwattr $C$DW$469, DW_AT_decl_line(0x49)
    4757                            .dwattr $C$DW$469, DW_AT_decl_column(0x16)
    4758                    
    4759                    $C$DW$470       .dwtag  DW_TAG_member
    4760                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$10)
    4761                            .dwattr $C$DW$470, DW_AT_name("rem")
    4762                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("rem")
    4763                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4764                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4765                            .dwattr $C$DW$470, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4766                            .dwattr $C$DW$470, DW_AT_decl_line(0x49)
    4767                            .dwattr $C$DW$470, DW_AT_decl_column(0x1c)
    4768                    
    4769                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    4770                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x49)
    4771                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x10)
    4772                            .dwendtag $C$DW$T$56
    4773                    
    4774                    $C$DW$T$1090    .dwtag  DW_TAG_typedef
    4775                            .dwattr $C$DW$T$1090, DW_AT_name("div_t")
    4776                            .dwattr $C$DW$T$1090, DW_AT_type(*$C$DW$T$56)
    4777                            .dwattr $C$DW$T$1090, DW_AT_language(DW_LANG_C)
    4778                            .dwattr $C$DW$T$1090, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/includ
    4779                            .dwattr $C$DW$T$1090, DW_AT_decl_line(0x49)
    4780                            .dwattr $C$DW$T$1090, DW_AT_decl_column(0x23)
    4781                    
    4782                    
    4783                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    4784                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x08)
    4785                    $C$DW$471       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   88

    4786                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$10)
    4787                            .dwattr $C$DW$471, DW_AT_name("quot")
    4788                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("quot")
    4789                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4790                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4791                            .dwattr $C$DW$471, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4792                            .dwattr $C$DW$471, DW_AT_decl_line(0x4e)
    4793                            .dwattr $C$DW$471, DW_AT_decl_column(0x16)
    4794                    
    4795                    $C$DW$472       .dwtag  DW_TAG_member
    4796                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$10)
    4797                            .dwattr $C$DW$472, DW_AT_name("rem")
    4798                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("rem")
    4799                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4800                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4801                            .dwattr $C$DW$472, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4802                            .dwattr $C$DW$472, DW_AT_decl_line(0x4e)
    4803                            .dwattr $C$DW$472, DW_AT_decl_column(0x1c)
    4804                    
    4805                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    4806                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x4e)
    4807                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x10)
    4808                            .dwendtag $C$DW$T$57
    4809                    
    4810                    $C$DW$T$1091    .dwtag  DW_TAG_typedef
    4811                            .dwattr $C$DW$T$1091, DW_AT_name("ldiv_t")
    4812                            .dwattr $C$DW$T$1091, DW_AT_type(*$C$DW$T$57)
    4813                            .dwattr $C$DW$T$1091, DW_AT_language(DW_LANG_C)
    4814                            .dwattr $C$DW$T$1091, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/includ
    4815                            .dwattr $C$DW$T$1091, DW_AT_decl_line(0x4e)
    4816                            .dwattr $C$DW$T$1091, DW_AT_decl_column(0x23)
    4817                    
    4818                    
    4819                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    4820                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
    4821                    $C$DW$473       .dwtag  DW_TAG_member
    4822                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$14)
    4823                            .dwattr $C$DW$473, DW_AT_name("quot")
    4824                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("quot")
    4825                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4826                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4827                            .dwattr $C$DW$473, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4828                            .dwattr $C$DW$473, DW_AT_decl_line(0x56)
    4829                            .dwattr $C$DW$473, DW_AT_decl_column(0x1c)
    4830                    
    4831                    $C$DW$474       .dwtag  DW_TAG_member
    4832                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$14)
    4833                            .dwattr $C$DW$474, DW_AT_name("rem")
    4834                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("rem")
    4835                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4836                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4837                            .dwattr $C$DW$474, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    4838                            .dwattr $C$DW$474, DW_AT_decl_line(0x56)
    4839                            .dwattr $C$DW$474, DW_AT_decl_column(0x22)
    4840                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   89

    4841                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    4842                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x56)
    4843                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x10)
    4844                            .dwendtag $C$DW$T$58
    4845                    
    4846                    $C$DW$T$1092    .dwtag  DW_TAG_typedef
    4847                            .dwattr $C$DW$T$1092, DW_AT_name("lldiv_t")
    4848                            .dwattr $C$DW$T$1092, DW_AT_type(*$C$DW$T$58)
    4849                            .dwattr $C$DW$T$1092, DW_AT_language(DW_LANG_C)
    4850                            .dwattr $C$DW$T$1092, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/includ
    4851                            .dwattr $C$DW$T$1092, DW_AT_decl_line(0x56)
    4852                            .dwattr $C$DW$T$1092, DW_AT_decl_column(0x29)
    4853                    
    4854                    
    4855                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    4856                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x08)
    4857                    $C$DW$475       .dwtag  DW_TAG_member
    4858                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$61)
    4859                            .dwattr $C$DW$475, DW_AT_name("pointerStack")
    4860                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("pointerStack")
    4861                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4862                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4863                            .dwattr $C$DW$475, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4864                            .dwattr $C$DW$475, DW_AT_decl_line(0x3f5)
    4865                            .dwattr $C$DW$475, DW_AT_decl_column(0x16)
    4866                    
    4867                    $C$DW$476       .dwtag  DW_TAG_member
    4868                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$62)
    4869                            .dwattr $C$DW$476, DW_AT_name("directAPI")
    4870                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("directAPI")
    4871                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4872                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4873                            .dwattr $C$DW$476, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4874                            .dwattr $C$DW$476, DW_AT_decl_line(0x3f6)
    4875                            .dwattr $C$DW$476, DW_AT_decl_column(0x15)
    4876                    
    4877                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4878                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x3f4)
    4879                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
    4880                            .dwendtag $C$DW$T$63
    4881                    
    4882                    $C$DW$T$65      .dwtag  DW_TAG_typedef
    4883                            .dwattr $C$DW$T$65, DW_AT_name("icall_directAPIMsg_t")
    4884                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$63)
    4885                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    4886                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4887                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x3f7)
    4888                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    4889                    
    4890                    
    4891                    $C$DW$T$66      .dwtag  DW_TAG_structure_type
    4892                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x14)
    4893                    $C$DW$477       .dwtag  DW_TAG_member
    4894                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$64)
    4895                            .dwattr $C$DW$477, DW_AT_name("hdr")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   90

    4896                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("hdr")
    4897                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4898                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4899                            .dwattr $C$DW$477, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4900                            .dwattr $C$DW$477, DW_AT_decl_line(0x3fb)
    4901                            .dwattr $C$DW$477, DW_AT_decl_column(0x10)
    4902                    
    4903                    $C$DW$478       .dwtag  DW_TAG_member
    4904                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$65)
    4905                            .dwattr $C$DW$478, DW_AT_name("msg")
    4906                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("msg")
    4907                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4908                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4909                            .dwattr $C$DW$478, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4910                            .dwattr $C$DW$478, DW_AT_decl_line(0x3fc)
    4911                            .dwattr $C$DW$478, DW_AT_decl_column(0x1a)
    4912                    
    4913                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4914                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x3fa)
    4915                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x01)
    4916                            .dwendtag $C$DW$T$66
    4917                    
    4918                    $C$DW$T$1093    .dwtag  DW_TAG_typedef
    4919                            .dwattr $C$DW$T$1093, DW_AT_name("icallLiteMsg_t")
    4920                            .dwattr $C$DW$T$1093, DW_AT_type(*$C$DW$T$66)
    4921                            .dwattr $C$DW$T$1093, DW_AT_language(DW_LANG_C)
    4922                            .dwattr $C$DW$T$1093, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    4923                            .dwattr $C$DW$T$1093, DW_AT_decl_line(0x3fd)
    4924                            .dwattr $C$DW$T$1093, DW_AT_decl_column(0x03)
    4925                    
    4926                    
    4927                    $C$DW$T$67      .dwtag  DW_TAG_structure_type
    4928                            .dwattr $C$DW$T$67, DW_AT_byte_size(0x0a)
    4929                    $C$DW$479       .dwtag  DW_TAG_member
    4930                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$494)
    4931                            .dwattr $C$DW$479, DW_AT_name("addr")
    4932                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("addr")
    4933                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4934                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4935                            .dwattr $C$DW$479, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    4936                            .dwattr $C$DW$479, DW_AT_decl_line(0x55)
    4937                            .dwattr $C$DW$479, DW_AT_decl_column(0x05)
    4938                    
    4939                    $C$DW$480       .dwtag  DW_TAG_member
    4940                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$22)
    4941                            .dwattr $C$DW$480, DW_AT_name("addrMode")
    4942                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("addrMode")
    4943                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4944                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4945                            .dwattr $C$DW$480, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicatio
    4946                            .dwattr $C$DW$480, DW_AT_decl_line(0x56)
    4947                            .dwattr $C$DW$480, DW_AT_decl_column(0x13)
    4948                    
    4949                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicati
    4950                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x50)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   91

    4951                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x01)
    4952                            .dwendtag $C$DW$T$67
    4953                    
    4954                    $C$DW$T$386     .dwtag  DW_TAG_typedef
    4955                            .dwattr $C$DW$T$386, DW_AT_name("sAddr_t")
    4956                            .dwattr $C$DW$T$386, DW_AT_type(*$C$DW$T$67)
    4957                            .dwattr $C$DW$T$386, DW_AT_language(DW_LANG_C)
    4958                            .dwattr $C$DW$T$386, DW_AT_decl_file("C:/Users/Adrian/workspace_v8/collector_cc1350lp/Applicat
    4959                            .dwattr $C$DW$T$386, DW_AT_decl_line(0x57)
    4960                            .dwattr $C$DW$T$386, DW_AT_decl_column(0x03)
    4961                    
    4962                    $C$DW$T$442     .dwtag  DW_TAG_pointer_type
    4963                            .dwattr $C$DW$T$442, DW_AT_type(*$C$DW$T$386)
    4964                            .dwattr $C$DW$T$442, DW_AT_address_class(0x20)
    4965                    
    4966                    
    4967                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4968                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    4969                    $C$DW$481       .dwtag  DW_TAG_member
    4970                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$497)
    4971                            .dwattr $C$DW$481, DW_AT_name("addr")
    4972                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("addr")
    4973                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4974                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4975                            .dwattr $C$DW$481, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4976                            .dwattr $C$DW$481, DW_AT_decl_line(0x139)
    4977                            .dwattr $C$DW$481, DW_AT_decl_column(0x05)
    4978                    
    4979                    $C$DW$482       .dwtag  DW_TAG_member
    4980                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$69)
    4981                            .dwattr $C$DW$482, DW_AT_name("addrMode")
    4982                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("addrMode")
    4983                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4984                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4985                            .dwattr $C$DW$482, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4986                            .dwattr $C$DW$482, DW_AT_decl_line(0x13a)
    4987                            .dwattr $C$DW$482, DW_AT_decl_column(0x08)
    4988                    
    4989                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4990                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x134)
    4991                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x01)
    4992                            .dwendtag $C$DW$T$70
    4993                    
    4994                    $C$DW$T$1094    .dwtag  DW_TAG_typedef
    4995                            .dwattr $C$DW$T$1094, DW_AT_name("zAddrType_t")
    4996                            .dwattr $C$DW$T$1094, DW_AT_type(*$C$DW$T$70)
    4997                            .dwattr $C$DW$T$1094, DW_AT_language(DW_LANG_C)
    4998                            .dwattr $C$DW$T$1094, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    4999                            .dwattr $C$DW$T$1094, DW_AT_decl_line(0x13b)
    5000                            .dwattr $C$DW$T$1094, DW_AT_decl_column(0x03)
    5001                    
    5002                    
    5003                    $C$DW$T$73      .dwtag  DW_TAG_structure_type
    5004                            .dwattr $C$DW$T$73, DW_AT_byte_size(0x0c)
    5005                    $C$DW$483       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   92

    5006                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$68)
    5007                            .dwattr $C$DW$483, DW_AT_name("txCounter")
    5008                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("txCounter")
    5009                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5010                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5011                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5012                            .dwattr $C$DW$483, DW_AT_decl_line(0x198)
    5013                            .dwattr $C$DW$483, DW_AT_decl_column(0x0a)
    5014                    
    5015                    $C$DW$484       .dwtag  DW_TAG_member
    5016                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$68)
    5017                            .dwattr $C$DW$484, DW_AT_name("txCost")
    5018                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("txCost")
    5019                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5020                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5021                            .dwattr $C$DW$484, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5022                            .dwattr $C$DW$484, DW_AT_decl_line(0x199)
    5023                            .dwattr $C$DW$484, DW_AT_decl_column(0x0a)
    5024                    
    5025                    $C$DW$485       .dwtag  DW_TAG_member
    5026                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$68)
    5027                            .dwattr $C$DW$485, DW_AT_name("rxLqi")
    5028                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("rxLqi")
    5029                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5030                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5031                            .dwattr $C$DW$485, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5032                            .dwattr $C$DW$485, DW_AT_decl_line(0x19b)
    5033                            .dwattr $C$DW$485, DW_AT_decl_column(0x0a)
    5034                    
    5035                    $C$DW$486       .dwtag  DW_TAG_member
    5036                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$68)
    5037                            .dwattr $C$DW$486, DW_AT_name("inKeySeqNum")
    5038                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("inKeySeqNum")
    5039                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5040                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5041                            .dwattr $C$DW$486, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5042                            .dwattr $C$DW$486, DW_AT_decl_line(0x19d)
    5043                            .dwattr $C$DW$486, DW_AT_decl_column(0x0a)
    5044                    
    5045                    $C$DW$487       .dwtag  DW_TAG_member
    5046                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$71)
    5047                            .dwattr $C$DW$487, DW_AT_name("inFrmCntr")
    5048                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("inFrmCntr")
    5049                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5050                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5051                            .dwattr $C$DW$487, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5052                            .dwattr $C$DW$487, DW_AT_decl_line(0x19e)
    5053                            .dwattr $C$DW$487, DW_AT_decl_column(0x0a)
    5054                    
    5055                    $C$DW$488       .dwtag  DW_TAG_member
    5056                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$72)
    5057                            .dwattr $C$DW$488, DW_AT_name("txFailure")
    5058                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("txFailure")
    5059                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5060                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   93

    5061                            .dwattr $C$DW$488, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5062                            .dwattr $C$DW$488, DW_AT_decl_line(0x19f)
    5063                            .dwattr $C$DW$488, DW_AT_decl_column(0x0a)
    5064                    
    5065                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    5066                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x197)
    5067                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x01)
    5068                            .dwendtag $C$DW$T$73
    5069                    
    5070                    $C$DW$T$1095    .dwtag  DW_TAG_typedef
    5071                            .dwattr $C$DW$T$1095, DW_AT_name("linkInfo_t")
    5072                            .dwattr $C$DW$T$1095, DW_AT_type(*$C$DW$T$73)
    5073                            .dwattr $C$DW$T$1095, DW_AT_language(DW_LANG_C)
    5074                            .dwattr $C$DW$T$1095, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    5075                            .dwattr $C$DW$T$1095, DW_AT_decl_line(0x1a0)
    5076                            .dwattr $C$DW$T$1095, DW_AT_decl_column(0x03)
    5077                    
    5078                    
    5079                    $C$DW$T$74      .dwtag  DW_TAG_structure_type
    5080                            .dwattr $C$DW$T$74, DW_AT_byte_size(0x02)
    5081                    $C$DW$489       .dwtag  DW_TAG_member
    5082                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$68)
    5083                            .dwattr $C$DW$489, DW_AT_name("event")
    5084                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("event")
    5085                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5086                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5087                            .dwattr $C$DW$489, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5088                            .dwattr $C$DW$489, DW_AT_decl_line(0x79)
    5089                            .dwattr $C$DW$489, DW_AT_decl_column(0x0a)
    5090                    
    5091                    $C$DW$490       .dwtag  DW_TAG_member
    5092                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$68)
    5093                            .dwattr $C$DW$490, DW_AT_name("status")
    5094                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("status")
    5095                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5096                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5097                            .dwattr $C$DW$490, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5098                            .dwattr $C$DW$490, DW_AT_decl_line(0x7a)
    5099                            .dwattr $C$DW$490, DW_AT_decl_column(0x0a)
    5100                    
    5101                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    5102                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x78)
    5103                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x01)
    5104                            .dwendtag $C$DW$T$74
    5105                    
    5106                    $C$DW$T$1096    .dwtag  DW_TAG_typedef
    5107                            .dwattr $C$DW$T$1096, DW_AT_name("osal_event_hdr_t")
    5108                            .dwattr $C$DW$T$1096, DW_AT_type(*$C$DW$T$74)
    5109                            .dwattr $C$DW$T$1096, DW_AT_language(DW_LANG_C)
    5110                            .dwattr $C$DW$T$1096, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    5111                            .dwattr $C$DW$T$1096, DW_AT_decl_line(0x7b)
    5112                            .dwattr $C$DW$T$1096, DW_AT_decl_column(0x03)
    5113                    
    5114                    
    5115                    $C$DW$T$107     .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   94

    5116                            .dwattr $C$DW$T$107, DW_AT_byte_size(0x4c)
    5117                    $C$DW$491       .dwtag  DW_TAG_member
    5118                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$77)
    5119                            .dwattr $C$DW$491, DW_AT_name("Crc32")
    5120                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("Crc32")
    5121                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5122                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5123                            .dwattr $C$DW$491, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5124                            .dwattr $C$DW$491, DW_AT_decl_line(0x76)
    5125                            .dwattr $C$DW$491, DW_AT_decl_column(0x25)
    5126                    
    5127                    $C$DW$492       .dwtag  DW_TAG_member
    5128                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$80)
    5129                            .dwattr $C$DW$492, DW_AT_name("FlashGetSize")
    5130                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("FlashGetSize")
    5131                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5132                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5133                            .dwattr $C$DW$492, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5134                            .dwattr $C$DW$492, DW_AT_decl_line(0x77)
    5135                            .dwattr $C$DW$492, DW_AT_decl_column(0x25)
    5136                    
    5137                    $C$DW$493       .dwtag  DW_TAG_member
    5138                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$81)
    5139                            .dwattr $C$DW$493, DW_AT_name("GetChipId")
    5140                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("GetChipId")
    5141                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5142                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5143                            .dwattr $C$DW$493, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5144                            .dwattr $C$DW$493, DW_AT_decl_line(0x78)
    5145                            .dwattr $C$DW$493, DW_AT_decl_column(0x25)
    5146                    
    5147                    $C$DW$494       .dwtag  DW_TAG_member
    5148                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$84)
    5149                            .dwattr $C$DW$494, DW_AT_name("ReservedLocation1")
    5150                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("ReservedLocation1")
    5151                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5152                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5153                            .dwattr $C$DW$494, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5154                            .dwattr $C$DW$494, DW_AT_decl_line(0x79)
    5155                            .dwattr $C$DW$494, DW_AT_decl_column(0x25)
    5156                    
    5157                    $C$DW$495       .dwtag  DW_TAG_member
    5158                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$85)
    5159                            .dwattr $C$DW$495, DW_AT_name("ReservedLocation2")
    5160                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("ReservedLocation2")
    5161                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5162                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5163                            .dwattr $C$DW$495, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5164                            .dwattr $C$DW$495, DW_AT_decl_line(0x7a)
    5165                            .dwattr $C$DW$495, DW_AT_decl_column(0x25)
    5166                    
    5167                    $C$DW$496       .dwtag  DW_TAG_member
    5168                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$86)
    5169                            .dwattr $C$DW$496, DW_AT_name("ReservedLocation3")
    5170                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("ReservedLocation3")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   95

    5171                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5172                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5173                            .dwattr $C$DW$496, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5174                            .dwattr $C$DW$496, DW_AT_decl_line(0x7b)
    5175                            .dwattr $C$DW$496, DW_AT_decl_column(0x25)
    5176                    
    5177                    $C$DW$497       .dwtag  DW_TAG_member
    5178                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$87)
    5179                            .dwattr $C$DW$497, DW_AT_name("ResetDevice")
    5180                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("ResetDevice")
    5181                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5182                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5183                            .dwattr $C$DW$497, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5184                            .dwattr $C$DW$497, DW_AT_decl_line(0x7c)
    5185                            .dwattr $C$DW$497, DW_AT_decl_column(0x25)
    5186                    
    5187                    $C$DW$498       .dwtag  DW_TAG_member
    5188                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$93)
    5189                            .dwattr $C$DW$498, DW_AT_name("Fletcher32")
    5190                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("Fletcher32")
    5191                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5192                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5193                            .dwattr $C$DW$498, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5194                            .dwattr $C$DW$498, DW_AT_decl_line(0x7d)
    5195                            .dwattr $C$DW$498, DW_AT_decl_column(0x25)
    5196                    
    5197                    $C$DW$499       .dwtag  DW_TAG_member
    5198                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$96)
    5199                            .dwattr $C$DW$499, DW_AT_name("MinValue")
    5200                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("MinValue")
    5201                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5202                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5203                            .dwattr $C$DW$499, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5204                            .dwattr $C$DW$499, DW_AT_decl_line(0x7e)
    5205                            .dwattr $C$DW$499, DW_AT_decl_column(0x25)
    5206                    
    5207                    $C$DW$500       .dwtag  DW_TAG_member
    5208                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$97)
    5209                            .dwattr $C$DW$500, DW_AT_name("MaxValue")
    5210                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("MaxValue")
    5211                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5212                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5213                            .dwattr $C$DW$500, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5214                            .dwattr $C$DW$500, DW_AT_decl_line(0x7f)
    5215                            .dwattr $C$DW$500, DW_AT_decl_column(0x25)
    5216                    
    5217                    $C$DW$501       .dwtag  DW_TAG_member
    5218                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$98)
    5219                            .dwattr $C$DW$501, DW_AT_name("MeanValue")
    5220                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("MeanValue")
    5221                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5222                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5223                            .dwattr $C$DW$501, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5224                            .dwattr $C$DW$501, DW_AT_decl_line(0x80)
    5225                            .dwattr $C$DW$501, DW_AT_decl_column(0x25)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   96

    5226                    
    5227                    $C$DW$502       .dwtag  DW_TAG_member
    5228                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$99)
    5229                            .dwattr $C$DW$502, DW_AT_name("StandDeviationValue")
    5230                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("StandDeviationValue")
    5231                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5232                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5233                            .dwattr $C$DW$502, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5234                            .dwattr $C$DW$502, DW_AT_decl_line(0x81)
    5235                            .dwattr $C$DW$502, DW_AT_decl_column(0x25)
    5236                    
    5237                    $C$DW$503       .dwtag  DW_TAG_member
    5238                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$100)
    5239                            .dwattr $C$DW$503, DW_AT_name("ReservedLocation4")
    5240                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("ReservedLocation4")
    5241                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    5242                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5243                            .dwattr $C$DW$503, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5244                            .dwattr $C$DW$503, DW_AT_decl_line(0x82)
    5245                            .dwattr $C$DW$503, DW_AT_decl_column(0x25)
    5246                    
    5247                    $C$DW$504       .dwtag  DW_TAG_member
    5248                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$101)
    5249                            .dwattr $C$DW$504, DW_AT_name("ReservedLocation5")
    5250                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("ReservedLocation5")
    5251                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5252                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    5253                            .dwattr $C$DW$504, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5254                            .dwattr $C$DW$504, DW_AT_decl_line(0x83)
    5255                            .dwattr $C$DW$504, DW_AT_decl_column(0x25)
    5256                    
    5257                    $C$DW$505       .dwtag  DW_TAG_member
    5258                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$102)
    5259                            .dwattr $C$DW$505, DW_AT_name("HFSourceSafeSwitch")
    5260                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    5261                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5262                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5263                            .dwattr $C$DW$505, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5264                            .dwattr $C$DW$505, DW_AT_decl_line(0x84)
    5265                            .dwattr $C$DW$505, DW_AT_decl_column(0x25)
    5266                    
    5267                    $C$DW$506       .dwtag  DW_TAG_member
    5268                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$103)
    5269                            .dwattr $C$DW$506, DW_AT_name("SelectCompAInput")
    5270                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("SelectCompAInput")
    5271                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5272                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    5273                            .dwattr $C$DW$506, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5274                            .dwattr $C$DW$506, DW_AT_decl_line(0x85)
    5275                            .dwattr $C$DW$506, DW_AT_decl_column(0x25)
    5276                    
    5277                    $C$DW$507       .dwtag  DW_TAG_member
    5278                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$104)
    5279                            .dwattr $C$DW$507, DW_AT_name("SelectCompARef")
    5280                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("SelectCompARef")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   97

    5281                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5282                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    5283                            .dwattr $C$DW$507, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5284                            .dwattr $C$DW$507, DW_AT_decl_line(0x86)
    5285                            .dwattr $C$DW$507, DW_AT_decl_column(0x25)
    5286                    
    5287                    $C$DW$508       .dwtag  DW_TAG_member
    5288                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$105)
    5289                            .dwattr $C$DW$508, DW_AT_name("SelectADCCompBInput")
    5290                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("SelectADCCompBInput")
    5291                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5292                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    5293                            .dwattr $C$DW$508, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5294                            .dwattr $C$DW$508, DW_AT_decl_line(0x87)
    5295                            .dwattr $C$DW$508, DW_AT_decl_column(0x25)
    5296                    
    5297                    $C$DW$509       .dwtag  DW_TAG_member
    5298                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$106)
    5299                            .dwattr $C$DW$509, DW_AT_name("SelectCompBRef")
    5300                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("SelectCompBRef")
    5301                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    5302                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    5303                            .dwattr $C$DW$509, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5304                            .dwattr $C$DW$509, DW_AT_decl_line(0x88)
    5305                            .dwattr $C$DW$509, DW_AT_decl_column(0x25)
    5306                    
    5307                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    5308                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x75)
    5309                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x01)
    5310                            .dwendtag $C$DW$T$107
    5311                    
    5312                    $C$DW$T$1097    .dwtag  DW_TAG_typedef
    5313                            .dwattr $C$DW$T$1097, DW_AT_name("HARD_API_T")
    5314                            .dwattr $C$DW$T$1097, DW_AT_type(*$C$DW$T$107)
    5315                            .dwattr $C$DW$T$1097, DW_AT_language(DW_LANG_C)
    5316                            .dwattr $C$DW$T$1097, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\device
    5317                            .dwattr $C$DW$T$1097, DW_AT_decl_line(0x89)
    5318                            .dwattr $C$DW$T$1097, DW_AT_decl_column(0x03)
    5319                    
    5320                    
    5321                    $C$DW$T$110     .dwtag  DW_TAG_structure_type
    5322                            .dwattr $C$DW$T$110, DW_AT_byte_size(0x0a)
    5323                    $C$DW$510       .dwtag  DW_TAG_member
    5324                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$498)
    5325                            .dwattr $C$DW$510, DW_AT_name("addr")
    5326                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("addr")
    5327                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5328                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    5329                            .dwattr $C$DW$510, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\collector_cc1350lp\Applicatio
    5330                            .dwattr $C$DW$510, DW_AT_decl_line(0x4db)
    5331                            .dwattr $C$DW$510, DW_AT_decl_column(0x07)
    5332                    
    5333                    $C$DW$511       .dwtag  DW_TAG_member
    5334                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$109)
    5335                            .dwattr $C$DW$511, DW_AT_name("addrMode")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   98

    5336                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("addrMode")
    5337                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5338                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    5339                            .dwattr $C$DW$511, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\collector_cc1350lp\Applicatio
    5340                            .dwattr $C$DW$511, DW_AT_decl_line(0x4de)
    5341                            .dwattr $C$DW$511, DW_AT_decl_column(0x17)
    5342                    
    5343                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\collector_cc1350lp\Applicat
    5344                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x4d0)
    5345                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x01)
    5346                            .dwendtag $C$DW$T$110
    5347                    
    5348                    $C$DW$T$744     .dwtag  DW_TAG_typedef
    5349                            .dwattr $C$DW$T$744, DW_AT_name("ApiMac_sAddr_t")
    5350                            .dwattr $C$DW$T$744, DW_AT_type(*$C$DW$T$110)
    5351                            .dwattr $C$DW$T$744, DW_AT_language(DW_LANG_C)
    5352                            .dwattr $C$DW$T$744, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\collector_cc1350lp\Applicat
    5353                            .dwattr $C$DW$T$744, DW_AT_decl_line(0x4df)
    5354                            .dwattr $C$DW$T$744, DW_AT_decl_column(0x03)
    5355                    
    5356                    
    5357                    $C$DW$T$111     .dwtag  DW_TAG_structure_type
    5358                            .dwattr $C$DW$T$111, DW_AT_byte_size(0x08)
    5359                    $C$DW$512       .dwtag  DW_TAG_member
    5360                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$27)
    5361                            .dwattr $C$DW$512, DW_AT_name("frameCounter")
    5362                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("frameCounter")
    5363                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5364                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    5365                            .dwattr $C$DW$512, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\collector_cc1350lp\Applicatio
    5366                            .dwattr $C$DW$512, DW_AT_decl_line(0x575)
    5367                            .dwattr $C$DW$512, DW_AT_decl_column(0x1a)
    5368                    
    5369                    $C$DW$513       .dwtag  DW_TAG_member
    5370                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$89)
    5371                            .dwattr $C$DW$513, DW_AT_name("keyIdx")
    5372                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("keyIdx")
    5373                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5374                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    5375                            .dwattr $C$DW$513, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\collector_cc1350lp\Applicatio
    5376                            .dwattr $C$DW$513, DW_AT_decl_line(0x576)
    5377                            .dwattr $C$DW$513, DW_AT_decl_column(0x1a)
    5378                    
    5379                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\collector_cc1350lp\Applicat
    5380                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x574)
    5381                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x01)
    5382                            .dwendtag $C$DW$T$111
    5383                    
    5384                    $C$DW$T$804     .dwtag  DW_TAG_typedef
    5385                            .dwattr $C$DW$T$804, DW_AT_name("ApiMac_frameCntr_t")
    5386                            .dwattr $C$DW$T$804, DW_AT_type(*$C$DW$T$111)
    5387                            .dwattr $C$DW$T$804, DW_AT_language(DW_LANG_C)
    5388                            .dwattr $C$DW$T$804, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\collector_cc1350lp\Applicat
    5389                            .dwattr $C$DW$T$804, DW_AT_decl_line(0x577)
    5390                            .dwattr $C$DW$T$804, DW_AT_decl_column(0x03)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE   99

    5391                    
    5392                    $C$DW$T$805     .dwtag  DW_TAG_pointer_type
    5393                            .dwattr $C$DW$T$805, DW_AT_type(*$C$DW$T$804)
    5394                            .dwattr $C$DW$T$805, DW_AT_address_class(0x20)
    5395                    
    5396                    
    5397                    $C$DW$T$115     .dwtag  DW_TAG_structure_type
    5398                            .dwattr $C$DW$T$115, DW_AT_byte_size(0x40)
    5399                    $C$DW$514       .dwtag  DW_TAG_member
    5400                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$113)
    5401                            .dwattr $C$DW$514, DW_AT_name("beaconType")
    5402                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("beaconType")
    5403                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5404                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    5405                            .dwattr $C$DW$514, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\collector_cc1350lp\Applicatio
    5406                            .dwattr $C$DW$514, DW_AT_decl_line(0x886)
    5407                            .dwattr $C$DW$514, DW_AT_decl_column(0x19)
    5408                    
    5409                    $C$DW$515       .dwtag  DW_TAG_member
    5410                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$22)
    5411                            .dwattr $C$DW$515, DW_AT_name("bsn")
    5412                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("bsn")
    5413                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5414                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    5415                            .dwattr $C$DW$515, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\collector_cc1350lp\Applicatio
    5416                            .dwattr $C$DW$515, DW_AT_decl_line(0x888)
    5417                            .dwattr $C$DW$515, DW_AT_decl_column(0x0d)
    5418                    
    5419                    $C$DW$516       .dwtag  DW_TAG_member
    5420                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$114)
    5421                            .dwattr $C$DW$516, DW_AT_name("panDesc")
    5422                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("panDesc")
    5423                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5424                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    5425                            .dwattr $C$DW$516, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\collector_cc1350lp\Applicatio
    5426                            .dwattr $C$DW$516, DW_AT_decl_line(0x88a)
    5427                            .dwattr $C$DW$516, DW_AT_decl_column(0x16)
    5428                    
    5429                    $C$DW$517       .dwtag  DW_TAG_member
    5430                            .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$501)
    5431                            .dwattr $C$DW$517, DW_AT_name("beaconData")
    5432                            .dwattr $C$DW$517, DW_AT_TI_symbol_name("beaconData")
    5433                            .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5434                            .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    5435                            .dwattr $C$DW$517, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\collector_cc1350lp\Applicatio
    5436                            .dwattr $C$DW$517, DW_AT_decl_line(0x895)
    5437                            .dwattr $C$DW$517, DW_AT_decl_column(0x07)
    5438                    
    5439                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\collector_cc1350lp\Applicat
    5440                            .dwattr $C$DW$T$115, DW_AT_decl_line(0x884)
    5441                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x01)
    5442                            .dwendtag $C$DW$T$115
    5443                    
    5444                    $C$DW$T$658     .dwtag  DW_TAG_typedef
    5445                            .dwattr $C$DW$T$658, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E8CFFD46-0F67-493C-8961-E83E354427A6} PAGE  100

    5446                            .dwattr $C$DW$T$658, DW_AT_type(*$C$DW$T$115)
    5447                            .dwattr $C$DW$T$658, DW_AT_language(DW_LANG_C)
    5448                            .dwattr $C$DW$T$658, DW_AT_decl_file("C:\Users\Adrian\workspace_v8\collector_cc1350lp\Applicat
    5449                            .dwattr $C$DW$T$658, DW_AT_decl_line(0x896)
    5450                            .dwattr $C$DW$T$658, DW_AT_decl_column(0x03)
    5451                    
    5452                    $C$DW$T$659     .dwtag  DW_TAG_pointer_type
    5453                            .dwattr $C$DW$T$659, DW_AT_type(*$C$DW$T$658)
    5454                            .dwattr $C$DW$T$659, DW_AT_address_class(0x20)
    5455                    
    5456                    
    5457                    $C$DW$T$116     .dwtag  DW_TAG_structure_type
    5458                            .dwattr $C$DW$T$116, DW_AT_byte_size(0x08)
    5459                    $C$DW$518       .dwtag  DW_TAG_member
    5460                            .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$45)
    5461                            .dwattr $C$DW$518, DW_AT_name("pCurrEntry")
    5462                            .dwattr $C$DW$518, DW_AT_TI_symbol_name("pCurrEntry")
    5463                            .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5464                            .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    5465                            .dwattr $C$DW$518, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
