TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Wed Nov 28 13:22:07 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/OSAL/osal.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Adrian\workspace_v8\collector_cc1350lp\collector_cc
      13                    
      14                    ;*****************************************************************************

    7233                    
    7234                    $C$DW$T$210     .dwtag  DW_TAG_typedef
    7235                            .dwattr $C$DW$T$210, DW_AT_name("tFlashStateCommandsType")
    7236                            .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$209)
    7237                            .dwattr $C$DW$T$210, DW_AT_language(DW_LANG_C)
    7238                            .dwattr $C$DW$T$210, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    7239                            .dwattr $C$DW$T$210, DW_AT_decl_line(0xb0)
    7240                            .dwattr $C$DW$T$210, DW_AT_decl_column(0x03)
    7241                    
    7242                    
    7243                    $C$DW$T$211     .dwtag  DW_TAG_enumeration_type
    7244                            .dwattr $C$DW$T$211, DW_AT_byte_size(0x01)
    7245                    $C$DW$465       .dwtag  DW_TAG_enumerator
    7246                            .dwattr $C$DW$465, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    7247                            .dwattr $C$DW$465, DW_AT_const_value(0xe0)
    7248                            .dwattr $C$DW$465, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7249                            .dwattr $C$DW$465, DW_AT_decl_line(0x3de)
    7250                            .dwattr $C$DW$465, DW_AT_decl_column(0x04)
    7251                    
    7252                    $C$DW$466       .dwtag  DW_TAG_enumerator
    7253                            .dwattr $C$DW$466, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    7254                            .dwattr $C$DW$466, DW_AT_const_value(0xe1)
    7255                            .dwattr $C$DW$466, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7256                            .dwattr $C$DW$466, DW_AT_decl_line(0x3e0)
    7257                            .dwattr $C$DW$466, DW_AT_decl_column(0x04)
    7258                    
    7259                    $C$DW$467       .dwtag  DW_TAG_enumerator
    7260                            .dwattr $C$DW$467, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    7261                            .dwattr $C$DW$467, DW_AT_const_value(0xe2)
    7262                            .dwattr $C$DW$467, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7263                            .dwattr $C$DW$467, DW_AT_decl_line(0x3e2)
    7264                            .dwattr $C$DW$467, DW_AT_decl_column(0x04)
    7265                    
    7266                    $C$DW$468       .dwtag  DW_TAG_enumerator
    7267                            .dwattr $C$DW$468, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    7268                            .dwattr $C$DW$468, DW_AT_const_value(0xe3)
    7269                            .dwattr $C$DW$468, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7270                            .dwattr $C$DW$468, DW_AT_decl_line(0x3e4)
    7271                            .dwattr $C$DW$468, DW_AT_decl_column(0x04)
    7272                    
    7273                    $C$DW$469       .dwtag  DW_TAG_enumerator
    7274                            .dwattr $C$DW$469, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    7275                            .dwattr $C$DW$469, DW_AT_const_value(0xe4)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  134

    7276                            .dwattr $C$DW$469, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7277                            .dwattr $C$DW$469, DW_AT_decl_line(0x3e6)
    7278                            .dwattr $C$DW$469, DW_AT_decl_column(0x04)
    7279                    
    7280                    $C$DW$470       .dwtag  DW_TAG_enumerator
    7281                            .dwattr $C$DW$470, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    7282                            .dwattr $C$DW$470, DW_AT_const_value(0xe5)
    7283                            .dwattr $C$DW$470, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7284                            .dwattr $C$DW$470, DW_AT_decl_line(0x3e8)
    7285                            .dwattr $C$DW$470, DW_AT_decl_column(0x04)
    7286                    
    7287                            .dwattr $C$DW$T$211, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7288                            .dwattr $C$DW$T$211, DW_AT_decl_line(0x3dc)
    7289                            .dwattr $C$DW$T$211, DW_AT_decl_column(0x01)
    7290                            .dwendtag $C$DW$T$211
    7291                    
    7292                    $C$DW$T$212     .dwtag  DW_TAG_typedef
    7293                            .dwattr $C$DW$T$212, DW_AT_name("ICall_RemotiCmdEvent_t")
    7294                            .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$211)
    7295                            .dwattr $C$DW$T$212, DW_AT_language(DW_LANG_C)
    7296                            .dwattr $C$DW$T$212, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7297                            .dwattr $C$DW$T$212, DW_AT_decl_line(0x3e9)
    7298                            .dwattr $C$DW$T$212, DW_AT_decl_column(0x02)
    7299                    
    7300                    
    7301                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    7302                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    7303                    $C$DW$471       .dwtag  DW_TAG_member
    7304                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$21)
    7305                            .dwattr $C$DW$471, DW_AT_name("event")
    7306                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("event")
    7307                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7308                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    7309                            .dwattr $C$DW$471, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7310                            .dwattr $C$DW$471, DW_AT_decl_line(0x79)
    7311                            .dwattr $C$DW$471, DW_AT_decl_column(0x0a)
    7312                    
    7313                    $C$DW$472       .dwtag  DW_TAG_member
    7314                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$21)
    7315                            .dwattr $C$DW$472, DW_AT_name("status")
    7316                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("status")
    7317                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7318                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    7319                            .dwattr $C$DW$472, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7320                            .dwattr $C$DW$472, DW_AT_decl_line(0x7a)
    7321                            .dwattr $C$DW$472, DW_AT_decl_column(0x0a)
    7322                    
    7323                            .dwattr $C$DW$T$22, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7324                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x78)
    7325                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
    7326                            .dwendtag $C$DW$T$22
    7327                    
    7328                    $C$DW$T$93      .dwtag  DW_TAG_typedef
    7329                            .dwattr $C$DW$T$93, DW_AT_name("osal_event_hdr_t")
    7330                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$22)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  135

    7331                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    7332                            .dwattr $C$DW$T$93, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7333                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x7b)
    7334                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x03)
    7335                    
    7336                    $C$DW$T$215     .dwtag  DW_TAG_pointer_type
    7337                            .dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$93)
    7338                            .dwattr $C$DW$T$215, DW_AT_address_class(0x20)
    7339                    
    7340                    
    7341                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    7342                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x10)
    7343                    $C$DW$473       .dwtag  DW_TAG_member
    7344                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$14)
    7345                            .dwattr $C$DW$473, DW_AT_name("__max_align1")
    7346                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("__max_align1")
    7347                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7348                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    7349                            .dwattr $C$DW$473, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    7350                            .dwattr $C$DW$473, DW_AT_decl_line(0x70)
    7351                            .dwattr $C$DW$473, DW_AT_decl_column(0x0c)
    7352                    
    7353                    $C$DW$474       .dwtag  DW_TAG_member
    7354                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$18)
    7355                            .dwattr $C$DW$474, DW_AT_name("__max_align2")
    7356                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("__max_align2")
    7357                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7358                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    7359                            .dwattr $C$DW$474, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    7360                            .dwattr $C$DW$474, DW_AT_decl_line(0x71)
    7361                            .dwattr $C$DW$474, DW_AT_decl_column(0x0e)
    7362                    
    7363                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    7364                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x6f)
    7365                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    7366                            .dwendtag $C$DW$T$23
    7367                    
    7368                    $C$DW$T$217     .dwtag  DW_TAG_typedef
    7369                            .dwattr $C$DW$T$217, DW_AT_name("__max_align_t")
    7370                            .dwattr $C$DW$T$217, DW_AT_type(*$C$DW$T$23)
    7371                            .dwattr $C$DW$T$217, DW_AT_language(DW_LANG_C)
    7372                            .dwattr $C$DW$T$217, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    7373                            .dwattr $C$DW$T$217, DW_AT_decl_line(0x72)
    7374                            .dwattr $C$DW$T$217, DW_AT_decl_column(0x03)
    7375                    
    7376                    
    7377                    $C$DW$T$68      .dwtag  DW_TAG_structure_type
    7378                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x4c)
    7379                    $C$DW$475       .dwtag  DW_TAG_member
    7380                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$31)
    7381                            .dwattr $C$DW$475, DW_AT_name("Crc32")
    7382                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("Crc32")
    7383                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7384                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    7385                            .dwattr $C$DW$475, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  136

    7386                            .dwattr $C$DW$475, DW_AT_decl_line(0x76)
    7387                            .dwattr $C$DW$475, DW_AT_decl_column(0x25)
    7388                    
    7389                    $C$DW$476       .dwtag  DW_TAG_member
    7390                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$34)
    7391                            .dwattr $C$DW$476, DW_AT_name("FlashGetSize")
    7392                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("FlashGetSize")
    7393                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7394                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    7395                            .dwattr $C$DW$476, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7396                            .dwattr $C$DW$476, DW_AT_decl_line(0x77)
    7397                            .dwattr $C$DW$476, DW_AT_decl_column(0x25)
    7398                    
    7399                    $C$DW$477       .dwtag  DW_TAG_member
    7400                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$35)
    7401                            .dwattr $C$DW$477, DW_AT_name("GetChipId")
    7402                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("GetChipId")
    7403                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7404                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    7405                            .dwattr $C$DW$477, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7406                            .dwattr $C$DW$477, DW_AT_decl_line(0x78)
    7407                            .dwattr $C$DW$477, DW_AT_decl_column(0x25)
    7408                    
    7409                    $C$DW$478       .dwtag  DW_TAG_member
    7410                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$38)
    7411                            .dwattr $C$DW$478, DW_AT_name("ReservedLocation1")
    7412                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("ReservedLocation1")
    7413                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7414                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    7415                            .dwattr $C$DW$478, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7416                            .dwattr $C$DW$478, DW_AT_decl_line(0x79)
    7417                            .dwattr $C$DW$478, DW_AT_decl_column(0x25)
    7418                    
    7419                    $C$DW$479       .dwtag  DW_TAG_member
    7420                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$39)
    7421                            .dwattr $C$DW$479, DW_AT_name("ReservedLocation2")
    7422                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("ReservedLocation2")
    7423                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7424                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    7425                            .dwattr $C$DW$479, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7426                            .dwattr $C$DW$479, DW_AT_decl_line(0x7a)
    7427                            .dwattr $C$DW$479, DW_AT_decl_column(0x25)
    7428                    
    7429                    $C$DW$480       .dwtag  DW_TAG_member
    7430                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$40)
    7431                            .dwattr $C$DW$480, DW_AT_name("ReservedLocation3")
    7432                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("ReservedLocation3")
    7433                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7434                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    7435                            .dwattr $C$DW$480, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7436                            .dwattr $C$DW$480, DW_AT_decl_line(0x7b)
    7437                            .dwattr $C$DW$480, DW_AT_decl_column(0x25)
    7438                    
    7439                    $C$DW$481       .dwtag  DW_TAG_member
    7440                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$43)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  137

    7441                            .dwattr $C$DW$481, DW_AT_name("ResetDevice")
    7442                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("ResetDevice")
    7443                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7444                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    7445                            .dwattr $C$DW$481, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7446                            .dwattr $C$DW$481, DW_AT_decl_line(0x7c)
    7447                            .dwattr $C$DW$481, DW_AT_decl_column(0x25)
    7448                    
    7449                    $C$DW$482       .dwtag  DW_TAG_member
    7450                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$49)
    7451                            .dwattr $C$DW$482, DW_AT_name("Fletcher32")
    7452                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("Fletcher32")
    7453                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7454                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    7455                            .dwattr $C$DW$482, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7456                            .dwattr $C$DW$482, DW_AT_decl_line(0x7d)
    7457                            .dwattr $C$DW$482, DW_AT_decl_column(0x25)
    7458                    
    7459                    $C$DW$483       .dwtag  DW_TAG_member
    7460                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$53)
    7461                            .dwattr $C$DW$483, DW_AT_name("MinValue")
    7462                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("MinValue")
    7463                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7464                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    7465                            .dwattr $C$DW$483, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7466                            .dwattr $C$DW$483, DW_AT_decl_line(0x7e)
    7467                            .dwattr $C$DW$483, DW_AT_decl_column(0x25)
    7468                    
    7469                    $C$DW$484       .dwtag  DW_TAG_member
    7470                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$54)
    7471                            .dwattr $C$DW$484, DW_AT_name("MaxValue")
    7472                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("MaxValue")
    7473                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7474                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    7475                            .dwattr $C$DW$484, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7476                            .dwattr $C$DW$484, DW_AT_decl_line(0x7f)
    7477                            .dwattr $C$DW$484, DW_AT_decl_column(0x25)
    7478                    
    7479                    $C$DW$485       .dwtag  DW_TAG_member
    7480                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$55)
    7481                            .dwattr $C$DW$485, DW_AT_name("MeanValue")
    7482                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("MeanValue")
    7483                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7484                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    7485                            .dwattr $C$DW$485, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7486                            .dwattr $C$DW$485, DW_AT_decl_line(0x80)
    7487                            .dwattr $C$DW$485, DW_AT_decl_column(0x25)
    7488                    
    7489                    $C$DW$486       .dwtag  DW_TAG_member
    7490                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$56)
    7491                            .dwattr $C$DW$486, DW_AT_name("StandDeviationValue")
    7492                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("StandDeviationValue")
    7493                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7494                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    7495                            .dwattr $C$DW$486, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  138

    7496                            .dwattr $C$DW$486, DW_AT_decl_line(0x81)
    7497                            .dwattr $C$DW$486, DW_AT_decl_column(0x25)
    7498                    
    7499                    $C$DW$487       .dwtag  DW_TAG_member
    7500                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$59)
    7501                            .dwattr $C$DW$487, DW_AT_name("ReservedLocation4")
    7502                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("ReservedLocation4")
    7503                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7504                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    7505                            .dwattr $C$DW$487, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7506                            .dwattr $C$DW$487, DW_AT_decl_line(0x82)
    7507                            .dwattr $C$DW$487, DW_AT_decl_column(0x25)
    7508                    
    7509                    $C$DW$488       .dwtag  DW_TAG_member
    7510                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$60)
    7511                            .dwattr $C$DW$488, DW_AT_name("ReservedLocation5")
    7512                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("ReservedLocation5")
    7513                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7514                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    7515                            .dwattr $C$DW$488, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7516                            .dwattr $C$DW$488, DW_AT_decl_line(0x83)
    7517                            .dwattr $C$DW$488, DW_AT_decl_column(0x25)
    7518                    
    7519                    $C$DW$489       .dwtag  DW_TAG_member
    7520                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$61)
    7521                            .dwattr $C$DW$489, DW_AT_name("HFSourceSafeSwitch")
    7522                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    7523                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7524                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    7525                            .dwattr $C$DW$489, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7526                            .dwattr $C$DW$489, DW_AT_decl_line(0x84)
    7527                            .dwattr $C$DW$489, DW_AT_decl_column(0x25)
    7528                    
    7529                    $C$DW$490       .dwtag  DW_TAG_member
    7530                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$64)
    7531                            .dwattr $C$DW$490, DW_AT_name("SelectCompAInput")
    7532                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("SelectCompAInput")
    7533                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    7534                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    7535                            .dwattr $C$DW$490, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7536                            .dwattr $C$DW$490, DW_AT_decl_line(0x85)
    7537                            .dwattr $C$DW$490, DW_AT_decl_column(0x25)
    7538                    
    7539                    $C$DW$491       .dwtag  DW_TAG_member
    7540                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$65)
    7541                            .dwattr $C$DW$491, DW_AT_name("SelectCompARef")
    7542                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("SelectCompARef")
    7543                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7544                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    7545                            .dwattr $C$DW$491, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7546                            .dwattr $C$DW$491, DW_AT_decl_line(0x86)
    7547                            .dwattr $C$DW$491, DW_AT_decl_column(0x25)
    7548                    
    7549                    $C$DW$492       .dwtag  DW_TAG_member
    7550                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$66)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  139

    7551                            .dwattr $C$DW$492, DW_AT_name("SelectADCCompBInput")
    7552                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("SelectADCCompBInput")
    7553                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7554                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    7555                            .dwattr $C$DW$492, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7556                            .dwattr $C$DW$492, DW_AT_decl_line(0x87)
    7557                            .dwattr $C$DW$492, DW_AT_decl_column(0x25)
    7558                    
    7559                    $C$DW$493       .dwtag  DW_TAG_member
    7560                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$67)
    7561                            .dwattr $C$DW$493, DW_AT_name("SelectCompBRef")
    7562                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("SelectCompBRef")
    7563                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7564                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    7565                            .dwattr $C$DW$493, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7566                            .dwattr $C$DW$493, DW_AT_decl_line(0x88)
    7567                            .dwattr $C$DW$493, DW_AT_decl_column(0x25)
    7568                    
    7569                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    7570                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x75)
    7571                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x01)
    7572                            .dwendtag $C$DW$T$68
    7573                    
    7574                    $C$DW$T$218     .dwtag  DW_TAG_typedef
    7575                            .dwattr $C$DW$T$218, DW_AT_name("HARD_API_T")
    7576                            .dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$68)
    7577                            .dwattr $C$DW$T$218, DW_AT_language(DW_LANG_C)
    7578                            .dwattr $C$DW$T$218, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    7579                            .dwattr $C$DW$T$218, DW_AT_decl_line(0x89)
    7580                            .dwattr $C$DW$T$218, DW_AT_decl_column(0x03)
    7581                    
    7582                    
    7583                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
    7584                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x08)
    7585                    $C$DW$494       .dwtag  DW_TAG_member
    7586                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$10)
    7587                            .dwattr $C$DW$494, DW_AT_name("quot")
    7588                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("quot")
    7589                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7590                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    7591                            .dwattr $C$DW$494, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    7592                            .dwattr $C$DW$494, DW_AT_decl_line(0x49)
    7593                            .dwattr $C$DW$494, DW_AT_decl_column(0x16)
    7594                    
    7595                    $C$DW$495       .dwtag  DW_TAG_member
    7596                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$10)
    7597                            .dwattr $C$DW$495, DW_AT_name("rem")
    7598                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("rem")
    7599                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7600                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    7601                            .dwattr $C$DW$495, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    7602                            .dwattr $C$DW$495, DW_AT_decl_line(0x49)
    7603                            .dwattr $C$DW$495, DW_AT_decl_column(0x1c)
    7604                    
    7605                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  140

    7606                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x49)
    7607                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x10)
    7608                            .dwendtag $C$DW$T$69
    7609                    
    7610                    $C$DW$T$219     .dwtag  DW_TAG_typedef
    7611                            .dwattr $C$DW$T$219, DW_AT_name("div_t")
    7612                            .dwattr $C$DW$T$219, DW_AT_type(*$C$DW$T$69)
    7613                            .dwattr $C$DW$T$219, DW_AT_language(DW_LANG_C)
    7614                            .dwattr $C$DW$T$219, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    7615                            .dwattr $C$DW$T$219, DW_AT_decl_line(0x49)
    7616                            .dwattr $C$DW$T$219, DW_AT_decl_column(0x23)
    7617                    
    7618                    
    7619                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    7620                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x08)
    7621                    $C$DW$496       .dwtag  DW_TAG_member
    7622                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$10)
    7623                            .dwattr $C$DW$496, DW_AT_name("quot")
    7624                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("quot")
    7625                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7626                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    7627                            .dwattr $C$DW$496, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    7628                            .dwattr $C$DW$496, DW_AT_decl_line(0x4e)
    7629                            .dwattr $C$DW$496, DW_AT_decl_column(0x16)
    7630                    
    7631                    $C$DW$497       .dwtag  DW_TAG_member
    7632                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$10)
    7633                            .dwattr $C$DW$497, DW_AT_name("rem")
    7634                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("rem")
    7635                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7636                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    7637                            .dwattr $C$DW$497, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    7638                            .dwattr $C$DW$497, DW_AT_decl_line(0x4e)
    7639                            .dwattr $C$DW$497, DW_AT_decl_column(0x1c)
    7640                    
    7641                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    7642                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x4e)
    7643                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x10)
    7644                            .dwendtag $C$DW$T$70
    7645                    
    7646                    $C$DW$T$220     .dwtag  DW_TAG_typedef
    7647                            .dwattr $C$DW$T$220, DW_AT_name("ldiv_t")
    7648                            .dwattr $C$DW$T$220, DW_AT_type(*$C$DW$T$70)
    7649                            .dwattr $C$DW$T$220, DW_AT_language(DW_LANG_C)
    7650                            .dwattr $C$DW$T$220, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    7651                            .dwattr $C$DW$T$220, DW_AT_decl_line(0x4e)
    7652                            .dwattr $C$DW$T$220, DW_AT_decl_column(0x23)
    7653                    
    7654                    
    7655                    $C$DW$T$71      .dwtag  DW_TAG_structure_type
    7656                            .dwattr $C$DW$T$71, DW_AT_byte_size(0x10)
    7657                    $C$DW$498       .dwtag  DW_TAG_member
    7658                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$14)
    7659                            .dwattr $C$DW$498, DW_AT_name("quot")
    7660                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("quot")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  141

    7661                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7662                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    7663                            .dwattr $C$DW$498, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    7664                            .dwattr $C$DW$498, DW_AT_decl_line(0x56)
    7665                            .dwattr $C$DW$498, DW_AT_decl_column(0x1c)
    7666                    
    7667                    $C$DW$499       .dwtag  DW_TAG_member
    7668                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$14)
    7669                            .dwattr $C$DW$499, DW_AT_name("rem")
    7670                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("rem")
    7671                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7672                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    7673                            .dwattr $C$DW$499, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    7674                            .dwattr $C$DW$499, DW_AT_decl_line(0x56)
    7675                            .dwattr $C$DW$499, DW_AT_decl_column(0x22)
    7676                    
    7677                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    7678                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x56)
    7679                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x10)
    7680                            .dwendtag $C$DW$T$71
    7681                    
    7682                    $C$DW$T$221     .dwtag  DW_TAG_typedef
    7683                            .dwattr $C$DW$T$221, DW_AT_name("lldiv_t")
    7684                            .dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$71)
    7685                            .dwattr $C$DW$T$221, DW_AT_language(DW_LANG_C)
    7686                            .dwattr $C$DW$T$221, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    7687                            .dwattr $C$DW$T$221, DW_AT_decl_line(0x56)
    7688                            .dwattr $C$DW$T$221, DW_AT_decl_column(0x29)
    7689                    
    7690                    
    7691                    $C$DW$T$76      .dwtag  DW_TAG_structure_type
    7692                            .dwattr $C$DW$T$76, DW_AT_byte_size(0x08)
    7693                    $C$DW$500       .dwtag  DW_TAG_member
    7694                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$74)
    7695                            .dwattr $C$DW$500, DW_AT_name("pointerStack")
    7696                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("pointerStack")
    7697                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7698                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    7699                            .dwattr $C$DW$500, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7700                            .dwattr $C$DW$500, DW_AT_decl_line(0x3f5)
    7701                            .dwattr $C$DW$500, DW_AT_decl_column(0x16)
    7702                    
    7703                    $C$DW$501       .dwtag  DW_TAG_member
    7704                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$75)
    7705                            .dwattr $C$DW$501, DW_AT_name("directAPI")
    7706                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("directAPI")
    7707                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7708                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    7709                            .dwattr $C$DW$501, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7710                            .dwattr $C$DW$501, DW_AT_decl_line(0x3f6)
    7711                            .dwattr $C$DW$501, DW_AT_decl_column(0x15)
    7712                    
    7713                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7714                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x3f4)
    7715                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x01)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  142

    7716                            .dwendtag $C$DW$T$76
    7717                    
    7718                    $C$DW$T$78      .dwtag  DW_TAG_typedef
    7719                            .dwattr $C$DW$T$78, DW_AT_name("icall_directAPIMsg_t")
    7720                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$76)
    7721                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    7722                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7723                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x3f7)
    7724                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    7725                    
    7726                    
    7727                    $C$DW$T$79      .dwtag  DW_TAG_structure_type
    7728                            .dwattr $C$DW$T$79, DW_AT_byte_size(0x14)
    7729                    $C$DW$502       .dwtag  DW_TAG_member
    7730                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$77)
    7731                            .dwattr $C$DW$502, DW_AT_name("hdr")
    7732                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("hdr")
    7733                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7734                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    7735                            .dwattr $C$DW$502, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7736                            .dwattr $C$DW$502, DW_AT_decl_line(0x3fb)
    7737                            .dwattr $C$DW$502, DW_AT_decl_column(0x10)
    7738                    
    7739                    $C$DW$503       .dwtag  DW_TAG_member
    7740                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$78)
    7741                            .dwattr $C$DW$503, DW_AT_name("msg")
    7742                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("msg")
    7743                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7744                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    7745                            .dwattr $C$DW$503, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7746                            .dwattr $C$DW$503, DW_AT_decl_line(0x3fc)
    7747                            .dwattr $C$DW$503, DW_AT_decl_column(0x1a)
    7748                    
    7749                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7750                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x3fa)
    7751                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x01)
    7752                            .dwendtag $C$DW$T$79
    7753                    
    7754                    $C$DW$T$222     .dwtag  DW_TAG_typedef
    7755                            .dwattr $C$DW$T$222, DW_AT_name("icallLiteMsg_t")
    7756                            .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$79)
    7757                            .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    7758                            .dwattr $C$DW$T$222, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7759                            .dwattr $C$DW$T$222, DW_AT_decl_line(0x3fd)
    7760                            .dwattr $C$DW$T$222, DW_AT_decl_column(0x03)
    7761                    
    7762                    
    7763                    $C$DW$T$81      .dwtag  DW_TAG_structure_type
    7764                            .dwattr $C$DW$T$81, DW_AT_byte_size(0x02)
    7765                    $C$DW$504       .dwtag  DW_TAG_member
    7766                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$80)
    7767                            .dwattr $C$DW$504, DW_AT_name("pwrmgr_task_state")
    7768                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("pwrmgr_task_state")
    7769                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7770                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  143

    7771                            .dwattr $C$DW$504, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
    7772                            .dwattr $C$DW$504, DW_AT_decl_line(0x48)
    7773                            .dwattr $C$DW$504, DW_AT_decl_column(0x0a)
    7774                    
    7775                            .dwattr $C$DW$T$81, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
    7776                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x47)
    7777                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x01)
    7778                            .dwendtag $C$DW$T$81
    7779                    
    7780                    $C$DW$T$223     .dwtag  DW_TAG_typedef
    7781                            .dwattr $C$DW$T$223, DW_AT_name("pwrmgr_attribute_t")
    7782                            .dwattr $C$DW$T$223, DW_AT_type(*$C$DW$T$81)
    7783                            .dwattr $C$DW$T$223, DW_AT_language(DW_LANG_C)
    7784                            .dwattr $C$DW$T$223, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
    7785                            .dwattr $C$DW$T$223, DW_AT_decl_line(0x4e)
    7786                            .dwattr $C$DW$T$223, DW_AT_decl_column(0x03)
    7787                    
    7788                    
    7789                    $C$DW$T$82      .dwtag  DW_TAG_structure_type
    7790                            .dwattr $C$DW$T$82, DW_AT_byte_size(0x08)
    7791                    $C$DW$505       .dwtag  DW_TAG_member
    7792                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$21)
    7793                            .dwattr $C$DW$505, DW_AT_name("seconds")
    7794                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("seconds")
    7795                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7796                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    7797                            .dwattr $C$DW$505, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7798                            .dwattr $C$DW$505, DW_AT_decl_line(0x50)
    7799                            .dwattr $C$DW$505, DW_AT_decl_column(0x09)
    7800                    
    7801                    $C$DW$506       .dwtag  DW_TAG_member
    7802                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$21)
    7803                            .dwattr $C$DW$506, DW_AT_name("minutes")
    7804                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("minutes")
    7805                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7806                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    7807                            .dwattr $C$DW$506, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7808                            .dwattr $C$DW$506, DW_AT_decl_line(0x51)
    7809                            .dwattr $C$DW$506, DW_AT_decl_column(0x09)
    7810                    
    7811                    $C$DW$507       .dwtag  DW_TAG_member
    7812                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$21)
    7813                            .dwattr $C$DW$507, DW_AT_name("hour")
    7814                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("hour")
    7815                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7816                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    7817                            .dwattr $C$DW$507, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7818                            .dwattr $C$DW$507, DW_AT_decl_line(0x52)
    7819                            .dwattr $C$DW$507, DW_AT_decl_column(0x09)
    7820                    
    7821                    $C$DW$508       .dwtag  DW_TAG_member
    7822                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$21)
    7823                            .dwattr $C$DW$508, DW_AT_name("day")
    7824                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("day")
    7825                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  144

    7826                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    7827                            .dwattr $C$DW$508, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7828                            .dwattr $C$DW$508, DW_AT_decl_line(0x53)
    7829                            .dwattr $C$DW$508, DW_AT_decl_column(0x09)
    7830                    
    7831                    $C$DW$509       .dwtag  DW_TAG_member
    7832                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$21)
    7833                            .dwattr $C$DW$509, DW_AT_name("month")
    7834                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("month")
    7835                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7836                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    7837                            .dwattr $C$DW$509, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7838                            .dwattr $C$DW$509, DW_AT_decl_line(0x54)
    7839                            .dwattr $C$DW$509, DW_AT_decl_column(0x09)
    7840                    
    7841                    $C$DW$510       .dwtag  DW_TAG_member
    7842                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$80)
    7843                            .dwattr $C$DW$510, DW_AT_name("year")
    7844                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("year")
    7845                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7846                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    7847                            .dwattr $C$DW$510, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7848                            .dwattr $C$DW$510, DW_AT_decl_line(0x55)
    7849                            .dwattr $C$DW$510, DW_AT_decl_column(0x0a)
    7850                    
    7851                            .dwattr $C$DW$T$82, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7852                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x4f)
    7853                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x01)
    7854                            .dwendtag $C$DW$T$82
    7855                    
    7856                    $C$DW$T$224     .dwtag  DW_TAG_typedef
    7857                            .dwattr $C$DW$T$224, DW_AT_name("UTCTimeStruct")
    7858                            .dwattr $C$DW$T$224, DW_AT_type(*$C$DW$T$82)
    7859                            .dwattr $C$DW$T$224, DW_AT_language(DW_LANG_C)
    7860                            .dwattr $C$DW$T$224, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7861                            .dwattr $C$DW$T$224, DW_AT_decl_line(0x56)
    7862                            .dwattr $C$DW$T$224, DW_AT_decl_column(0x03)
    7863                    
    7864                    
    7865                    $C$DW$T$85      .dwtag  DW_TAG_structure_type
    7866                            .dwattr $C$DW$T$85, DW_AT_byte_size(0x0c)
    7867                    $C$DW$511       .dwtag  DW_TAG_member
    7868                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$83)
    7869                            .dwattr $C$DW$511, DW_AT_name("bufferHead")
    7870                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("bufferHead")
    7871                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7872                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    7873                            .dwattr $C$DW$511, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7874                            .dwattr $C$DW$511, DW_AT_decl_line(0x80)
    7875                            .dwattr $C$DW$511, DW_AT_decl_column(0x13)
    7876                    
    7877                    $C$DW$512       .dwtag  DW_TAG_member
    7878                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$83)
    7879                            .dwattr $C$DW$512, DW_AT_name("bufferTail")
    7880                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("bufferTail")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  145

    7881                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7882                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    7883                            .dwattr $C$DW$512, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7884                            .dwattr $C$DW$512, DW_AT_decl_line(0x81)
    7885                            .dwattr $C$DW$512, DW_AT_decl_column(0x13)
    7886                    
    7887                    $C$DW$513       .dwtag  DW_TAG_member
    7888                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$80)
    7889                            .dwattr $C$DW$513, DW_AT_name("maxBufSize")
    7890                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("maxBufSize")
    7891                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7892                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    7893                            .dwattr $C$DW$513, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7894                            .dwattr $C$DW$513, DW_AT_decl_line(0x82)
    7895                            .dwattr $C$DW$513, DW_AT_decl_column(0x0a)
    7896                    
    7897                    $C$DW$514       .dwtag  DW_TAG_member
    7898                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$84)
    7899                            .dwattr $C$DW$514, DW_AT_name("pBuffer")
    7900                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("pBuffer")
    7901                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7902                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    7903                            .dwattr $C$DW$514, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7904                            .dwattr $C$DW$514, DW_AT_decl_line(0x83)
    7905                            .dwattr $C$DW$514, DW_AT_decl_column(0x0a)
    7906                    
    7907                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7908                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x7e)
    7909                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x01)
    7910                            .dwendtag $C$DW$T$85
    7911                    
    7912                    $C$DW$T$87      .dwtag  DW_TAG_typedef
    7913                            .dwattr $C$DW$T$87, DW_AT_name("halUARTBufControl_t")
    7914                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$85)
    7915                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    7916                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7917                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x84)
    7918                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
    7919                    
    7920                    
    7921                    $C$DW$T$92      .dwtag  DW_TAG_structure_type
    7922                            .dwattr $C$DW$T$92, DW_AT_byte_size(0x2c)
    7923                    $C$DW$515       .dwtag  DW_TAG_member
    7924                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$86)
    7925                            .dwattr $C$DW$515, DW_AT_name("configured")
    7926                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("configured")
    7927                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7928                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    7929                            .dwattr $C$DW$515, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7930                            .dwattr $C$DW$515, DW_AT_decl_line(0x88)
    7931                            .dwattr $C$DW$515, DW_AT_decl_column(0x17)
    7932                    
    7933                    $C$DW$516       .dwtag  DW_TAG_member
    7934                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$21)
    7935                            .dwattr $C$DW$516, DW_AT_name("baudRate")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  146

    7936                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("baudRate")
    7937                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7938                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    7939                            .dwattr $C$DW$516, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7940                            .dwattr $C$DW$516, DW_AT_decl_line(0x89)
    7941                            .dwattr $C$DW$516, DW_AT_decl_column(0x17)
    7942                    
    7943                    $C$DW$517       .dwtag  DW_TAG_member
    7944                            .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$86)
    7945                            .dwattr $C$DW$517, DW_AT_name("flowControl")
    7946                            .dwattr $C$DW$517, DW_AT_TI_symbol_name("flowControl")
    7947                            .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7948                            .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    7949                            .dwattr $C$DW$517, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7950                            .dwattr $C$DW$517, DW_AT_decl_line(0x8a)
    7951                            .dwattr $C$DW$517, DW_AT_decl_column(0x17)
    7952                    
    7953                    $C$DW$518       .dwtag  DW_TAG_member
    7954                            .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$80)
    7955                            .dwattr $C$DW$518, DW_AT_name("flowControlThreshold")
    7956                            .dwattr $C$DW$518, DW_AT_TI_symbol_name("flowControlThreshold")
    7957                            .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7958                            .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    7959                            .dwattr $C$DW$518, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7960                            .dwattr $C$DW$518, DW_AT_decl_line(0x8b)
    7961                            .dwattr $C$DW$518, DW_AT_decl_column(0x17)
    7962                    
    7963                    $C$DW$519       .dwtag  DW_TAG_member
    7964                            .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$21)
    7965                            .dwattr $C$DW$519, DW_AT_name("idleTimeout")
    7966                            .dwattr $C$DW$519, DW_AT_TI_symbol_name("idleTimeout")
    7967                            .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7968                            .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    7969                            .dwattr $C$DW$519, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7970                            .dwattr $C$DW$519, DW_AT_decl_line(0x8c)
    7971                            .dwattr $C$DW$519, DW_AT_decl_column(0x17)
    7972                    
    7973                    $C$DW$520       .dwtag  DW_TAG_member
    7974                            .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$87)
    7975                            .dwattr $C$DW$520, DW_AT_name("rx")
    7976                            .dwattr $C$DW$520, DW_AT_TI_symbol_name("rx")
    7977                            .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7978                            .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    7979                            .dwattr $C$DW$520, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7980                            .dwattr $C$DW$520, DW_AT_decl_line(0x8d)
    7981                            .dwattr $C$DW$520, DW_AT_decl_column(0x17)
    7982                    
    7983                    $C$DW$521       .dwtag  DW_TAG_member
    7984                            .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$87)
    7985                            .dwattr $C$DW$521, DW_AT_name("tx")
    7986                            .dwattr $C$DW$521, DW_AT_TI_symbol_name("tx")
    7987                            .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7988                            .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    7989                            .dwattr $C$DW$521, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7990                            .dwattr $C$DW$521, DW_AT_decl_line(0x8e)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  147

    7991                            .dwattr $C$DW$521, DW_AT_decl_column(0x17)
    7992                    
    7993                    $C$DW$522       .dwtag  DW_TAG_member
    7994                            .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$86)
    7995                            .dwattr $C$DW$522, DW_AT_name("intEnable")
    7996                            .dwattr $C$DW$522, DW_AT_TI_symbol_name("intEnable")
    7997                            .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7998                            .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    7999                            .dwattr $C$DW$522, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8000                            .dwattr $C$DW$522, DW_AT_decl_line(0x8f)
    8001                            .dwattr $C$DW$522, DW_AT_decl_column(0x17)
    8002                    
    8003                    $C$DW$523       .dwtag  DW_TAG_member
    8004                            .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$88)
    8005                            .dwattr $C$DW$523, DW_AT_name("rxChRvdTime")
    8006                            .dwattr $C$DW$523, DW_AT_TI_symbol_name("rxChRvdTime")
    8007                            .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8008                            .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    8009                            .dwattr $C$DW$523, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8010                            .dwattr $C$DW$523, DW_AT_decl_line(0x90)
    8011                            .dwattr $C$DW$523, DW_AT_decl_column(0x17)
    8012                    
    8013                    $C$DW$524       .dwtag  DW_TAG_member
    8014                            .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$91)
    8015                            .dwattr $C$DW$524, DW_AT_name("callBackFunc")
    8016                            .dwattr $C$DW$524, DW_AT_TI_symbol_name("callBackFunc")
    8017                            .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8018                            .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    8019                            .dwattr $C$DW$524, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8020                            .dwattr $C$DW$524, DW_AT_decl_line(0x91)
    8021                            .dwattr $C$DW$524, DW_AT_decl_column(0x17)
    8022                    
    8023                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    8024                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x87)
    8025                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x01)
    8026                            .dwendtag $C$DW$T$92
    8027                    
    8028                    $C$DW$T$225     .dwtag  DW_TAG_typedef
    8029                            .dwattr $C$DW$T$225, DW_AT_name("halUARTCfg_t")
    8030                            .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$92)
    8031                            .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    8032                            .dwattr $C$DW$T$225, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8033                            .dwattr $C$DW$T$225, DW_AT_decl_line(0x92)
    8034                            .dwattr $C$DW$T$225, DW_AT_decl_column(0x02)
    8035                    
    8036                    
    8037                    $C$DW$T$94      .dwtag  DW_TAG_structure_type
    8038                            .dwattr $C$DW$T$94, DW_AT_byte_size(0x04)
    8039                    $C$DW$525       .dwtag  DW_TAG_member
    8040                            .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$93)
    8041                            .dwattr $C$DW$525, DW_AT_name("hdr")
    8042                            .dwattr $C$DW$525, DW_AT_TI_symbol_name("hdr")
    8043                            .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8044                            .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    8045                            .dwattr $C$DW$525, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  148

    8046                            .dwattr $C$DW$525, DW_AT_decl_line(0xbc)
    8047                            .dwattr $C$DW$525, DW_AT_decl_column(0x14)
    8048                    
    8049                    $C$DW$526       .dwtag  DW_TAG_member
    8050                            .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$21)
    8051                            .dwattr $C$DW$526, DW_AT_name("state")
    8052                            .dwattr $C$DW$526, DW_AT_TI_symbol_name("state")
    8053                            .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8054                            .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    8055                            .dwattr $C$DW$526, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    8056                            .dwattr $C$DW$526, DW_AT_decl_line(0xbd)
    8057                            .dwattr $C$DW$526, DW_AT_decl_column(0x09)
    8058                    
    8059                    $C$DW$527       .dwtag  DW_TAG_member
    8060                            .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$21)
    8061                            .dwattr $C$DW$527, DW_AT_name("keys")
    8062                            .dwattr $C$DW$527, DW_AT_TI_symbol_name("keys")
    8063                            .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8064                            .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    8065                            .dwattr $C$DW$527, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    8066                            .dwattr $C$DW$527, DW_AT_decl_line(0xbe)
    8067                            .dwattr $C$DW$527, DW_AT_decl_column(0x09)
    8068                    
    8069                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC13
    8070                            .dwattr $C$DW$T$94, DW_AT_decl_line(0xbb)
    8071                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x01)
    8072                            .dwendtag $C$DW$T$94
    8073                    
    8074                    $C$DW$T$226     .dwtag  DW_TAG_typedef
    8075                            .dwattr $C$DW$T$226, DW_AT_name("keyChange_t")
    8076                            .dwattr $C$DW$T$226, DW_AT_type(*$C$DW$T$94)
    8077                            .dwattr $C$DW$T$226, DW_AT_language(DW_LANG_C)
    8078                            .dwattr $C$DW$T$226, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    8079                            .dwattr $C$DW$T$226, DW_AT_decl_line(0xbf)
    8080                            .dwattr $C$DW$T$226, DW_AT_decl_column(0x03)
    8081                    
    8082                    
    8083                    $C$DW$T$101     .dwtag  DW_TAG_union_type
    8084                            .dwattr $C$DW$T$101, DW_AT_byte_size(0x02)
    8085                    $C$DW$528       .dwtag  DW_TAG_member
    8086                            .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$97)
    8087                            .dwattr $C$DW$528, DW_AT_name("entityId")
    8088                            .dwattr $C$DW$528, DW_AT_TI_symbol_name("entityId")
    8089                            .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8090                            .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    8091                            .dwattr $C$DW$528, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8092                            .dwattr $C$DW$528, DW_AT_decl_line(0x1fe)
    8093                            .dwattr $C$DW$528, DW_AT_decl_column(0x14)
    8094                    
    8095                    $C$DW$529       .dwtag  DW_TAG_member
    8096                            .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$100)
    8097                            .dwattr $C$DW$529, DW_AT_name("servId")
    8098                            .dwattr $C$DW$529, DW_AT_TI_symbol_name("servId")
    8099                            .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8100                            .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  149

    8101                            .dwattr $C$DW$529, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8102                            .dwattr $C$DW$529, DW_AT_decl_line(0x200)
    8103                            .dwattr $C$DW$529, DW_AT_decl_column(0x17)
    8104                    
    8105                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8106                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x1fc)
    8107                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x03)
    8108                            .dwendtag $C$DW$T$101
    8109                    
    8110                    
    8111                    $C$DW$T$102     .dwtag  DW_TAG_union_type
    8112                            .dwattr $C$DW$T$102, DW_AT_byte_size(0x02)
    8113                    $C$DW$530       .dwtag  DW_TAG_member
    8114                            .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$100)
    8115                            .dwattr $C$DW$530, DW_AT_name("servId")
    8116                            .dwattr $C$DW$530, DW_AT_TI_symbol_name("servId")
    8117                            .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8118                            .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    8119                            .dwattr $C$DW$530, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8120                            .dwattr $C$DW$530, DW_AT_decl_line(0x211)
    8121                            .dwattr $C$DW$530, DW_AT_decl_column(0x17)
    8122                    
    8123                    $C$DW$531       .dwtag  DW_TAG_member
    8124                            .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$97)
    8125                            .dwattr $C$DW$531, DW_AT_name("entityId")
    8126                            .dwattr $C$DW$531, DW_AT_TI_symbol_name("entityId")
    8127                            .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8128                            .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    8129                            .dwattr $C$DW$531, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8130                            .dwattr $C$DW$531, DW_AT_decl_line(0x213)
    8131                            .dwattr $C$DW$531, DW_AT_decl_column(0x14)
    8132                    
    8133                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8134                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x20f)
    8135                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x03)
    8136                            .dwendtag $C$DW$T$102
    8137                    
    8138                    
    8139                    $C$DW$T$103     .dwtag  DW_TAG_union_type
    8140                            .dwattr $C$DW$T$103, DW_AT_byte_size(0x02)
    8141                    $C$DW$532       .dwtag  DW_TAG_member
    8142                            .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$86)
    8143                            .dwattr $C$DW$532, DW_AT_name("paramCTS")
    8144                            .dwattr $C$DW$532, DW_AT_TI_symbol_name("paramCTS")
    8145                            .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8146                            .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    8147                            .dwattr $C$DW$532, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8148                            .dwattr $C$DW$532, DW_AT_decl_line(0x96)
    8149                            .dwattr $C$DW$532, DW_AT_decl_column(0x08)
    8150                    
    8151                    $C$DW$533       .dwtag  DW_TAG_member
    8152                            .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$86)
    8153                            .dwattr $C$DW$533, DW_AT_name("paramRTS")
    8154                            .dwattr $C$DW$533, DW_AT_TI_symbol_name("paramRTS")
    8155                            .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  150

    8156                            .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    8157                            .dwattr $C$DW$533, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8158                            .dwattr $C$DW$533, DW_AT_decl_line(0x97)
    8159                            .dwattr $C$DW$533, DW_AT_decl_column(0x08)
    8160                    
    8161                    $C$DW$534       .dwtag  DW_TAG_member
    8162                            .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$86)
    8163                            .dwattr $C$DW$534, DW_AT_name("paramDSR")
    8164                            .dwattr $C$DW$534, DW_AT_TI_symbol_name("paramDSR")
    8165                            .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8166                            .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    8167                            .dwattr $C$DW$534, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8168                            .dwattr $C$DW$534, DW_AT_decl_line(0x98)
    8169                            .dwattr $C$DW$534, DW_AT_decl_column(0x08)
    8170                    
    8171                    $C$DW$535       .dwtag  DW_TAG_member
    8172                            .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$86)
    8173                            .dwattr $C$DW$535, DW_AT_name("paramDTR")
    8174                            .dwattr $C$DW$535, DW_AT_TI_symbol_name("paramDTR")
    8175                            .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8176                            .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    8177                            .dwattr $C$DW$535, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8178                            .dwattr $C$DW$535, DW_AT_decl_line(0x99)
    8179                            .dwattr $C$DW$535, DW_AT_decl_column(0x08)
    8180                    
    8181                    $C$DW$536       .dwtag  DW_TAG_member
    8182                            .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$86)
    8183                            .dwattr $C$DW$536, DW_AT_name("paramCD")
    8184                            .dwattr $C$DW$536, DW_AT_TI_symbol_name("paramCD")
    8185                            .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8186                            .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    8187                            .dwattr $C$DW$536, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8188                            .dwattr $C$DW$536, DW_AT_decl_line(0x9a)
    8189                            .dwattr $C$DW$536, DW_AT_decl_column(0x08)
    8190                    
    8191                    $C$DW$537       .dwtag  DW_TAG_member
    8192                            .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$86)
    8193                            .dwattr $C$DW$537, DW_AT_name("paramRI")
    8194                            .dwattr $C$DW$537, DW_AT_TI_symbol_name("paramRI")
    8195                            .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8196                            .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    8197                            .dwattr $C$DW$537, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8198                            .dwattr $C$DW$537, DW_AT_decl_line(0x9b)
    8199                            .dwattr $C$DW$537, DW_AT_decl_column(0x08)
    8200                    
    8201                    $C$DW$538       .dwtag  DW_TAG_member
    8202                            .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$80)
    8203                            .dwattr $C$DW$538, DW_AT_name("baudRate")
    8204                            .dwattr $C$DW$538, DW_AT_TI_symbol_name("baudRate")
    8205                            .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8206                            .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    8207                            .dwattr $C$DW$538, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8208                            .dwattr $C$DW$538, DW_AT_decl_line(0x9c)
    8209                            .dwattr $C$DW$538, DW_AT_decl_column(0x0a)
    8210                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  151

    8211                    $C$DW$539       .dwtag  DW_TAG_member
    8212                            .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$86)
    8213                            .dwattr $C$DW$539, DW_AT_name("flowControl")
    8214                            .dwattr $C$DW$539, DW_AT_TI_symbol_name("flowControl")
    8215                            .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8216                            .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    8217                            .dwattr $C$DW$539, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8218                            .dwattr $C$DW$539, DW_AT_decl_line(0x9d)
    8219                            .dwattr $C$DW$539, DW_AT_decl_column(0x08)
    8220                    
    8221                    $C$DW$540       .dwtag  DW_TAG_member
    8222                            .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$86)
    8223                            .dwattr $C$DW$540, DW_AT_name("flushControl")
    8224                            .dwattr $C$DW$540, DW_AT_TI_symbol_name("flushControl")
    8225                            .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8226                            .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    8227                            .dwattr $C$DW$540, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8228                            .dwattr $C$DW$540, DW_AT_decl_line(0x9e)
    8229                            .dwattr $C$DW$540, DW_AT_decl_column(0x08)
    8230                    
    8231                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8232                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x95)
    8233                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x01)
    8234                            .dwendtag $C$DW$T$103
    8235                    
    8236                    $C$DW$T$227     .dwtag  DW_TAG_typedef
    8237                            .dwattr $C$DW$T$227, DW_AT_name("halUARTIoctl_t")
    8238                            .dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$103)
    8239                            .dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C)
    8240                            .dwattr $C$DW$T$227, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8241                            .dwattr $C$DW$T$227, DW_AT_decl_line(0x9f)
    8242                            .dwattr $C$DW$T$227, DW_AT_decl_column(0x02)
    8243                    
    8244                    
    8245                    $C$DW$T$108     .dwtag  DW_TAG_structure_type
    8246                            .dwattr $C$DW$T$108, DW_AT_name(".ggroup1")
    8247                            .dwattr $C$DW$T$108, DW_AT_byte_size(0x2c)
    8248                    $C$DW$541       .dwtag  DW_TAG_member
    8249                            .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$6)
    8250                            .dwattr $C$DW$541, DW_AT_name("activeTaskID")
    8251                            .dwattr $C$DW$541, DW_AT_TI_symbol_name("activeTaskID")
    8252                            .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8253                            .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    8254                    
    8255                    $C$DW$542       .dwtag  DW_TAG_member
    8256                            .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$6)
    8257                            .dwattr $C$DW$542, DW_AT_name("osal_notask_entity")
    8258                            .dwattr $C$DW$542, DW_AT_TI_symbol_name("osal_notask_entity")
    8259                            .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8260                            .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    8261                    
    8262                    $C$DW$543       .dwtag  DW_TAG_member
    8263                            .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$104)
    8264                            .dwattr $C$DW$543, DW_AT_name("osal_proxy_tasks")
    8265                            .dwattr $C$DW$543, DW_AT_TI_symbol_name("osal_proxy_tasks")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  152

    8266                            .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8267                            .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    8268                    
    8269                    $C$DW$544       .dwtag  DW_TAG_member
    8270                            .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$3)
    8271                            .dwattr $C$DW$544, DW_AT_name("osal_qHead")
    8272                            .dwattr $C$DW$544, DW_AT_TI_symbol_name("osal_qHead")
    8273                            .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8274                            .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    8275                    
    8276                    $C$DW$545       .dwtag  DW_TAG_member
    8277                            .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$42)
    8278                            .dwattr $C$DW$545, DW_AT_name("osal_eventloop_hook")
    8279                            .dwattr $C$DW$545, DW_AT_TI_symbol_name("osal_eventloop_hook")
    8280                            .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8281                            .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    8282                    
    8283                    $C$DW$546       .dwtag  DW_TAG_member
    8284                            .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$106)
    8285                            .dwattr $C$DW$546, DW_AT_name("osal_icallMsg_hook")
    8286                            .dwattr $C$DW$546, DW_AT_TI_symbol_name("osal_icallMsg_hook")
    8287                            .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8288                            .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    8289                    
    8290                    $C$DW$547       .dwtag  DW_TAG_member
    8291                            .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$3)
    8292                            .dwattr $C$DW$547, DW_AT_name("osal_semaphore")
    8293                            .dwattr $C$DW$547, DW_AT_TI_symbol_name("osal_semaphore")
    8294                            .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8295                            .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    8296                    
    8297                    $C$DW$548       .dwtag  DW_TAG_member
    8298                            .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$11)
    8299                            .dwattr $C$DW$548, DW_AT_name("osal_last_timestamp")
    8300                            .dwattr $C$DW$548, DW_AT_TI_symbol_name("osal_last_timestamp")
    8301                            .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8302                            .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    8303                    
    8304                    $C$DW$549       .dwtag  DW_TAG_member
    8305                            .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$11)
    8306                            .dwattr $C$DW$549, DW_AT_name("osal_tickperiod")
    8307                            .dwattr $C$DW$549, DW_AT_TI_symbol_name("osal_tickperiod")
    8308                            .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8309                            .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    8310                    
    8311                    $C$DW$550       .dwtag  DW_TAG_member
    8312                            .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$11)
    8313                            .dwattr $C$DW$550, DW_AT_name("osal_max_msecs")
    8314                            .dwattr $C$DW$550, DW_AT_TI_symbol_name("osal_max_msecs")
    8315                            .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8316                            .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    8317                    
    8318                    $C$DW$551       .dwtag  DW_TAG_member
    8319                            .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$3)
    8320                            .dwattr $C$DW$551, DW_AT_name("osal_timerid_msec_timer")
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  153

    8321                            .dwattr $C$DW$551, DW_AT_TI_symbol_name("osal_timerid_msec_timer")
    8322                            .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8323                            .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    8324                    
    8325                    $C$DW$552       .dwtag  DW_TAG_member
    8326                            .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$11)
    8327                            .dwattr $C$DW$552, DW_AT_name("osal_msec_timer_seq")
    8328                            .dwattr $C$DW$552, DW_AT_TI_symbol_name("osal_msec_timer_seq")
    8329                            .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8330                            .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    8331                    
    8332                    $C$DW$553       .dwtag  DW_TAG_member
    8333                            .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$107)
    8334                            .dwattr $C$DW$553, DW_AT_name("osal_dispatch_entities")
    8335                            .dwattr $C$DW$553, DW_AT_TI_symbol_name("osal_dispatch_entities")
    8336                            .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8337                            .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    8338                    
    8339                            .dwendtag $C$DW$T$108
    8340                    
    8341                    
    8342                    $C$DW$T$109     .dwtag  DW_TAG_structure_type
    8343                            .dwattr $C$DW$T$109, DW_AT_name("S3_1")
    8344                            .dwattr $C$DW$T$109, DW_AT_declaration
    8345                            .dwendtag $C$DW$T$109
    8346                    
    8347                    
    8348                    $C$DW$T$110     .dwtag  DW_TAG_structure_type
    8349                            .dwattr $C$DW$T$110, DW_AT_name("S3_1")
    8350                            .dwattr $C$DW$T$110, DW_AT_declaration
    8351                            .dwendtag $C$DW$T$110
    8352                    
    8353                    
    8354                    $C$DW$T$111     .dwtag  DW_TAG_structure_type
    8355                            .dwattr $C$DW$T$111, DW_AT_name("S3_5")
    8356                            .dwattr $C$DW$T$111, DW_AT_declaration
    8357                            .dwendtag $C$DW$T$111
    8358                    
    8359                    
    8360                    $C$DW$T$112     .dwtag  DW_TAG_structure_type
    8361                            .dwattr $C$DW$T$112, DW_AT_name("S3_7")
    8362                            .dwattr $C$DW$T$112, DW_AT_declaration
    8363                            .dwendtag $C$DW$T$112
    8364                    
    8365                    
    8366                    $C$DW$T$113     .dwtag  DW_TAG_structure_type
    8367                            .dwattr $C$DW$T$113, DW_AT_name("S4_3")
    8368                            .dwattr $C$DW$T$113, DW_AT_declaration
    8369                            .dwendtag $C$DW$T$113
    8370                    
    8371                    
    8372                    $C$DW$T$114     .dwtag  DW_TAG_structure_type
    8373                            .dwattr $C$DW$T$114, DW_AT_name("S4_3")
    8374                            .dwattr $C$DW$T$114, DW_AT_declaration
    8375                            .dwendtag $C$DW$T$114
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  154

    8376                    
    8377                    
    8378                    $C$DW$T$115     .dwtag  DW_TAG_structure_type
    8379                            .dwattr $C$DW$T$115, DW_AT_name("S4_7")
    8380                            .dwattr $C$DW$T$115, DW_AT_declaration
    8381                            .dwendtag $C$DW$T$115
    8382                    
    8383                    
    8384                    $C$DW$T$116     .dwtag  DW_TAG_structure_type
    8385                            .dwattr $C$DW$T$116, DW_AT_name("S4_9")
    8386                            .dwattr $C$DW$T$116, DW_AT_declaration
    8387                            .dwendtag $C$DW$T$116
    8388                    
    8389                    
    8390                    $C$DW$T$117     .dwtag  DW_TAG_structure_type
    8391                            .dwattr $C$DW$T$117, DW_AT_name("S5_11")
    8392                            .dwattr $C$DW$T$117, DW_AT_declaration
    8393                            .dwendtag $C$DW$T$117
    8394                    
    8395                    
    8396                    $C$DW$T$118     .dwtag  DW_TAG_structure_type
    8397                            .dwattr $C$DW$T$118, DW_AT_name("S5_5")
    8398                            .dwattr $C$DW$T$118, DW_AT_declaration
    8399                            .dwendtag $C$DW$T$118
    8400                    
    8401                    
    8402                    $C$DW$T$119     .dwtag  DW_TAG_structure_type
    8403                            .dwattr $C$DW$T$119, DW_AT_name("S6_13")
    8404                            .dwattr $C$DW$T$119, DW_AT_declaration
    8405                            .dwendtag $C$DW$T$119
    8406                    
    8407                    
    8408                    $C$DW$T$120     .dwtag  DW_TAG_union_type
    8409                            .dwattr $C$DW$T$120, DW_AT_name("U3_0")
    8410                            .dwattr $C$DW$T$120, DW_AT_declaration
    8411                            .dwendtag $C$DW$T$120
    8412                    
    8413                    
    8414                    $C$DW$T$121     .dwtag  DW_TAG_union_type
    8415                            .dwattr $C$DW$T$121, DW_AT_name("U3_0")
    8416                            .dwattr $C$DW$T$121, DW_AT_declaration
    8417                            .dwendtag $C$DW$T$121
    8418                    
    8419                    
    8420                    $C$DW$T$122     .dwtag  DW_TAG_union_type
    8421                            .dwattr $C$DW$T$122, DW_AT_name("U4_2")
    8422                            .dwattr $C$DW$T$122, DW_AT_declaration
    8423                            .dwendtag $C$DW$T$122
    8424                    
    8425                    
    8426                    $C$DW$T$123     .dwtag  DW_TAG_union_type
    8427                            .dwattr $C$DW$T$123, DW_AT_name("U4_2")
    8428                            .dwattr $C$DW$T$123, DW_AT_declaration
    8429                            .dwendtag $C$DW$T$123
    8430                    
TI ARM Assembler PC v18.1.3 Wed Nov 28 13:22:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Adrian\AppData\Local\Temp\{E6274538-D0E8-44F3-B4BB-1682CFFF4EE6} PAGE  155

    8431                    
    8432                    $C$DW$T$124     .dwtag  DW_TAG_union_type
    8433                            .dwattr $C$DW$T$124, DW_AT_name("U4_6")
    8434                            .dwattr $C$DW$T$124, DW_AT_declaration
    8435                            .dwendtag $C$DW$T$124
    8436                    
    8437                    
    8438                    $C$DW$T$125     .dwtag  DW_TAG_union_type
